;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Fri Jun  9 09:09:55 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../driver.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
;	Interrupt vector table mappings
	.intvec	".int44",	stepper_driver_isr
	.intvec	".int53",	stepper_pulse_isr
	.intvec	".int52",	stepper_pulse_isr_delayed
	.intvec	".int57",	software_debounce_isr
	.intvec	".int47",	control_isr
	.intvec	".int42",	limit_isr
	.intvec	".int59",	systick_isr
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("PAIN_L")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("PAIN_L")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$831)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external

	.dwattr $C$DW$1103, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$1103, DW_AT_const_value(0x2d)
	.dwattr $C$DW$1103, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1103, DW_AT_decl_line(0x54)
	.dwattr $C$DW$1103, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$765, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$765, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$765, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$765

$C$DW$T$766	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$766, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$766, DW_AT_type(*$C$DW$T$765)
	.dwattr $C$DW$T$766, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$766, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$766, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$766, DW_AT_decl_column(0x03)


$C$DW$T$767	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$767, DW_AT_byte_size(0x02)
$C$DW$1104	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1104, DW_AT_name("Message_Plain")
	.dwattr $C$DW$1104, DW_AT_const_value(0x00)
	.dwattr $C$DW$1104, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1104, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1104, DW_AT_decl_column(0x05)

$C$DW$1105	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1105, DW_AT_name("Message_Info")
	.dwattr $C$DW$1105, DW_AT_const_value(0x01)
	.dwattr $C$DW$1105, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1105, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1105, DW_AT_decl_column(0x05)

$C$DW$1106	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1106, DW_AT_name("Message_Warning")
	.dwattr $C$DW$1106, DW_AT_const_value(0x02)
	.dwattr $C$DW$1106, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1106, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1106, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$767, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$767, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$767, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$767

$C$DW$T$768	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$768, DW_AT_name("message_type_t")
	.dwattr $C$DW$T$768, DW_AT_type(*$C$DW$T$767)
	.dwattr $C$DW$T$768, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$768, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$768, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$768, DW_AT_decl_column(0x03)


$C$DW$T$769	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$769, DW_AT_byte_size(0x02)
$C$DW$1107	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1107, DW_AT_name("SettingsFormat_MachineReadable")
	.dwattr $C$DW$1107, DW_AT_const_value(0x00)
	.dwattr $C$DW$1107, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1107, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1107, DW_AT_decl_column(0x05)

$C$DW$1108	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1108, DW_AT_name("SettingsFormat_HumanReadable")
	.dwattr $C$DW$1108, DW_AT_const_value(0x01)
	.dwattr $C$DW$1108, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1108, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1108, DW_AT_decl_column(0x05)

$C$DW$1109	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1109, DW_AT_name("SettingsFormat_Grbl")
	.dwattr $C$DW$1109, DW_AT_const_value(0x02)
	.dwattr $C$DW$1109, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1109, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1109, DW_AT_decl_column(0x05)

$C$DW$1110	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1110, DW_AT_name("SettingsFormat_grblHAL")
	.dwattr $C$DW$1110, DW_AT_const_value(0x03)
	.dwattr $C$DW$1110, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1110, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1110, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$769, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$769, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$769, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$769

$C$DW$T$770	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$770, DW_AT_name("settings_format_t")
	.dwattr $C$DW$T$770, DW_AT_type(*$C$DW$T$769)
	.dwattr $C$DW$T$770, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$770, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$770, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$770, DW_AT_decl_column(0x03)


$C$DW$T$771	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$771, DW_AT_byte_size(0x02)
$C$DW$1111	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1111, DW_AT_name("PullMode_None")
	.dwattr $C$DW$1111, DW_AT_const_value(0x00)
	.dwattr $C$DW$1111, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1111, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1111, DW_AT_decl_column(0x05)

$C$DW$1112	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1112, DW_AT_name("PullMode_Up")
	.dwattr $C$DW$1112, DW_AT_const_value(0x01)
	.dwattr $C$DW$1112, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1112, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1112, DW_AT_decl_column(0x05)

$C$DW$1113	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1113, DW_AT_name("PullMode_Down")
	.dwattr $C$DW$1113, DW_AT_const_value(0x02)
	.dwattr $C$DW$1113, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1113, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1113, DW_AT_decl_column(0x05)

$C$DW$1114	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1114, DW_AT_name("PullMode_UpDown")
	.dwattr $C$DW$1114, DW_AT_const_value(0x03)
	.dwattr $C$DW$1114, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1114, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1114, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$771, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$771, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$771, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$771

$C$DW$T$772	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$772, DW_AT_name("pull_mode_t")
	.dwattr $C$DW$T$772, DW_AT_type(*$C$DW$T$771)
	.dwattr $C$DW$T$772, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$772, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$772, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$772, DW_AT_decl_column(0x03)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
$C$DW$1115	.dwtag  DW_TAG_member
	.dwattr $C$DW$1115, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1115, DW_AT_name("connected")
	.dwattr $C$DW$1115, DW_AT_TI_symbol_name("connected")
	.dwattr $C$DW$1115, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1115, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1115, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1115, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1115, DW_AT_decl_column(0x11)

$C$DW$1116	.dwtag  DW_TAG_member
	.dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1116, DW_AT_name("webui_connected")
	.dwattr $C$DW$1116, DW_AT_TI_symbol_name("webui_connected")
	.dwattr $C$DW$1116, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1116, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1116, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1116, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$1116, DW_AT_decl_column(0x11)

$C$DW$1117	.dwtag  DW_TAG_member
	.dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1117, DW_AT_name("is_usb")
	.dwattr $C$DW$1117, DW_AT_TI_symbol_name("is_usb")
	.dwattr $C$DW$1117, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1117, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1117, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1117, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$1117, DW_AT_decl_column(0x11)

$C$DW$1118	.dwtag  DW_TAG_member
	.dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1118, DW_AT_name("unused")
	.dwattr $C$DW$1118, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$1118, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1118, DW_AT_bit_size(0x05)
	.dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1118, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1118, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$1118, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$23


$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x44)
$C$DW$1119	.dwtag  DW_TAG_member
	.dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$1119, DW_AT_name("type")
	.dwattr $C$DW$1119, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1119, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1119, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1119, DW_AT_decl_column(0x13)

$C$DW$1120	.dwtag  DW_TAG_member
	.dwattr $C$DW$1120, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1120, DW_AT_name("instance")
	.dwattr $C$DW$1120, DW_AT_TI_symbol_name("instance")
	.dwattr $C$DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1120, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1120, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1120, DW_AT_decl_column(0x0d)

$C$DW$1121	.dwtag  DW_TAG_member
	.dwattr $C$DW$1121, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$1121, DW_AT_name("state")
	.dwattr $C$DW$1121, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1121, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1121, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1121, DW_AT_decl_column(0x17)

$C$DW$1122	.dwtag  DW_TAG_member
	.dwattr $C$DW$1122, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1122, DW_AT_name("get_rx_buffer_free")
	.dwattr $C$DW$1122, DW_AT_TI_symbol_name("get_rx_buffer_free")
	.dwattr $C$DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1122, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1122, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1122, DW_AT_decl_column(0x21)

$C$DW$1123	.dwtag  DW_TAG_member
	.dwattr $C$DW$1123, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$1123, DW_AT_name("write")
	.dwattr $C$DW$1123, DW_AT_TI_symbol_name("write")
	.dwattr $C$DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1123, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1123, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1123, DW_AT_decl_column(0x16)

$C$DW$1124	.dwtag  DW_TAG_member
	.dwattr $C$DW$1124, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$1124, DW_AT_name("write_all")
	.dwattr $C$DW$1124, DW_AT_TI_symbol_name("write_all")
	.dwattr $C$DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1124, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1124, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1124, DW_AT_decl_column(0x16)

$C$DW$1125	.dwtag  DW_TAG_member
	.dwattr $C$DW$1125, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$1125, DW_AT_name("write_char")
	.dwattr $C$DW$1125, DW_AT_TI_symbol_name("write_char")
	.dwattr $C$DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1125, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1125, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1125, DW_AT_decl_column(0x1b)

$C$DW$1126	.dwtag  DW_TAG_member
	.dwattr $C$DW$1126, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1126, DW_AT_name("enqueue_rt_command")
	.dwattr $C$DW$1126, DW_AT_TI_symbol_name("enqueue_rt_command")
	.dwattr $C$DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1126, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1126, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1126, DW_AT_decl_column(0x23)

$C$DW$1127	.dwtag  DW_TAG_member
	.dwattr $C$DW$1127, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1127, DW_AT_name("read")
	.dwattr $C$DW$1127, DW_AT_TI_symbol_name("read")
	.dwattr $C$DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1127, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1127, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1127, DW_AT_decl_column(0x15)

$C$DW$1128	.dwtag  DW_TAG_member
	.dwattr $C$DW$1128, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1128, DW_AT_name("reset_read_buffer")
	.dwattr $C$DW$1128, DW_AT_TI_symbol_name("reset_read_buffer")
	.dwattr $C$DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1128, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1128, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1128, DW_AT_decl_column(0x1d)

$C$DW$1129	.dwtag  DW_TAG_member
	.dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$1129, DW_AT_name("cancel_read_buffer")
	.dwattr $C$DW$1129, DW_AT_TI_symbol_name("cancel_read_buffer")
	.dwattr $C$DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1129, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1129, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1129, DW_AT_decl_column(0x1c)

$C$DW$1130	.dwtag  DW_TAG_member
	.dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1130, DW_AT_name("set_enqueue_rt_handler")
	.dwattr $C$DW$1130, DW_AT_TI_symbol_name("set_enqueue_rt_handler")
	.dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1130, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1130, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1130, DW_AT_decl_column(0x20)

$C$DW$1131	.dwtag  DW_TAG_member
	.dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1131, DW_AT_name("suspend_read")
	.dwattr $C$DW$1131, DW_AT_TI_symbol_name("suspend_read")
	.dwattr $C$DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1131, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1131, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1131, DW_AT_decl_column(0x16)

$C$DW$1132	.dwtag  DW_TAG_member
	.dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$1132, DW_AT_name("write_n")
	.dwattr $C$DW$1132, DW_AT_TI_symbol_name("write_n")
	.dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1132, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1132, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1132, DW_AT_decl_column(0x18)

$C$DW$1133	.dwtag  DW_TAG_member
	.dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1133, DW_AT_name("disable_rx")
	.dwattr $C$DW$1133, DW_AT_TI_symbol_name("disable_rx")
	.dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1133, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1133, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1133, DW_AT_decl_column(0x1b)

$C$DW$1134	.dwtag  DW_TAG_member
	.dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1134, DW_AT_name("get_rx_buffer_count")
	.dwattr $C$DW$1134, DW_AT_TI_symbol_name("get_rx_buffer_count")
	.dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1134, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1134, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1134, DW_AT_decl_column(0x21)

$C$DW$1135	.dwtag  DW_TAG_member
	.dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1135, DW_AT_name("get_tx_buffer_count")
	.dwattr $C$DW$1135, DW_AT_TI_symbol_name("get_tx_buffer_count")
	.dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1135, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1135, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1135, DW_AT_decl_column(0x21)

$C$DW$1136	.dwtag  DW_TAG_member
	.dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1136, DW_AT_name("reset_write_buffer")
	.dwattr $C$DW$1136, DW_AT_TI_symbol_name("reset_write_buffer")
	.dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1136, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1136, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1136, DW_AT_decl_column(0x1d)

$C$DW$1137	.dwtag  DW_TAG_member
	.dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1137, DW_AT_name("set_baud_rate")
	.dwattr $C$DW$1137, DW_AT_TI_symbol_name("set_baud_rate")
	.dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1137, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$1137, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1137, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$70, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$70

$C$DW$T$549	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$549, DW_AT_name("io_stream_t")
	.dwattr $C$DW$T$549, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$549, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$549, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$549, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$T$549, DW_AT_decl_column(0x03)

$C$DW$1138	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$549)

$C$DW$T$550	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$550, DW_AT_type(*$C$DW$1138)

$C$DW$T$551	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$551, DW_AT_type(*$C$DW$T$550)
	.dwattr $C$DW$T$551, DW_AT_address_class(0x14)


$C$DW$T$585	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$585, DW_AT_type(*$C$DW$T$551)
	.dwattr $C$DW$T$585, DW_AT_language(DW_LANG_C)
$C$DW$1139	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$66)

	.dwendtag $C$DW$T$585

$C$DW$T$586	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$586, DW_AT_type(*$C$DW$T$585)
	.dwattr $C$DW$T$586, DW_AT_address_class(0x14)

$C$DW$T$587	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$587, DW_AT_name("stream_claim_ptr")
	.dwattr $C$DW$T$587, DW_AT_type(*$C$DW$T$586)
	.dwattr $C$DW$T$587, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$587, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$587, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$587, DW_AT_decl_column(0x1e)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x0c)
$C$DW$1140	.dwtag  DW_TAG_member
	.dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1140, DW_AT_name("rpm")
	.dwattr $C$DW$1140, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1140, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1140, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$1140, DW_AT_decl_column(0x0b)

$C$DW$1141	.dwtag  DW_TAG_member
	.dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1141, DW_AT_name("start")
	.dwattr $C$DW$1141, DW_AT_TI_symbol_name("start")
	.dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1141, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1141, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1141, DW_AT_decl_column(0x0b)

$C$DW$1142	.dwtag  DW_TAG_member
	.dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1142, DW_AT_name("end")
	.dwattr $C$DW$1142, DW_AT_TI_symbol_name("end")
	.dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1142, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1142, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1142, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$71, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$71

$C$DW$T$76	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$76, DW_AT_name("pwm_piece_t")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$76, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x03)


$C$DW$T$77	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x30)
$C$DW$1143	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1143, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$77


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x42)
$C$DW$1144	.dwtag  DW_TAG_member
	.dwattr $C$DW$1144, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1144, DW_AT_name("period")
	.dwattr $C$DW$1144, DW_AT_TI_symbol_name("period")
	.dwattr $C$DW$1144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1144, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1144, DW_AT_decl_line(0x32)
	.dwattr $C$DW$1144, DW_AT_decl_column(0x13)

$C$DW$1145	.dwtag  DW_TAG_member
	.dwattr $C$DW$1145, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1145, DW_AT_name("off_value")
	.dwattr $C$DW$1145, DW_AT_TI_symbol_name("off_value")
	.dwattr $C$DW$1145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1145, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1145, DW_AT_decl_line(0x33)
	.dwattr $C$DW$1145, DW_AT_decl_column(0x13)

$C$DW$1146	.dwtag  DW_TAG_member
	.dwattr $C$DW$1146, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1146, DW_AT_name("min_value")
	.dwattr $C$DW$1146, DW_AT_TI_symbol_name("min_value")
	.dwattr $C$DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1146, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1146, DW_AT_decl_line(0x34)
	.dwattr $C$DW$1146, DW_AT_decl_column(0x13)

$C$DW$1147	.dwtag  DW_TAG_member
	.dwattr $C$DW$1147, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1147, DW_AT_name("max_value")
	.dwattr $C$DW$1147, DW_AT_TI_symbol_name("max_value")
	.dwattr $C$DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1147, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1147, DW_AT_decl_line(0x35)
	.dwattr $C$DW$1147, DW_AT_decl_column(0x13)

$C$DW$1148	.dwtag  DW_TAG_member
	.dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1148, DW_AT_name("pwm_gradient")
	.dwattr $C$DW$1148, DW_AT_TI_symbol_name("pwm_gradient")
	.dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1148, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1148, DW_AT_decl_line(0x36)
	.dwattr $C$DW$1148, DW_AT_decl_column(0x0b)

$C$DW$1149	.dwtag  DW_TAG_member
	.dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1149, DW_AT_name("invert_pwm")
	.dwattr $C$DW$1149, DW_AT_TI_symbol_name("invert_pwm")
	.dwattr $C$DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1149, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1149, DW_AT_decl_line(0x37)
	.dwattr $C$DW$1149, DW_AT_decl_column(0x0a)

$C$DW$1150	.dwtag  DW_TAG_member
	.dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1150, DW_AT_name("always_on")
	.dwattr $C$DW$1150, DW_AT_TI_symbol_name("always_on")
	.dwattr $C$DW$1150, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1150, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1150, DW_AT_decl_line(0x38)
	.dwattr $C$DW$1150, DW_AT_decl_column(0x0a)

$C$DW$1151	.dwtag  DW_TAG_member
	.dwattr $C$DW$1151, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$1151, DW_AT_name("offset")
	.dwattr $C$DW$1151, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$1151, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1151, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1151, DW_AT_decl_line(0x39)
	.dwattr $C$DW$1151, DW_AT_decl_column(0x12)

$C$DW$1152	.dwtag  DW_TAG_member
	.dwattr $C$DW$1152, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1152, DW_AT_name("n_pieces")
	.dwattr $C$DW$1152, DW_AT_TI_symbol_name("n_pieces")
	.dwattr $C$DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1152, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1152, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$1152, DW_AT_decl_column(0x13)

$C$DW$1153	.dwtag  DW_TAG_member
	.dwattr $C$DW$1153, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1153, DW_AT_name("piece")
	.dwattr $C$DW$1153, DW_AT_TI_symbol_name("piece")
	.dwattr $C$DW$1153, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1153, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1153, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$1153, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$78, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$78

$C$DW$T$776	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$776, DW_AT_name("spindle_pwm_t")
	.dwattr $C$DW$T$776, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$776, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$776, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$776, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$776, DW_AT_decl_column(0x03)

$C$DW$T$777	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$777, DW_AT_type(*$C$DW$T$776)
	.dwattr $C$DW$T$777, DW_AT_address_class(0x14)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x01)
$C$DW$1154	.dwtag  DW_TAG_member
	.dwattr $C$DW$1154, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1154, DW_AT_name("x")
	.dwattr $C$DW$1154, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1154, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1154, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1154, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1154, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1154, DW_AT_decl_column(0x11)

$C$DW$1155	.dwtag  DW_TAG_member
	.dwattr $C$DW$1155, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1155, DW_AT_name("y")
	.dwattr $C$DW$1155, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1155, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1155, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1155, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1155, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1155, DW_AT_decl_column(0x11)

$C$DW$1156	.dwtag  DW_TAG_member
	.dwattr $C$DW$1156, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1156, DW_AT_name("z")
	.dwattr $C$DW$1156, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1156, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1156, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1156, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1156, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1156, DW_AT_decl_column(0x11)

$C$DW$1157	.dwtag  DW_TAG_member
	.dwattr $C$DW$1157, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1157, DW_AT_name("a")
	.dwattr $C$DW$1157, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1157, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1157, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1157, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1157, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1157, DW_AT_decl_column(0x11)

$C$DW$1158	.dwtag  DW_TAG_member
	.dwattr $C$DW$1158, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1158, DW_AT_name("b")
	.dwattr $C$DW$1158, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$1158, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1158, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1158, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1158, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1158, DW_AT_decl_column(0x11)

$C$DW$1159	.dwtag  DW_TAG_member
	.dwattr $C$DW$1159, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1159, DW_AT_name("c")
	.dwattr $C$DW$1159, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$1159, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1159, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1159, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1159, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1159, DW_AT_decl_column(0x11)

$C$DW$1160	.dwtag  DW_TAG_member
	.dwattr $C$DW$1160, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1160, DW_AT_name("u")
	.dwattr $C$DW$1160, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$1160, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1160, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1160, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1160, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1160, DW_AT_decl_column(0x11)

$C$DW$1161	.dwtag  DW_TAG_member
	.dwattr $C$DW$1161, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1161, DW_AT_name("v")
	.dwattr $C$DW$1161, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$1161, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1161, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1161, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1161, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1161, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$79, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$79


$C$DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x04)
$C$DW$1162	.dwtag  DW_TAG_member
	.dwattr $C$DW$1162, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1162, DW_AT_name("min")
	.dwattr $C$DW$1162, DW_AT_TI_symbol_name("min")
	.dwattr $C$DW$1162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1162, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1162, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1162, DW_AT_decl_column(0x14)

$C$DW$1163	.dwtag  DW_TAG_member
	.dwattr $C$DW$1163, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1163, DW_AT_name("max")
	.dwattr $C$DW$1163, DW_AT_TI_symbol_name("max")
	.dwattr $C$DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1163, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1163, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1163, DW_AT_decl_column(0x14)

$C$DW$1164	.dwtag  DW_TAG_member
	.dwattr $C$DW$1164, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1164, DW_AT_name("min2")
	.dwattr $C$DW$1164, DW_AT_TI_symbol_name("min2")
	.dwattr $C$DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1164, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1164, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$1164, DW_AT_decl_column(0x14)

$C$DW$1165	.dwtag  DW_TAG_member
	.dwattr $C$DW$1165, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1165, DW_AT_name("max2")
	.dwattr $C$DW$1165, DW_AT_TI_symbol_name("max2")
	.dwattr $C$DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1165, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1165, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1165, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$81, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$81, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$81, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$81

$C$DW$T$268	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$268, DW_AT_name("limit_signals_t")
	.dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$268, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$268, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$268, DW_AT_decl_column(0x03)


$C$DW$T$269	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$268)
	.dwattr $C$DW$T$269, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$269

$C$DW$T$270	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$270, DW_AT_type(*$C$DW$T$269)
	.dwattr $C$DW$T$270, DW_AT_address_class(0x14)

$C$DW$T$271	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$271, DW_AT_name("limits_get_state_ptr")
	.dwattr $C$DW$T$271, DW_AT_type(*$C$DW$T$270)
	.dwattr $C$DW$T$271, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$271, DW_AT_decl_file("..\grbl/hal.h")
	.dwattr $C$DW$T$271, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$271, DW_AT_decl_column(0x1b)

$C$DW$1166	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1166, DW_AT_type(*$C$DW$T$268)

$C$DW$T$781	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$781, DW_AT_type(*$C$DW$1166)


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
$C$DW$1167	.dwtag  DW_TAG_member
	.dwattr $C$DW$1167, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1167, DW_AT_name("feed_rate_disable")
	.dwattr $C$DW$1167, DW_AT_TI_symbol_name("feed_rate_disable")
	.dwattr $C$DW$1167, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1167, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1167, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1167, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1167, DW_AT_decl_column(0x11)

$C$DW$1168	.dwtag  DW_TAG_member
	.dwattr $C$DW$1168, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1168, DW_AT_name("feed_hold_disable")
	.dwattr $C$DW$1168, DW_AT_TI_symbol_name("feed_hold_disable")
	.dwattr $C$DW$1168, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1168, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1168, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1168, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1168, DW_AT_decl_column(0x11)

$C$DW$1169	.dwtag  DW_TAG_member
	.dwattr $C$DW$1169, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1169, DW_AT_name("spindle_rpm_disable")
	.dwattr $C$DW$1169, DW_AT_TI_symbol_name("spindle_rpm_disable")
	.dwattr $C$DW$1169, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1169, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1169, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1169, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1169, DW_AT_decl_column(0x11)

$C$DW$1170	.dwtag  DW_TAG_member
	.dwattr $C$DW$1170, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1170, DW_AT_name("parking_disable")
	.dwattr $C$DW$1170, DW_AT_TI_symbol_name("parking_disable")
	.dwattr $C$DW$1170, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1170, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1170, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1170, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1170, DW_AT_decl_column(0x11)

$C$DW$1171	.dwtag  DW_TAG_member
	.dwattr $C$DW$1171, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1171, DW_AT_name("reserved")
	.dwattr $C$DW$1171, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$1171, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1171, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1171, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1171, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1171, DW_AT_decl_column(0x11)

$C$DW$1172	.dwtag  DW_TAG_member
	.dwattr $C$DW$1172, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1172, DW_AT_name("sync")
	.dwattr $C$DW$1172, DW_AT_TI_symbol_name("sync")
	.dwattr $C$DW$1172, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1172, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1172, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1172, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1172, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$82, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$82


$C$DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x02)
$C$DW$1173	.dwtag  DW_TAG_member
	.dwattr $C$DW$1173, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1173, DW_AT_name("reset")
	.dwattr $C$DW$1173, DW_AT_TI_symbol_name("reset")
	.dwattr $C$DW$1173, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1173, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1173, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1173, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1173, DW_AT_decl_column(0x12)

$C$DW$1174	.dwtag  DW_TAG_member
	.dwattr $C$DW$1174, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1174, DW_AT_name("feed_hold")
	.dwattr $C$DW$1174, DW_AT_TI_symbol_name("feed_hold")
	.dwattr $C$DW$1174, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1174, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1174, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x12)

$C$DW$1175	.dwtag  DW_TAG_member
	.dwattr $C$DW$1175, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1175, DW_AT_name("cycle_start")
	.dwattr $C$DW$1175, DW_AT_TI_symbol_name("cycle_start")
	.dwattr $C$DW$1175, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1175, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1175, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1175, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1175, DW_AT_decl_column(0x12)

$C$DW$1176	.dwtag  DW_TAG_member
	.dwattr $C$DW$1176, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1176, DW_AT_name("safety_door_ajar")
	.dwattr $C$DW$1176, DW_AT_TI_symbol_name("safety_door_ajar")
	.dwattr $C$DW$1176, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1176, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1176, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1176, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x12)

$C$DW$1177	.dwtag  DW_TAG_member
	.dwattr $C$DW$1177, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1177, DW_AT_name("block_delete")
	.dwattr $C$DW$1177, DW_AT_TI_symbol_name("block_delete")
	.dwattr $C$DW$1177, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1177, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1177, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1177, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x12)

$C$DW$1178	.dwtag  DW_TAG_member
	.dwattr $C$DW$1178, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1178, DW_AT_name("stop_disable")
	.dwattr $C$DW$1178, DW_AT_TI_symbol_name("stop_disable")
	.dwattr $C$DW$1178, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1178, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1178, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1178, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x12)

$C$DW$1179	.dwtag  DW_TAG_member
	.dwattr $C$DW$1179, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1179, DW_AT_name("e_stop")
	.dwattr $C$DW$1179, DW_AT_TI_symbol_name("e_stop")
	.dwattr $C$DW$1179, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1179, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1179, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1179, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x12)

$C$DW$1180	.dwtag  DW_TAG_member
	.dwattr $C$DW$1180, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1180, DW_AT_name("probe_disconnected")
	.dwattr $C$DW$1180, DW_AT_TI_symbol_name("probe_disconnected")
	.dwattr $C$DW$1180, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1180, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1180, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1180, DW_AT_decl_line(0x83)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x12)

$C$DW$1181	.dwtag  DW_TAG_member
	.dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1181, DW_AT_name("motor_fault")
	.dwattr $C$DW$1181, DW_AT_TI_symbol_name("motor_fault")
	.dwattr $C$DW$1181, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1181, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1181, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1181, DW_AT_decl_line(0x84)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x12)

$C$DW$1182	.dwtag  DW_TAG_member
	.dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1182, DW_AT_name("motor_warning")
	.dwattr $C$DW$1182, DW_AT_TI_symbol_name("motor_warning")
	.dwattr $C$DW$1182, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1182, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1182, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x12)

$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1183, DW_AT_name("limits_override")
	.dwattr $C$DW$1183, DW_AT_TI_symbol_name("limits_override")
	.dwattr $C$DW$1183, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1183, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0x86)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x12)

$C$DW$1184	.dwtag  DW_TAG_member
	.dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1184, DW_AT_name("single_block")
	.dwattr $C$DW$1184, DW_AT_TI_symbol_name("single_block")
	.dwattr $C$DW$1184, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1184, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1184, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1184, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1184, DW_AT_decl_column(0x12)

$C$DW$1185	.dwtag  DW_TAG_member
	.dwattr $C$DW$1185, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1185, DW_AT_name("unassigned")
	.dwattr $C$DW$1185, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1185, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1185, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1185, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1185, DW_AT_decl_line(0x88)
	.dwattr $C$DW$1185, DW_AT_decl_column(0x12)

$C$DW$1186	.dwtag  DW_TAG_member
	.dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1186, DW_AT_name("probe_triggered")
	.dwattr $C$DW$1186, DW_AT_TI_symbol_name("probe_triggered")
	.dwattr $C$DW$1186, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1186, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1186, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x12)

$C$DW$1187	.dwtag  DW_TAG_member
	.dwattr $C$DW$1187, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1187, DW_AT_name("deasserted")
	.dwattr $C$DW$1187, DW_AT_TI_symbol_name("deasserted")
	.dwattr $C$DW$1187, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1187, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1187, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$83, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$83


$C$DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x01)
$C$DW$1188	.dwtag  DW_TAG_member
	.dwattr $C$DW$1188, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1188, DW_AT_name("triggered")
	.dwattr $C$DW$1188, DW_AT_TI_symbol_name("triggered")
	.dwattr $C$DW$1188, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1188, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1188, DW_AT_decl_file("..\grbl\probe.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x11)

$C$DW$1189	.dwtag  DW_TAG_member
	.dwattr $C$DW$1189, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1189, DW_AT_name("connected")
	.dwattr $C$DW$1189, DW_AT_TI_symbol_name("connected")
	.dwattr $C$DW$1189, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1189, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1189, DW_AT_decl_file("..\grbl\probe.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x11)

$C$DW$1190	.dwtag  DW_TAG_member
	.dwattr $C$DW$1190, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1190, DW_AT_name("inverted")
	.dwattr $C$DW$1190, DW_AT_TI_symbol_name("inverted")
	.dwattr $C$DW$1190, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1190, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1190, DW_AT_decl_file("..\grbl\probe.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x11)

$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1191, DW_AT_name("is_probing")
	.dwattr $C$DW$1191, DW_AT_TI_symbol_name("is_probing")
	.dwattr $C$DW$1191, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1191, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("..\grbl\probe.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x11)

$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1192, DW_AT_name("unassigned")
	.dwattr $C$DW$1192, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1192, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1192, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("..\grbl\probe.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$84, DW_AT_decl_file("..\grbl\probe.h")
	.dwattr $C$DW$T$84, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$84, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$84


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
$C$DW$1193	.dwtag  DW_TAG_member
	.dwattr $C$DW$1193, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1193, DW_AT_name("on")
	.dwattr $C$DW$1193, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$1193, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1193, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1193, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x11)

$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1194, DW_AT_name("ccw")
	.dwattr $C$DW$1194, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$1194, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1194, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x11)

$C$DW$1195	.dwtag  DW_TAG_member
	.dwattr $C$DW$1195, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1195, DW_AT_name("pwm")
	.dwattr $C$DW$1195, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$1195, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1195, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1195, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x11)

$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1196, DW_AT_name("reserved3")
	.dwattr $C$DW$1196, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$1196, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1196, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0x22)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x11)

$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1197, DW_AT_name("reserved4")
	.dwattr $C$DW$1197, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$1197, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1197, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x11)

$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1198, DW_AT_name("encoder_error")
	.dwattr $C$DW$1198, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$1198, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1198, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x11)

$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1199, DW_AT_name("at_speed")
	.dwattr $C$DW$1199, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$1199, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1199, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x11)

$C$DW$1200	.dwtag  DW_TAG_member
	.dwattr $C$DW$1200, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1200, DW_AT_name("synchronized")
	.dwattr $C$DW$1200, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$1200, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1200, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1200, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$85, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$85


$C$DW$T$86	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
$C$DW$1201	.dwtag  DW_TAG_member
	.dwattr $C$DW$1201, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1201, DW_AT_name("flood")
	.dwattr $C$DW$1201, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$1201, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1201, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1201, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x11)

$C$DW$1202	.dwtag  DW_TAG_member
	.dwattr $C$DW$1202, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1202, DW_AT_name("mist")
	.dwattr $C$DW$1202, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$1202, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1202, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1202, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x11)

$C$DW$1203	.dwtag  DW_TAG_member
	.dwattr $C$DW$1203, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1203, DW_AT_name("shower")
	.dwattr $C$DW$1203, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$1203, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1203, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1203, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x11)

$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1204, DW_AT_name("trough_spindle")
	.dwattr $C$DW$1204, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$1204, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1204, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x11)

$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1205, DW_AT_name("unused")
	.dwattr $C$DW$1205, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$1205, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1205, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$86, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$86


$C$DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x12)
$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1206, DW_AT_name("feed_rate")
	.dwattr $C$DW$1206, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0x22e)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x0b)

$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1207, DW_AT_name("seek_rate")
	.dwattr $C$DW$1207, DW_AT_TI_symbol_name("seek_rate")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x0b)

$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1208, DW_AT_name("pulloff_rate")
	.dwattr $C$DW$1208, DW_AT_TI_symbol_name("pulloff_rate")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0x230)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x0b)

$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1209, DW_AT_name("probing_distance")
	.dwattr $C$DW$1209, DW_AT_TI_symbol_name("probing_distance")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0x231)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x0b)

$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$1210, DW_AT_name("mode")
	.dwattr $C$DW$1210, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0x232)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x22d)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$89

$C$DW$T$122	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$122, DW_AT_name("tool_change_settings_t")
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$122, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$122, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$122, DW_AT_decl_column(0x03)


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x14)
$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1211, DW_AT_name("steps_per_mm")
	.dwattr $C$DW$1211, DW_AT_TI_symbol_name("steps_per_mm")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x0b)

$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1212, DW_AT_name("max_rate")
	.dwattr $C$DW$1212, DW_AT_TI_symbol_name("max_rate")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x0b)

$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1213, DW_AT_name("acceleration")
	.dwattr $C$DW$1213, DW_AT_TI_symbol_name("acceleration")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x0b)

$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1214, DW_AT_name("max_travel")
	.dwattr $C$DW$1214, DW_AT_TI_symbol_name("max_travel")
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x0b)

$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1215, DW_AT_name("dual_axis_offset")
	.dwattr $C$DW$1215, DW_AT_TI_symbol_name("dual_axis_offset")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$90

$C$DW$T$123	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$123, DW_AT_name("axis_settings_t")
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$123, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x03)


$C$DW$T$124	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$124, DW_AT_byte_size(0x3c)
$C$DW$1216	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1216, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$124


$C$DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x20)
$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1217, DW_AT_name("p_gain")
	.dwattr $C$DW$1217, DW_AT_TI_symbol_name("p_gain")
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1217, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x0b)

$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1218, DW_AT_name("i_gain")
	.dwattr $C$DW$1218, DW_AT_TI_symbol_name("i_gain")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0x198)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x0b)

$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1219, DW_AT_name("d_gain")
	.dwattr $C$DW$1219, DW_AT_TI_symbol_name("d_gain")
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x0b)

$C$DW$1220	.dwtag  DW_TAG_member
	.dwattr $C$DW$1220, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1220, DW_AT_name("p_max_error")
	.dwattr $C$DW$1220, DW_AT_TI_symbol_name("p_max_error")
	.dwattr $C$DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1220, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x0b)

$C$DW$1221	.dwtag  DW_TAG_member
	.dwattr $C$DW$1221, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1221, DW_AT_name("i_max_error")
	.dwattr $C$DW$1221, DW_AT_TI_symbol_name("i_max_error")
	.dwattr $C$DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1221, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x0b)

$C$DW$1222	.dwtag  DW_TAG_member
	.dwattr $C$DW$1222, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1222, DW_AT_name("d_max_error")
	.dwattr $C$DW$1222, DW_AT_TI_symbol_name("d_max_error")
	.dwattr $C$DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1222, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x0b)

$C$DW$1223	.dwtag  DW_TAG_member
	.dwattr $C$DW$1223, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1223, DW_AT_name("deadband")
	.dwattr $C$DW$1223, DW_AT_TI_symbol_name("deadband")
	.dwattr $C$DW$1223, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1223, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x0b)

$C$DW$1224	.dwtag  DW_TAG_member
	.dwattr $C$DW$1224, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1224, DW_AT_name("max_error")
	.dwattr $C$DW$1224, DW_AT_TI_symbol_name("max_error")
	.dwattr $C$DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1224, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$91, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$91, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$91

$C$DW$T$93	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$93, DW_AT_name("pid_values_t")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$93, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$93, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$93, DW_AT_decl_column(0x03)


$C$DW$T$92	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$92, DW_AT_byte_size(0x01)
$C$DW$1225	.dwtag  DW_TAG_member
	.dwattr $C$DW$1225, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1225, DW_AT_name("pwm_action")
	.dwattr $C$DW$1225, DW_AT_TI_symbol_name("pwm_action")
	.dwattr $C$DW$1225, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1225, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1225, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x11)

$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1226, DW_AT_name("unassigned")
	.dwattr $C$DW$1226, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1226, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1226, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$92, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$92, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$92, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$92


$C$DW$T$96	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x74)
$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1227, DW_AT_name("rpm_max")
	.dwattr $C$DW$1227, DW_AT_TI_symbol_name("rpm_max")
	.dwattr $C$DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x0b)

$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1228, DW_AT_name("rpm_min")
	.dwattr $C$DW$1228, DW_AT_TI_symbol_name("rpm_min")
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x0b)

$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1229, DW_AT_name("pwm_freq")
	.dwattr $C$DW$1229, DW_AT_TI_symbol_name("pwm_freq")
	.dwattr $C$DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x0b)

$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1230, DW_AT_name("pwm_period")
	.dwattr $C$DW$1230, DW_AT_TI_symbol_name("pwm_period")
	.dwattr $C$DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x0b)

$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1231, DW_AT_name("pwm_off_value")
	.dwattr $C$DW$1231, DW_AT_TI_symbol_name("pwm_off_value")
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x0b)

$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1232, DW_AT_name("pwm_min_value")
	.dwattr $C$DW$1232, DW_AT_TI_symbol_name("pwm_min_value")
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x0b)

$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1233, DW_AT_name("pwm_max_value")
	.dwattr $C$DW$1233, DW_AT_TI_symbol_name("pwm_max_value")
	.dwattr $C$DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x0b)

$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1234, DW_AT_name("at_speed_tolerance")
	.dwattr $C$DW$1234, DW_AT_TI_symbol_name("at_speed_tolerance")
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x0b)

$C$DW$1235	.dwtag  DW_TAG_member
	.dwattr $C$DW$1235, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1235, DW_AT_name("pwm_piece")
	.dwattr $C$DW$1235, DW_AT_TI_symbol_name("pwm_piece")
	.dwattr $C$DW$1235, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1235, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x11)

$C$DW$1236	.dwtag  DW_TAG_member
	.dwattr $C$DW$1236, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$1236, DW_AT_name("pid")
	.dwattr $C$DW$1236, DW_AT_TI_symbol_name("pid")
	.dwattr $C$DW$1236, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1236, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x12)

$C$DW$1237	.dwtag  DW_TAG_member
	.dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1237, DW_AT_name("ppr")
	.dwattr $C$DW$1237, DW_AT_TI_symbol_name("ppr")
	.dwattr $C$DW$1237, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1237, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x0e)

$C$DW$1238	.dwtag  DW_TAG_member
	.dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$1238, DW_AT_name("invert")
	.dwattr $C$DW$1238, DW_AT_TI_symbol_name("invert")
	.dwattr $C$DW$1238, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$1238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1238, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x15)

$C$DW$1239	.dwtag  DW_TAG_member
	.dwattr $C$DW$1239, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$1239, DW_AT_name("flags")
	.dwattr $C$DW$1239, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1239, DW_AT_data_member_location[DW_OP_plus_uconst 0x73]
	.dwattr $C$DW$1239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1239, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$96, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$96, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$96, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$96

$C$DW$T$127	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$127, DW_AT_name("spindle_settings_t")
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$127, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x03)


$C$DW$T$97	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$97, DW_AT_byte_size(0x10)
$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1240, DW_AT_name("step_invert")
	.dwattr $C$DW$1240, DW_AT_TI_symbol_name("step_invert")
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x14)

$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1241, DW_AT_name("dir_invert")
	.dwattr $C$DW$1241, DW_AT_TI_symbol_name("dir_invert")
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x14)

$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1242, DW_AT_name("ganged_dir_invert")
	.dwattr $C$DW$1242, DW_AT_TI_symbol_name("ganged_dir_invert")
	.dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x14)

$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1243, DW_AT_name("enable_invert")
	.dwattr $C$DW$1243, DW_AT_TI_symbol_name("enable_invert")
	.dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x14)

$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1244, DW_AT_name("deenergize")
	.dwattr $C$DW$1244, DW_AT_TI_symbol_name("deenergize")
	.dwattr $C$DW$1244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x14)

$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1245, DW_AT_name("pulse_microseconds")
	.dwattr $C$DW$1245, DW_AT_TI_symbol_name("pulse_microseconds")
	.dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x0b)

$C$DW$1246	.dwtag  DW_TAG_member
	.dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1246, DW_AT_name("pulse_delay_microseconds")
	.dwattr $C$DW$1246, DW_AT_TI_symbol_name("pulse_delay_microseconds")
	.dwattr $C$DW$1246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1246, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x0b)

$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1247, DW_AT_name("idle_lock_time")
	.dwattr $C$DW$1247, DW_AT_TI_symbol_name("idle_lock_time")
	.dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$97, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$97, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$T$97, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$97

$C$DW$T$128	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$128, DW_AT_name("stepper_settings_t")
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$128, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x03)


$C$DW$T$98	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x02)
$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1248, DW_AT_name("machine_position")
	.dwattr $C$DW$1248, DW_AT_TI_symbol_name("machine_position")
	.dwattr $C$DW$1248, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1248, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0x164)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x12)

$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1249, DW_AT_name("buffer_state")
	.dwattr $C$DW$1249, DW_AT_TI_symbol_name("buffer_state")
	.dwattr $C$DW$1249, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1249, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x165)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x12)

$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1250, DW_AT_name("line_numbers")
	.dwattr $C$DW$1250, DW_AT_TI_symbol_name("line_numbers")
	.dwattr $C$DW$1250, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1250, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x12)

$C$DW$1251	.dwtag  DW_TAG_member
	.dwattr $C$DW$1251, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1251, DW_AT_name("feed_speed")
	.dwattr $C$DW$1251, DW_AT_TI_symbol_name("feed_speed")
	.dwattr $C$DW$1251, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1251, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1251, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1251, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x12)

$C$DW$1252	.dwtag  DW_TAG_member
	.dwattr $C$DW$1252, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1252, DW_AT_name("pin_state")
	.dwattr $C$DW$1252, DW_AT_TI_symbol_name("pin_state")
	.dwattr $C$DW$1252, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1252, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1252, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1252, DW_AT_decl_line(0x168)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x12)

$C$DW$1253	.dwtag  DW_TAG_member
	.dwattr $C$DW$1253, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1253, DW_AT_name("work_coord_offset")
	.dwattr $C$DW$1253, DW_AT_TI_symbol_name("work_coord_offset")
	.dwattr $C$DW$1253, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1253, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1253, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1253, DW_AT_decl_line(0x169)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x12)

$C$DW$1254	.dwtag  DW_TAG_member
	.dwattr $C$DW$1254, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1254, DW_AT_name("overrides")
	.dwattr $C$DW$1254, DW_AT_TI_symbol_name("overrides")
	.dwattr $C$DW$1254, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1254, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1254, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x12)

$C$DW$1255	.dwtag  DW_TAG_member
	.dwattr $C$DW$1255, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1255, DW_AT_name("probe_coordinates")
	.dwattr $C$DW$1255, DW_AT_TI_symbol_name("probe_coordinates")
	.dwattr $C$DW$1255, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1255, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1255, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x12)

$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1256, DW_AT_name("sync_on_wco_change")
	.dwattr $C$DW$1256, DW_AT_TI_symbol_name("sync_on_wco_change")
	.dwattr $C$DW$1256, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1256, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x12)

$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1257, DW_AT_name("parser_state")
	.dwattr $C$DW$1257, DW_AT_TI_symbol_name("parser_state")
	.dwattr $C$DW$1257, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1257, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x12)

$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1258, DW_AT_name("alarm_substate")
	.dwattr $C$DW$1258, DW_AT_TI_symbol_name("alarm_substate")
	.dwattr $C$DW$1258, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1258, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x12)

$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1259, DW_AT_name("run_substate")
	.dwattr $C$DW$1259, DW_AT_TI_symbol_name("run_substate")
	.dwattr $C$DW$1259, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1259, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x12)

$C$DW$1260	.dwtag  DW_TAG_member
	.dwattr $C$DW$1260, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1260, DW_AT_name("unassigned")
	.dwattr $C$DW$1260, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1260, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1260, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1260, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0x170)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$98, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$98, DW_AT_decl_line(0x163)
	.dwattr $C$DW$T$98, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$98


$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x02)
$C$DW$1261	.dwtag  DW_TAG_member
	.dwattr $C$DW$1261, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1261, DW_AT_name("report_inches")
	.dwattr $C$DW$1261, DW_AT_TI_symbol_name("report_inches")
	.dwattr $C$DW$1261, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1261, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1261, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x12)

$C$DW$1262	.dwtag  DW_TAG_member
	.dwattr $C$DW$1262, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1262, DW_AT_name("restore_overrides")
	.dwattr $C$DW$1262, DW_AT_TI_symbol_name("restore_overrides")
	.dwattr $C$DW$1262, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1262, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1262, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0x147)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x12)

$C$DW$1263	.dwtag  DW_TAG_member
	.dwattr $C$DW$1263, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1263, DW_AT_name("unused0")
	.dwattr $C$DW$1263, DW_AT_TI_symbol_name("unused0")
	.dwattr $C$DW$1263, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1263, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1263, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x12)

$C$DW$1264	.dwtag  DW_TAG_member
	.dwattr $C$DW$1264, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1264, DW_AT_name("sleep_enable")
	.dwattr $C$DW$1264, DW_AT_TI_symbol_name("sleep_enable")
	.dwattr $C$DW$1264, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1264, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1264, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x12)

$C$DW$1265	.dwtag  DW_TAG_member
	.dwattr $C$DW$1265, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1265, DW_AT_name("disable_laser_during_hold")
	.dwattr $C$DW$1265, DW_AT_TI_symbol_name("disable_laser_during_hold")
	.dwattr $C$DW$1265, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1265, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1265, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x12)

$C$DW$1266	.dwtag  DW_TAG_member
	.dwattr $C$DW$1266, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1266, DW_AT_name("force_initialization_alarm")
	.dwattr $C$DW$1266, DW_AT_TI_symbol_name("force_initialization_alarm")
	.dwattr $C$DW$1266, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1266, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1266, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x12)

$C$DW$1267	.dwtag  DW_TAG_member
	.dwattr $C$DW$1267, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1267, DW_AT_name("legacy_rt_commands")
	.dwattr $C$DW$1267, DW_AT_TI_symbol_name("legacy_rt_commands")
	.dwattr $C$DW$1267, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1267, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1267, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x12)

$C$DW$1268	.dwtag  DW_TAG_member
	.dwattr $C$DW$1268, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1268, DW_AT_name("restore_after_feed_hold")
	.dwattr $C$DW$1268, DW_AT_TI_symbol_name("restore_after_feed_hold")
	.dwattr $C$DW$1268, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1268, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1268, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x12)

$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1269, DW_AT_name("unused1")
	.dwattr $C$DW$1269, DW_AT_TI_symbol_name("unused1")
	.dwattr $C$DW$1269, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1269, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x12)

$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1270, DW_AT_name("g92_is_volatile")
	.dwattr $C$DW$1270, DW_AT_TI_symbol_name("g92_is_volatile")
	.dwattr $C$DW$1270, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1270, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x12)

$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1271, DW_AT_name("unassigned")
	.dwattr $C$DW$1271, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1271, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1271, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$99, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x145)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$99


$C$DW$T$100	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1272, DW_AT_name("invert_probe_pin")
	.dwattr $C$DW$1272, DW_AT_TI_symbol_name("invert_probe_pin")
	.dwattr $C$DW$1272, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1272, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0x157)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x11)

$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1273, DW_AT_name("disable_probe_pullup")
	.dwattr $C$DW$1273, DW_AT_TI_symbol_name("disable_probe_pullup")
	.dwattr $C$DW$1273, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1273, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x11)

$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1274, DW_AT_name("invert_connected_pin")
	.dwattr $C$DW$1274, DW_AT_TI_symbol_name("invert_connected_pin")
	.dwattr $C$DW$1274, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1274, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x11)

$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1275, DW_AT_name("disable_connected_pullup")
	.dwattr $C$DW$1275, DW_AT_TI_symbol_name("disable_connected_pullup")
	.dwattr $C$DW$1275, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1275, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x11)

$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1276, DW_AT_name("allow_feed_override")
	.dwattr $C$DW$1276, DW_AT_TI_symbol_name("allow_feed_override")
	.dwattr $C$DW$1276, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1276, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1276, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x11)

$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1277, DW_AT_name("enable_protection")
	.dwattr $C$DW$1277, DW_AT_TI_symbol_name("enable_protection")
	.dwattr $C$DW$1277, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1277, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1277, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x11)

$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1278, DW_AT_name("unassigned")
	.dwattr $C$DW$1278, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1278, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1278, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$100, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$100


$C$DW$T$101	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x01)
$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1279, DW_AT_name("enabled")
	.dwattr $C$DW$1279, DW_AT_TI_symbol_name("enabled")
	.dwattr $C$DW$1279, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1279, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x11)

$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1280, DW_AT_name("single_axis_commands")
	.dwattr $C$DW$1280, DW_AT_TI_symbol_name("single_axis_commands")
	.dwattr $C$DW$1280, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1280, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x11)

$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1281, DW_AT_name("init_lock")
	.dwattr $C$DW$1281, DW_AT_TI_symbol_name("init_lock")
	.dwattr $C$DW$1281, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1281, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x11)

$C$DW$1282	.dwtag  DW_TAG_member
