;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed May 31 19:52:19 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../grbl/errors.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
	.sect	".const:status_detail"
	.align	2
	.elfsym	status_detail,SYM_SIZE(330)
status_detail:
	.bits		0,16
			; status_detail[0].id @ 0
	.bits		0,32
			; status_detail[0].description @ 16
	.bits		0x1,16
			; status_detail[1].id @ 48
	.bits	$C$FSL1,32		; status_detail[1].description @ 64
	.bits		0x2,16
			; status_detail[2].id @ 96
	.bits	$C$FSL2,32		; status_detail[2].description @ 112
	.bits		0x3,16
			; status_detail[3].id @ 144
	.bits	$C$FSL3,32		; status_detail[3].description @ 160
	.bits		0x4,16
			; status_detail[4].id @ 192

	.dwattr $C$DW$630, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$630, DW_AT_decl_column(0x05)

$C$DW$631	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$631, DW_AT_name("NGCParam_v")
	.dwattr $C$DW$631, DW_AT_const_value(0x27)
	.dwattr $C$DW$631, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$631, DW_AT_decl_column(0x05)

$C$DW$632	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$632, DW_AT_name("NGCParam_w")
	.dwattr $C$DW$632, DW_AT_const_value(0x28)
	.dwattr $C$DW$632, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$632, DW_AT_decl_column(0x05)

$C$DW$633	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$633, DW_AT_name("NGCParam_current_tool")
	.dwattr $C$DW$633, DW_AT_const_value(0x29)
	.dwattr $C$DW$633, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x50)
	.dwattr $C$DW$633, DW_AT_decl_column(0x05)

$C$DW$634	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$634, DW_AT_name("NGCParam_current_pocket")
	.dwattr $C$DW$634, DW_AT_const_value(0x2a)
	.dwattr $C$DW$634, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x51)
	.dwattr $C$DW$634, DW_AT_decl_column(0x05)

$C$DW$635	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$635, DW_AT_name("NGCParam_selected_tool")
	.dwattr $C$DW$635, DW_AT_const_value(0x2b)
	.dwattr $C$DW$635, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x52)
	.dwattr $C$DW$635, DW_AT_decl_column(0x05)

$C$DW$636	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$636, DW_AT_name("NGCParam_selected_pocket")
	.dwattr $C$DW$636, DW_AT_const_value(0x2c)
	.dwattr $C$DW$636, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x53)
	.dwattr $C$DW$636, DW_AT_decl_column(0x05)

$C$DW$637	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$637, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$637, DW_AT_const_value(0x2d)
	.dwattr $C$DW$637, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x54)
	.dwattr $C$DW$637, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$514, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$514, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$514, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$514

$C$DW$T$515	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$515, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$515, DW_AT_type(*$C$DW$T$514)
	.dwattr $C$DW$T$515, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$515, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$515, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$515, DW_AT_decl_column(0x03)


$C$DW$T$516	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$516, DW_AT_byte_size(0x02)
$C$DW$638	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$638, DW_AT_name("Message_Plain")
	.dwattr $C$DW$638, DW_AT_const_value(0x00)
	.dwattr $C$DW$638, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$638, DW_AT_decl_column(0x05)

$C$DW$639	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$639, DW_AT_name("Message_Info")
	.dwattr $C$DW$639, DW_AT_const_value(0x01)
	.dwattr $C$DW$639, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x20)
	.dwattr $C$DW$639, DW_AT_decl_column(0x05)

$C$DW$640	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$640, DW_AT_name("Message_Warning")
	.dwattr $C$DW$640, DW_AT_const_value(0x02)
	.dwattr $C$DW$640, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x21)
	.dwattr $C$DW$640, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$516, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$516, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$516, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$516

$C$DW$T$517	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$517, DW_AT_name("message_type_t")
	.dwattr $C$DW$T$517, DW_AT_type(*$C$DW$T$516)
	.dwattr $C$DW$T$517, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$517, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$517, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$517, DW_AT_decl_column(0x03)


$C$DW$T$518	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$518, DW_AT_byte_size(0x02)
$C$DW$641	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$641, DW_AT_name("SettingsFormat_MachineReadable")
	.dwattr $C$DW$641, DW_AT_const_value(0x00)
	.dwattr $C$DW$641, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x25)
	.dwattr $C$DW$641, DW_AT_decl_column(0x05)

$C$DW$642	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$642, DW_AT_name("SettingsFormat_HumanReadable")
	.dwattr $C$DW$642, DW_AT_const_value(0x01)
	.dwattr $C$DW$642, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x26)
	.dwattr $C$DW$642, DW_AT_decl_column(0x05)

$C$DW$643	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$643, DW_AT_name("SettingsFormat_Grbl")
	.dwattr $C$DW$643, DW_AT_const_value(0x02)
	.dwattr $C$DW$643, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x27)
	.dwattr $C$DW$643, DW_AT_decl_column(0x05)

$C$DW$644	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$644, DW_AT_name("SettingsFormat_grblHAL")
	.dwattr $C$DW$644, DW_AT_const_value(0x03)
	.dwattr $C$DW$644, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x28)
	.dwattr $C$DW$644, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$518, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$518, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$518, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$518

$C$DW$T$519	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$519, DW_AT_name("settings_format_t")
	.dwattr $C$DW$T$519, DW_AT_type(*$C$DW$T$518)
	.dwattr $C$DW$T$519, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$519, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$519, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$519, DW_AT_decl_column(0x03)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$645, DW_AT_name("id")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$645, DW_AT_decl_column(0x13)

$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$646, DW_AT_name("description")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("description")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$646, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$26, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$26

$C$DW$T$428	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$428, DW_AT_name("status_detail_t")
	.dwattr $C$DW$T$428, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$428, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$428, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$T$428, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$428, DW_AT_decl_column(0x03)

$C$DW$647	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$428)

$C$DW$T$429	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$429, DW_AT_type(*$C$DW$647)

$C$DW$T$430	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$429)
	.dwattr $C$DW$T$430, DW_AT_address_class(0x14)


$C$DW$T$520	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$520, DW_AT_type(*$C$DW$T$429)
	.dwattr $C$DW$T$520, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$520, DW_AT_byte_size(0x14a)
$C$DW$648	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$648, DW_AT_upper_bound(0x36)

	.dwendtag $C$DW$T$520


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$649, DW_AT_name("__max_align1")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$649, DW_AT_decl_column(0x0c)

$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$650, DW_AT_name("__max_align2")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$650, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$27

$C$DW$T$521	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$521, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$521, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$521, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$521, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$521, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$521, DW_AT_decl_column(0x03)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$651, DW_AT_name("x")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$651, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$651, DW_AT_bit_size(0x01)
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$651, DW_AT_decl_column(0x11)

$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$652, DW_AT_name("y")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$652, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$652, DW_AT_bit_size(0x01)
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$652, DW_AT_decl_column(0x11)

$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$653, DW_AT_name("z")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$653, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$653, DW_AT_bit_size(0x01)
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$653, DW_AT_decl_column(0x11)

$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$654, DW_AT_name("a")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$654, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$654, DW_AT_bit_size(0x01)
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$654, DW_AT_decl_column(0x11)

$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$655, DW_AT_name("b")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$655, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$655, DW_AT_bit_size(0x01)
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$655, DW_AT_decl_column(0x11)

$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$656, DW_AT_name("c")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$656, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$656, DW_AT_bit_size(0x01)
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x80)
	.dwattr $C$DW$656, DW_AT_decl_column(0x11)

$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$657, DW_AT_name("u")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$657, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$657, DW_AT_bit_size(0x01)
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x81)
	.dwattr $C$DW$657, DW_AT_decl_column(0x11)

$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$658, DW_AT_name("v")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$658, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$658, DW_AT_bit_size(0x01)
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x82)
	.dwattr $C$DW$658, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$30


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$659, DW_AT_name("min")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("min")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$659, DW_AT_decl_column(0x14)

$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$660, DW_AT_name("max")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("max")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$660, DW_AT_decl_column(0x14)

$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$661, DW_AT_name("min2")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("min2")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$661, DW_AT_decl_column(0x14)

$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$662, DW_AT_name("max2")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("max2")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$662, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$32

$C$DW$T$124	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$124, DW_AT_name("limit_signals_t")
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$124, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$124, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$124, DW_AT_decl_column(0x03)


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$663, DW_AT_name("flood")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$663, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$663, DW_AT_bit_size(0x01)
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$663, DW_AT_decl_column(0x11)

$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$664, DW_AT_name("mist")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$664, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$664, DW_AT_bit_size(0x01)
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$664, DW_AT_decl_column(0x11)

$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$665, DW_AT_name("shower")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$665, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$665, DW_AT_bit_size(0x01)
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$665, DW_AT_decl_column(0x11)

$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$666, DW_AT_name("trough_spindle")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$666, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$666, DW_AT_bit_size(0x01)
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x20)
	.dwattr $C$DW$666, DW_AT_decl_column(0x11)

$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$667, DW_AT_name("unused")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$667, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$667, DW_AT_bit_size(0x04)
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x21)
	.dwattr $C$DW$667, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$33, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$33


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$668, DW_AT_name("on")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$668, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$668, DW_AT_bit_size(0x01)
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$668, DW_AT_decl_column(0x11)

$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$669, DW_AT_name("ccw")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$669, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$669, DW_AT_bit_size(0x01)
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x20)
	.dwattr $C$DW$669, DW_AT_decl_column(0x11)

$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$670, DW_AT_name("pwm")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$670, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$670, DW_AT_bit_size(0x01)
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x21)
	.dwattr $C$DW$670, DW_AT_decl_column(0x11)

$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$671, DW_AT_name("reserved3")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$671, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$671, DW_AT_bit_size(0x01)
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x22)
	.dwattr $C$DW$671, DW_AT_decl_column(0x11)

$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$672, DW_AT_name("reserved4")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$672, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$672, DW_AT_bit_size(0x01)
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x23)
	.dwattr $C$DW$672, DW_AT_decl_column(0x11)

$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$673, DW_AT_name("encoder_error")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$673, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$673, DW_AT_bit_size(0x01)
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x24)
	.dwattr $C$DW$673, DW_AT_decl_column(0x11)

$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$674, DW_AT_name("at_speed")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$674, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$674, DW_AT_bit_size(0x01)
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x25)
	.dwattr $C$DW$674, DW_AT_decl_column(0x11)

$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$675, DW_AT_name("synchronized")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$675, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$675, DW_AT_bit_size(0x01)
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0x26)
	.dwattr $C$DW$675, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$34, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$34


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$676, DW_AT_name("rpm")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$676, DW_AT_decl_column(0x0b)

$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$677, DW_AT_name("start")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("start")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$677, DW_AT_decl_column(0x0b)

$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$678, DW_AT_name("end")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("end")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$678, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$35, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$35

$C$DW$T$43	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$43, DW_AT_name("pwm_piece_t")
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$43, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x03)


$C$DW$T$44	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x30)
$C$DW$679	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$679, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$44


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x42)
$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$680, DW_AT_name("period")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("period")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$680, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$680, DW_AT_decl_line(0x32)
	.dwattr $C$DW$680, DW_AT_decl_column(0x13)

$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$681, DW_AT_name("off_value")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("off_value")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$681, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$681, DW_AT_decl_line(0x33)
	.dwattr $C$DW$681, DW_AT_decl_column(0x13)

$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$682, DW_AT_name("min_value")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("min_value")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$682, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$682, DW_AT_decl_line(0x34)
	.dwattr $C$DW$682, DW_AT_decl_column(0x13)

$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$683, DW_AT_name("max_value")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("max_value")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$683, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$683, DW_AT_decl_line(0x35)
	.dwattr $C$DW$683, DW_AT_decl_column(0x13)

$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$684, DW_AT_name("pwm_gradient")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("pwm_gradient")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$684, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$684, DW_AT_decl_line(0x36)
	.dwattr $C$DW$684, DW_AT_decl_column(0x0b)

$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$685, DW_AT_name("invert_pwm")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("invert_pwm")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$685, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$685, DW_AT_decl_line(0x37)
	.dwattr $C$DW$685, DW_AT_decl_column(0x0a)

$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$686, DW_AT_name("always_on")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("always_on")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$686, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$686, DW_AT_decl_line(0x38)
	.dwattr $C$DW$686, DW_AT_decl_column(0x0a)

$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$687, DW_AT_name("offset")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$687, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$687, DW_AT_decl_line(0x39)
	.dwattr $C$DW$687, DW_AT_decl_column(0x12)

$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$688, DW_AT_name("n_pieces")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("n_pieces")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$688, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$688, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$688, DW_AT_decl_column(0x13)

$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$689, DW_AT_name("piece")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("piece")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$689, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$689, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$689, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$45, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$45

$C$DW$T$522	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$522, DW_AT_name("spindle_pwm_t")
	.dwattr $C$DW$T$522, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$522, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$522, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$522, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$522, DW_AT_decl_column(0x03)


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$690, DW_AT_name("rpm")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$690, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$690, DW_AT_decl_line(0x40)
	.dwattr $C$DW$690, DW_AT_decl_column(0x0b)

$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$691, DW_AT_name("rpm_low_limit")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("rpm_low_limit")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$691, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$691, DW_AT_decl_line(0x41)
	.dwattr $C$DW$691, DW_AT_decl_column(0x0b)

$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$692, DW_AT_name("rpm_high_limit")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("rpm_high_limit")
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$692, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$692, DW_AT_decl_line(0x42)
	.dwattr $C$DW$692, DW_AT_decl_column(0x0b)

$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$693, DW_AT_name("angular_position")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("angular_position")
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$693, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$693, DW_AT_decl_line(0x43)
	.dwattr $C$DW$693, DW_AT_decl_column(0x0b)

$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$694, DW_AT_name("rpm_programmed")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("rpm_programmed")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$694, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$694, DW_AT_decl_line(0x44)
	.dwattr $C$DW$694, DW_AT_decl_column(0x0b)

$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$695, DW_AT_name("index_count")
	.dwattr $C$DW$695, DW_AT_TI_symbol_name("index_count")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$695, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$695, DW_AT_decl_line(0x45)
	.dwattr $C$DW$695, DW_AT_decl_column(0x0e)

$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$696, DW_AT_name("pulse_count")
	.dwattr $C$DW$696, DW_AT_TI_symbol_name("pulse_count")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$696, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$696, DW_AT_decl_line(0x46)
	.dwattr $C$DW$696, DW_AT_decl_column(0x0e)

$C$DW$697	.dwtag  DW_TAG_member
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$697, DW_AT_name("error_count")
	.dwattr $C$DW$697, DW_AT_TI_symbol_name("error_count")
	.dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$697, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$697, DW_AT_decl_line(0x47)
	.dwattr $C$DW$697, DW_AT_decl_column(0x0e)

$C$DW$698	.dwtag  DW_TAG_member
	.dwattr $C$DW$698, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$698, DW_AT_name("state_programmed")
	.dwattr $C$DW$698, DW_AT_TI_symbol_name("state_programmed")
	.dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$698, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$698, DW_AT_decl_line(0x48)
	.dwattr $C$DW$698, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$49, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$49

$C$DW$T$523	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$523, DW_AT_name("spindle_data_t")
	.dwattr $C$DW$T$523, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$523, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$523, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$523, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$523, DW_AT_decl_column(0x03)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
$C$DW$699	.dwtag  DW_TAG_member
	.dwattr $C$DW$699, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$699, DW_AT_name("jog_motion")
	.dwattr $C$DW$699, DW_AT_TI_symbol_name("jog_motion")
	.dwattr $C$DW$699, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$699, DW_AT_bit_size(0x01)
	.dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$699, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$699, DW_AT_decl_line(0x113)
	.dwattr $C$DW$699, DW_AT_decl_column(0x12)

$C$DW$700	.dwtag  DW_TAG_member
	.dwattr $C$DW$700, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$700, DW_AT_name("canned_cycle_change")
	.dwattr $C$DW$700, DW_AT_TI_symbol_name("canned_cycle_change")
	.dwattr $C$DW$700, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$700, DW_AT_bit_size(0x01)
	.dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$700, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$700, DW_AT_decl_line(0x114)
	.dwattr $C$DW$700, DW_AT_decl_column(0x12)

$C$DW$701	.dwtag  DW_TAG_member
	.dwattr $C$DW$701, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$701, DW_AT_name("arc_is_clockwise")
	.dwattr $C$DW$701, DW_AT_TI_symbol_name("arc_is_clockwise")
	.dwattr $C$DW$701, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$701, DW_AT_bit_size(0x01)
	.dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$701, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$701, DW_AT_decl_line(0x115)
	.dwattr $C$DW$701, DW_AT_decl_column(0x12)

$C$DW$702	.dwtag  DW_TAG_member
	.dwattr $C$DW$702, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$702, DW_AT_name("probe_is_away")
	.dwattr $C$DW$702, DW_AT_TI_symbol_name("probe_is_away")
	.dwattr $C$DW$702, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$702, DW_AT_bit_size(0x01)
	.dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$702, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$702, DW_AT_decl_line(0x116)
	.dwattr $C$DW$702, DW_AT_decl_column(0x12)

$C$DW$703	.dwtag  DW_TAG_member
	.dwattr $C$DW$703, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$703, DW_AT_name("probe_is_no_error")
	.dwattr $C$DW$703, DW_AT_TI_symbol_name("probe_is_no_error")
	.dwattr $C$DW$703, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$703, DW_AT_bit_size(0x01)
	.dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$703, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$703, DW_AT_decl_line(0x117)
	.dwattr $C$DW$703, DW_AT_decl_column(0x12)

$C$DW$704	.dwtag  DW_TAG_member
	.dwattr $C$DW$704, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$704, DW_AT_name("spindle_force_sync")
	.dwattr $C$DW$704, DW_AT_TI_symbol_name("spindle_force_sync")
	.dwattr $C$DW$704, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$704, DW_AT_bit_size(0x01)
	.dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$704, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$704, DW_AT_decl_line(0x118)
	.dwattr $C$DW$704, DW_AT_decl_column(0x12)

$C$DW$705	.dwtag  DW_TAG_member
	.dwattr $C$DW$705, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$705, DW_AT_name("laser_disable")
	.dwattr $C$DW$705, DW_AT_TI_symbol_name("laser_disable")
	.dwattr $C$DW$705, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$705, DW_AT_bit_size(0x01)
	.dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$705, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$705, DW_AT_decl_line(0x119)
	.dwattr $C$DW$705, DW_AT_decl_column(0x12)

$C$DW$706	.dwtag  DW_TAG_member
	.dwattr $C$DW$706, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$706, DW_AT_name("laser_is_motion")
	.dwattr $C$DW$706, DW_AT_TI_symbol_name("laser_is_motion")
	.dwattr $C$DW$706, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$706, DW_AT_bit_size(0x01)
	.dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$706, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$706, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$706, DW_AT_decl_column(0x12)

$C$DW$707	.dwtag  DW_TAG_member
	.dwattr $C$DW$707, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$707, DW_AT_name("set_coolant")
	.dwattr $C$DW$707, DW_AT_TI_symbol_name("set_coolant")
	.dwattr $C$DW$707, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$707, DW_AT_bit_size(0x01)
	.dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$707, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$707, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$707, DW_AT_decl_column(0x12)

$C$DW$708	.dwtag  DW_TAG_member
	.dwattr $C$DW$708, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$708, DW_AT_name("motion_mode_changed")
	.dwattr $C$DW$708, DW_AT_TI_symbol_name("motion_mode_changed")
	.dwattr $C$DW$708, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$708, DW_AT_bit_size(0x01)
	.dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$708, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$708, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$708, DW_AT_decl_column(0x12)

$C$DW$709	.dwtag  DW_TAG_member
	.dwattr $C$DW$709, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$709, DW_AT_name("reserved")
	.dwattr $C$DW$709, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$709, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$709, DW_AT_bit_size(0x06)
	.dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$709, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$709, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$709, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$51


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$710	.dwtag  DW_TAG_member
	.dwattr $C$DW$710, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$710, DW_AT_name("feed_rate_disable")
	.dwattr $C$DW$710, DW_AT_TI_symbol_name("feed_rate_disable")
	.dwattr $C$DW$710, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$710, DW_AT_bit_size(0x01)
	.dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$710, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$710, DW_AT_decl_line(0x125)
	.dwattr $C$DW$710, DW_AT_decl_column(0x11)

$C$DW$711	.dwtag  DW_TAG_member
	.dwattr $C$DW$711, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$711, DW_AT_name("feed_hold_disable")
	.dwattr $C$DW$711, DW_AT_TI_symbol_name("feed_hold_disable")
	.dwattr $C$DW$711, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$711, DW_AT_bit_size(0x01)
	.dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$711, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$711, DW_AT_decl_line(0x126)
	.dwattr $C$DW$711, DW_AT_decl_column(0x11)

$C$DW$712	.dwtag  DW_TAG_member
	.dwattr $C$DW$712, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$712, DW_AT_name("spindle_rpm_disable")
	.dwattr $C$DW$712, DW_AT_TI_symbol_name("spindle_rpm_disable")
	.dwattr $C$DW$712, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$712, DW_AT_bit_size(0x01)
	.dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$712, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$712, DW_AT_decl_line(0x127)
	.dwattr $C$DW$712, DW_AT_decl_column(0x11)

$C$DW$713	.dwtag  DW_TAG_member
	.dwattr $C$DW$713, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$713, DW_AT_name("parking_disable")
	.dwattr $C$DW$713, DW_AT_TI_symbol_name("parking_disable")
	.dwattr $C$DW$713, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$713, DW_AT_bit_size(0x01)
	.dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$713, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$713, DW_AT_decl_line(0x128)
	.dwattr $C$DW$713, DW_AT_decl_column(0x11)

$C$DW$714	.dwtag  DW_TAG_member
	.dwattr $C$DW$714, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$714, DW_AT_name("reserved")
	.dwattr $C$DW$714, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$714, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$714, DW_AT_bit_size(0x03)
	.dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$714, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$714, DW_AT_decl_line(0x129)
	.dwattr $C$DW$714, DW_AT_decl_column(0x11)

$C$DW$715	.dwtag  DW_TAG_member
	.dwattr $C$DW$715, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$715, DW_AT_name("sync")
	.dwattr $C$DW$715, DW_AT_TI_symbol_name("sync")
	.dwattr $C$DW$715, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$715, DW_AT_bit_size(0x01)
	.dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$715, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$715, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$715, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$52


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$716, DW_AT_name("x")
	.dwattr $C$DW$716, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$716, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$716, DW_AT_decl_line(0x132)
	.dwattr $C$DW$716, DW_AT_decl_column(0x0f)

$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$717, DW_AT_name("y")
	.dwattr $C$DW$717, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$717, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$717, DW_AT_decl_line(0x133)
	.dwattr $C$DW$717, DW_AT_decl_column(0x0f)

$C$DW$718	.dwtag  DW_TAG_member
	.dwattr $C$DW$718, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$718, DW_AT_name("z")
	.dwattr $C$DW$718, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$718, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$718, DW_AT_decl_line(0x134)
	.dwattr $C$DW$718, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x131)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$53


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x0e)
$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$719, DW_AT_name("xyz")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$719, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$719, DW_AT_decl_line(0x149)
	.dwattr $C$DW$719, DW_AT_decl_column(0x0b)

$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$720, DW_AT_name("id")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$720, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$720, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$720, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$57, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$57

$C$DW$T$59	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$59, DW_AT_name("coord_system_t")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$59, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x03)


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x03)
$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$721, DW_AT_name("axis_0")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("axis_0")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$721, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$721, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$721, DW_AT_decl_column(0x0d)

$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$722, DW_AT_name("axis_1")
	.dwattr $C$DW$722, DW_AT_TI_symbol_name("axis_1")
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$722, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$722, DW_AT_decl_line(0x150)
	.dwattr $C$DW$722, DW_AT_decl_column(0x0d)

$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$723, DW_AT_name("axis_linear")
	.dwattr $C$DW$723, DW_AT_TI_symbol_name("axis_linear")
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$723, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$723, DW_AT_decl_line(0x151)
	.dwattr $C$DW$723, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$58

$C$DW$T$524	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$524, DW_AT_name("plane_t")
	.dwattr $C$DW$T$524, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$524, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$524, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$524, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$524, DW_AT_decl_column(0x03)


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x54)
$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$724, DW_AT_name("d")
	.dwattr $C$DW$724, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$724, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$724, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$724, DW_AT_decl_column(0x0b)

$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$725, DW_AT_name("e")
	.dwattr $C$DW$725, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$725, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$725, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$725, DW_AT_decl_column(0x0b)

$C$DW$726	.dwtag  DW_TAG_member
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$726, DW_AT_name("f")
	.dwattr $C$DW$726, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$726, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$726, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$726, DW_AT_decl_column(0x0b)

$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$727, DW_AT_name("ijk")
	.dwattr $C$DW$727, DW_AT_TI_symbol_name("ijk")
	.dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$727, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$727, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$727, DW_AT_decl_column(0x0b)

$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$728, DW_AT_name("k")
	.dwattr $C$DW$728, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$728, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$728, DW_AT_decl_line(0x160)
	.dwattr $C$DW$728, DW_AT_decl_column(0x0b)

$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$729, DW_AT_name("p")
	.dwattr $C$DW$729, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$729, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$729, DW_AT_decl_line(0x161)
	.dwattr $C$DW$729, DW_AT_decl_column(0x0b)

$C$DW$730	.dwtag  DW_TAG_member
	.dwattr $C$DW$730, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$730, DW_AT_name("q")
	.dwattr $C$DW$730, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$730, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$730, DW_AT_decl_line(0x162)
	.dwattr $C$DW$730, DW_AT_decl_column(0x0b)

$C$DW$731	.dwtag  DW_TAG_member
	.dwattr $C$DW$731, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$731, DW_AT_name("r")
	.dwattr $C$DW$731, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$731, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$731, DW_AT_decl_line(0x163)
	.dwattr $C$DW$731, DW_AT_decl_column(0x0b)

$C$DW$732	.dwtag  DW_TAG_member
	.dwattr $C$DW$732, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$732, DW_AT_name("s")
	.dwattr $C$DW$732, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$732, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$732, DW_AT_decl_line(0x164)
	.dwattr $C$DW$732, DW_AT_decl_column(0x0b)

$C$DW$733	.dwtag  DW_TAG_member
	.dwattr $C$DW$733, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$733, DW_AT_name("xyz")
	.dwattr $C$DW$733, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$733, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$733, DW_AT_decl_line(0x165)
	.dwattr $C$DW$733, DW_AT_decl_column(0x0b)

$C$DW$734	.dwtag  DW_TAG_member
	.dwattr $C$DW$734, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$734, DW_AT_name("coord_data")
	.dwattr $C$DW$734, DW_AT_TI_symbol_name("coord_data")
	.dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$734, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$734, DW_AT_decl_line(0x166)
	.dwattr $C$DW$734, DW_AT_decl_column(0x14)

$C$DW$735	.dwtag  DW_TAG_member
	.dwattr $C$DW$735, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$735, DW_AT_name("n")
	.dwattr $C$DW$735, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$735, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$735, DW_AT_decl_line(0x167)
	.dwattr $C$DW$735, DW_AT_decl_column(0x0d)

$C$DW$736	.dwtag  DW_TAG_member
	.dwattr $C$DW$736, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$736, DW_AT_name("h")
	.dwattr $C$DW$736, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$736, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$736, DW_AT_decl_line(0x168)
	.dwattr $C$DW$736, DW_AT_decl_column(0x0e)

$C$DW$737	.dwtag  DW_TAG_member
	.dwattr $C$DW$737, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$737, DW_AT_name("t")
	.dwattr $C$DW$737, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$737, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$737, DW_AT_decl_line(0x169)
	.dwattr $C$DW$737, DW_AT_decl_column(0x0e)

$C$DW$738	.dwtag  DW_TAG_member
	.dwattr $C$DW$738, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$738, DW_AT_name("l")
	.dwattr $C$DW$738, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$738, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$738, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$738, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$62

$C$DW$T$105	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$105, DW_AT_name("gc_values_t")
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$105, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$105, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$T$105, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
$C$DW$739	.dwtag  DW_TAG_member
	.dwattr $C$DW$739, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$739, DW_AT_name("e")
	.dwattr $C$DW$739, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$739, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$739, DW_AT_bit_size(0x01)
	.dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$739, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$739, DW_AT_decl_line(0x172)
	.dwattr $C$DW$739, DW_AT_decl_column(0x12)

$C$DW$740	.dwtag  DW_TAG_member
	.dwattr $C$DW$740, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$740, DW_AT_name("f")
	.dwattr $C$DW$740, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$740, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$740, DW_AT_bit_size(0x01)
	.dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$740, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$740, DW_AT_decl_line(0x173)
	.dwattr $C$DW$740, DW_AT_decl_column(0x12)

$C$DW$741	.dwtag  DW_TAG_member
	.dwattr $C$DW$741, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$741, DW_AT_name("h")
	.dwattr $C$DW$741, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$741, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$741, DW_AT_bit_size(0x01)
	.dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$741, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$741, DW_AT_decl_line(0x174)
	.dwattr $C$DW$741, DW_AT_decl_column(0x12)

$C$DW$742	.dwtag  DW_TAG_member
	.dwattr $C$DW$742, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$742, DW_AT_name("i")
	.dwattr $C$DW$742, DW_AT_TI_symbol_name("i")
	.dwattr $C$DW$742, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$742, DW_AT_bit_size(0x01)
	.dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$742, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$742, DW_AT_decl_line(0x175)
	.dwattr $C$DW$742, DW_AT_decl_column(0x12)

$C$DW$743	.dwtag  DW_TAG_member
	.dwattr $C$DW$743, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$743, DW_AT_name("j")
	.dwattr $C$DW$743, DW_AT_TI_symbol_name("j")
	.dwattr $C$DW$743, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$743, DW_AT_bit_size(0x01)
	.dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$743, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$743, DW_AT_decl_line(0x176)
	.dwattr $C$DW$743, DW_AT_decl_column(0x12)

$C$DW$744	.dwtag  DW_TAG_member
	.dwattr $C$DW$744, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$744, DW_AT_name("k")
	.dwattr $C$DW$744, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$744, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$744, DW_AT_bit_size(0x01)
	.dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$744, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$744, DW_AT_decl_line(0x177)
	.dwattr $C$DW$744, DW_AT_decl_column(0x12)

$C$DW$745	.dwtag  DW_TAG_member
	.dwattr $C$DW$745, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$745, DW_AT_name("l")
	.dwattr $C$DW$745, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$745, DW_AT_bit_offset(0x19)
	.dwattr $C$DW$745, DW_AT_bit_size(0x01)
	.dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$745, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$745, DW_AT_decl_line(0x178)
	.dwattr $C$DW$745, DW_AT_decl_column(0x12)

$C$DW$746	.dwtag  DW_TAG_member
	.dwattr $C$DW$746, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$746, DW_AT_name("n")
	.dwattr $C$DW$746, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$746, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$746, DW_AT_bit_size(0x01)
	.dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$746, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$746, DW_AT_decl_line(0x179)
	.dwattr $C$DW$746, DW_AT_decl_column(0x12)

$C$DW$747	.dwtag  DW_TAG_member
	.dwattr $C$DW$747, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$747, DW_AT_name("p")
	.dwattr $C$DW$747, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$747, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$747, DW_AT_bit_size(0x01)
	.dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$747, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$747, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$747, DW_AT_decl_column(0x12)

$C$DW$748	.dwtag  DW_TAG_member
	.dwattr $C$DW$748, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$748, DW_AT_name("r")
	.dwattr $C$DW$748, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$748, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$748, DW_AT_bit_size(0x01)
	.dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$748, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$748, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$748, DW_AT_decl_column(0x12)

$C$DW$749	.dwtag  DW_TAG_member
	.dwattr $C$DW$749, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$749, DW_AT_name("s")
	.dwattr $C$DW$749, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$749, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$749, DW_AT_bit_size(0x01)
	.dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$749, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$749, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$749, DW_AT_decl_column(0x12)

$C$DW$750	.dwtag  DW_TAG_member
	.dwattr $C$DW$750, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$750, DW_AT_name("t")
	.dwattr $C$DW$750, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$750, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$750, DW_AT_bit_size(0x01)
	.dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$750, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$750, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$750, DW_AT_decl_column(0x12)

$C$DW$751	.dwtag  DW_TAG_member
	.dwattr $C$DW$751, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$751, DW_AT_name("x")
	.dwattr $C$DW$751, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$751, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$751, DW_AT_bit_size(0x01)
	.dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$751, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$751, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$751, DW_AT_decl_column(0x12)

$C$DW$752	.dwtag  DW_TAG_member
	.dwattr $C$DW$752, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$752, DW_AT_name("y")
	.dwattr $C$DW$752, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$752, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$752, DW_AT_bit_size(0x01)
	.dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$752, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$752, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$752, DW_AT_decl_column(0x12)

$C$DW$753	.dwtag  DW_TAG_member
	.dwattr $C$DW$753, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$753, DW_AT_name("z")
	.dwattr $C$DW$753, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$753, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$753, DW_AT_bit_size(0x01)
	.dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$753, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$753, DW_AT_decl_line(0x180)
	.dwattr $C$DW$753, DW_AT_decl_column(0x12)

$C$DW$754	.dwtag  DW_TAG_member
	.dwattr $C$DW$754, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$754, DW_AT_name("q")
	.dwattr $C$DW$754, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$754, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$754, DW_AT_bit_size(0x01)
	.dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$754, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$754, DW_AT_decl_line(0x181)
	.dwattr $C$DW$754, DW_AT_decl_column(0x12)

$C$DW$755	.dwtag  DW_TAG_member
	.dwattr $C$DW$755, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$755, DW_AT_name("d")
	.dwattr $C$DW$755, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$755, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$755, DW_AT_bit_size(0x01)
	.dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$755, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$755, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$755, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x171)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$63


$C$DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x2e)
$C$DW$756	.dwtag  DW_TAG_member
	.dwattr $C$DW$756, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$756, DW_AT_name("motion")
	.dwattr $C$DW$756, DW_AT_TI_symbol_name("motion")
	.dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$756, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$756, DW_AT_decl_line(0x191)
	.dwattr $C$DW$756, DW_AT_decl_column(0x13)

$C$DW$757	.dwtag  DW_TAG_member
	.dwattr $C$DW$757, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$757, DW_AT_name("feed_mode")
	.dwattr $C$DW$757, DW_AT_TI_symbol_name("feed_mode")
	.dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$757, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$757, DW_AT_decl_line(0x192)
	.dwattr $C$DW$757, DW_AT_decl_column(0x11)

$C$DW$758	.dwtag  DW_TAG_member
	.dwattr $C$DW$758, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$758, DW_AT_name("units_imperial")
	.dwattr $C$DW$758, DW_AT_TI_symbol_name("units_imperial")
	.dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$758, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$758, DW_AT_decl_line(0x193)
	.dwattr $C$DW$758, DW_AT_decl_column(0x0a)

$C$DW$759	.dwtag  DW_TAG_member
	.dwattr $C$DW$759, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$759, DW_AT_name("distance_incremental")
	.dwattr $C$DW$759, DW_AT_TI_symbol_name("distance_incremental")
	.dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$759, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$759, DW_AT_decl_line(0x194)
	.dwattr $C$DW$759, DW_AT_decl_column(0x0a)

$C$DW$760	.dwtag  DW_TAG_member
	.dwattr $C$DW$760, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$760, DW_AT_name("diameter_mode")
	.dwattr $C$DW$760, DW_AT_TI_symbol_name("diameter_mode")
	.dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$760, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$760, DW_AT_decl_line(0x195)
	.dwattr $C$DW$760, DW_AT_decl_column(0x0a)

$C$DW$761	.dwtag  DW_TAG_member
	.dwattr $C$DW$761, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$761, DW_AT_name("plane_select")
	.dwattr $C$DW$761, DW_AT_TI_symbol_name("plane_select")
	.dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$761, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$761, DW_AT_decl_line(0x197)
	.dwattr $C$DW$761, DW_AT_decl_column(0x14)

$C$DW$762	.dwtag  DW_TAG_member
	.dwattr $C$DW$762, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$762, DW_AT_name("tool_offset_mode")
	.dwattr $C$DW$762, DW_AT_TI_symbol_name("tool_offset_mode")
	.dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$762, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$762, DW_AT_decl_line(0x199)
	.dwattr $C$DW$762, DW_AT_decl_column(0x18)

$C$DW$763	.dwtag  DW_TAG_member
	.dwattr $C$DW$763, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$763, DW_AT_name("coord_system")
	.dwattr $C$DW$763, DW_AT_TI_symbol_name("coord_system")
	.dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$763, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$763, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$763, DW_AT_decl_column(0x14)

$C$DW$764	.dwtag  DW_TAG_member
	.dwattr $C$DW$764, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$764, DW_AT_name("program_flow")
	.dwattr $C$DW$764, DW_AT_TI_symbol_name("program_flow")
	.dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$764, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$764, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$764, DW_AT_decl_column(0x14)

$C$DW$765	.dwtag  DW_TAG_member
	.dwattr $C$DW$765, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$765, DW_AT_name("coolant")
	.dwattr $C$DW$765, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$765, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$765, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$765, DW_AT_decl_column(0x15)

$C$DW$766	.dwtag  DW_TAG_member
	.dwattr $C$DW$766, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$766, DW_AT_name("spindle")
	.dwattr $C$DW$766, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$766, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$766, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$766, DW_AT_decl_column(0x15)

$C$DW$767	.dwtag  DW_TAG_member
	.dwattr $C$DW$767, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$767, DW_AT_name("override_ctrl")
	.dwattr $C$DW$767, DW_AT_TI_symbol_name("override_ctrl")
	.dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$767, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$767, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$767, DW_AT_decl_column(0x19)

$C$DW$768	.dwtag  DW_TAG_member
	.dwattr $C$DW$768, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$768, DW_AT_name("spindle_rpm_mode")
	.dwattr $C$DW$768, DW_AT_TI_symbol_name("spindle_rpm_mode")
	.dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$768, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$768, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$768, DW_AT_decl_column(0x18)

$C$DW$769	.dwtag  DW_TAG_member
	.dwattr $C$DW$769, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$769, DW_AT_name("retract_mode")
	.dwattr $C$DW$769, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$769, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$769, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$769, DW_AT_decl_column(0x17)

$C$DW$770	.dwtag  DW_TAG_member
	.dwattr $C$DW$770, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$770, DW_AT_name("scaling_active")
	.dwattr $C$DW$770, DW_AT_TI_symbol_name("scaling_active")
	.dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$770, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$770, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$770, DW_AT_decl_column(0x0a)

$C$DW$771	.dwtag  DW_TAG_member
	.dwattr $C$DW$771, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$771, DW_AT_name("canned_cycle_active")
	.dwattr $C$DW$771, DW_AT_TI_symbol_name("canned_cycle_active")
	.dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$771, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$771, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$771, DW_AT_decl_column(0x0a)

$C$DW$772	.dwtag  DW_TAG_member
	.dwattr $C$DW$772, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$772, DW_AT_name("spline_pq")
	.dwattr $C$DW$772, DW_AT_TI_symbol_name("spline_pq")
	.dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$772, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$772, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$772, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$81, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$81, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$81, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$81

$C$DW$T$92	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$92, DW_AT_name("gc_modal_t")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$92, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$92, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$92, DW_AT_decl_column(0x03)


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x22)
$C$DW$773	.dwtag  DW_TAG_member
	.dwattr $C$DW$773, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$773, DW_AT_name("xyz")
	.dwattr $C$DW$773, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$773, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$773, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$773, DW_AT_decl_column(0x0b)

$C$DW$774	.dwtag  DW_TAG_member
	.dwattr $C$DW$774, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$774, DW_AT_name("delta")
	.dwattr $C$DW$774, DW_AT_TI_symbol_name("delta")
	.dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$774, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$774, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$774, DW_AT_decl_column(0x0b)

$C$DW$775	.dwtag  DW_TAG_member
	.dwattr $C$DW$775, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$775, DW_AT_name("dwell")
	.dwattr $C$DW$775, DW_AT_TI_symbol_name("dwell")
	.dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$775, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$775, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$775, DW_AT_decl_column(0x0b)

$C$DW$776	.dwtag  DW_TAG_member
	.dwattr $C$DW$776, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$776, DW_AT_name("prev_position")
	.dwattr $C$DW$776, DW_AT_TI_symbol_name("prev_position")
	.dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$776, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$776, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$776, DW_AT_decl_column(0x0b)

$C$DW$777	.dwtag  DW_TAG_member
	.dwattr $C$DW$777, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$777, DW_AT_name("retract_position")
	.dwattr $C$DW$777, DW_AT_TI_symbol_name("retract_position")
	.dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$777, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$777, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$777, DW_AT_decl_column(0x0b)

$C$DW$778	.dwtag  DW_TAG_member
	.dwattr $C$DW$778, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$778, DW_AT_name("rapid_retract")
	.dwattr $C$DW$778, DW_AT_TI_symbol_name("rapid_retract")
	.dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$778, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$778, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$778, DW_AT_decl_column(0x0a)

$C$DW$779	.dwtag  DW_TAG_member
	.dwattr $C$DW$779, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$779, DW_AT_name("spindle_off")
	.dwattr $C$DW$779, DW_AT_TI_symbol_name("spindle_off")
	.dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$779, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$779, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$779, DW_AT_decl_column(0x0a)

$C$DW$780	.dwtag  DW_TAG_member
	.dwattr $C$DW$780, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$780, DW_AT_name("retract_mode")
	.dwattr $C$DW$780, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$780, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$780, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$780, DW_AT_decl_column(0x17)

$C$DW$781	.dwtag  DW_TAG_member
	.dwattr $C$DW$781, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$781, DW_AT_name("change")
	.dwattr $C$DW$781, DW_AT_TI_symbol_name("change")
	.dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$781, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$781, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$781, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$82, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$82

$C$DW$T$93	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$93, DW_AT_name("gc_canned_t")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$93, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$93, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$T$93, DW_AT_decl_column(0x03)


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x2c)
$C$DW$782	.dwtag  DW_TAG_member
	.dwattr $C$DW$782, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$782, DW_AT_name("pitch")
	.dwattr $C$DW$782, DW_AT_TI_symbol_name("pitch")
	.dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$782, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$782, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$782, DW_AT_decl_column(0x0b)

$C$DW$783	.dwtag  DW_TAG_member
	.dwattr $C$DW$783, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$783, DW_AT_name("z_final")
	.dwattr $C$DW$783, DW_AT_TI_symbol_name("z_final")
	.dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$783, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$783, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$783, DW_AT_decl_column(0x0b)

$C$DW$784	.dwtag  DW_TAG_member
	.dwattr $C$DW$784, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$784, DW_AT_name("peak")
	.dwattr $C$DW$784, DW_AT_TI_symbol_name("peak")
	.dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$784, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$784, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$784, DW_AT_decl_column(0x0b)

$C$DW$785	.dwtag  DW_TAG_member
	.dwattr $C$DW$785, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$785, DW_AT_name("initial_depth")
	.dwattr $C$DW$785, DW_AT_TI_symbol_name("initial_depth")
	.dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$785, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$785, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$785, DW_AT_decl_column(0x0b)

$C$DW$786	.dwtag  DW_TAG_member
	.dwattr $C$DW$786, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$786, DW_AT_name("depth")
	.dwattr $C$DW$786, DW_AT_TI_symbol_name("depth")
	.dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$786, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$786, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$786, DW_AT_decl_column(0x0b)

$C$DW$787	.dwtag  DW_TAG_member
	.dwattr $C$DW$787, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$787, DW_AT_name("depth_degression")
	.dwattr $C$DW$787, DW_AT_TI_symbol_name("depth_degression")
	.dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$787, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$787, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$787, DW_AT_decl_column(0x0b)

$C$DW$788	.dwtag  DW_TAG_member
	.dwattr $C$DW$788, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$788, DW_AT_name("main_taper_height")
	.dwattr $C$DW$788, DW_AT_TI_symbol_name("main_taper_height")
	.dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$788, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$788, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$788, DW_AT_decl_column(0x0b)

$C$DW$789	.dwtag  DW_TAG_member
	.dwattr $C$DW$789, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$789, DW_AT_name("end_taper_length")
	.dwattr $C$DW$789, DW_AT_TI_symbol_name("end_taper_length")
	.dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$789, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$789, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$789, DW_AT_decl_column(0x0b)

$C$DW$790	.dwtag  DW_TAG_member
	.dwattr $C$DW$790, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$790, DW_AT_name("infeed_angle")
	.dwattr $C$DW$790, DW_AT_TI_symbol_name("infeed_angle")
	.dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$790, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$790, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$790, DW_AT_decl_column(0x0b)

$C$DW$791	.dwtag  DW_TAG_member
	.dwattr $C$DW$791, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$791, DW_AT_name("cut_direction")
	.dwattr $C$DW$791, DW_AT_TI_symbol_name("cut_direction")
	.dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$791, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$791, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$791, DW_AT_decl_column(0x0b)

$C$DW$792	.dwtag  DW_TAG_member
	.dwattr $C$DW$792, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$792, DW_AT_name("spring_passes")
	.dwattr $C$DW$792, DW_AT_TI_symbol_name("spring_passes")
	.dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$792, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$792, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$792, DW_AT_decl_column(0x13)

$C$DW$793	.dwtag  DW_TAG_member
	.dwattr $C$DW$793, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$793, DW_AT_name("end_taper_type")
	.dwattr $C$DW$793, DW_AT_TI_symbol_name("end_taper_type")
	.dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$793, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$793, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$793, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$85, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$85

$C$DW$T$525	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$525, DW_AT_name("gc_thread_data")
	.dwattr $C$DW$T$525, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$525, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$525, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$525, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$T$525, DW_AT_decl_column(0x03)


$C$DW$T$86	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x14)
$C$DW$794	.dwtag  DW_TAG_member
	.dwattr $C$DW$794, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$794, DW_AT_name("offset")
	.dwattr $C$DW$794, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$794, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$794, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$794, DW_AT_decl_column(0x0b)

$C$DW$795	.dwtag  DW_TAG_member
	.dwattr $C$DW$795, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$795, DW_AT_name("radius")
	.dwattr $C$DW$795, DW_AT_TI_symbol_name("radius")
	.dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$795, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$795, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$795, DW_AT_decl_column(0x0b)

$C$DW$796	.dwtag  DW_TAG_member
	.dwattr $C$DW$796, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$796, DW_AT_name("tool")
	.dwattr $C$DW$796, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$796, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$796, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$796, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$86, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$86

$C$DW$T$95	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$95, DW_AT_name("tool_data_t")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$95, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$95, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$T$95, DW_AT_decl_column(0x03)

$C$DW$T$96	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$96, DW_AT_address_class(0x14)


$C$DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x14)
$C$DW$797	.dwtag  DW_TAG_member
	.dwattr $C$DW$797, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$797, DW_AT_name("surface_speed")
	.dwattr $C$DW$797, DW_AT_TI_symbol_name("surface_speed")
	.dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$797, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$797, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$797, DW_AT_decl_column(0x0b)

$C$DW$798	.dwtag  DW_TAG_member
	.dwattr $C$DW$798, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$798, DW_AT_name("target_rpm")
	.dwattr $C$DW$798, DW_AT_TI_symbol_name("target_rpm")
	.dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$798, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$798, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$798, DW_AT_decl_column(0x0b)

$C$DW$799	.dwtag  DW_TAG_member
	.dwattr $C$DW$799, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$799, DW_AT_name("max_rpm")
	.dwattr $C$DW$799, DW_AT_TI_symbol_name("max_rpm")
	.dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$799, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$799, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$799, DW_AT_decl_column(0x0b)

$C$DW$800	.dwtag  DW_TAG_member
	.dwattr $C$DW$800, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$800, DW_AT_name("tool_offset")
	.dwattr $C$DW$800, DW_AT_TI_symbol_name("tool_offset")
	.dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$800, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$800, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$800, DW_AT_decl_column(0x0b)

$C$DW$801	.dwtag  DW_TAG_member
	.dwattr $C$DW$801, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$801, DW_AT_name("axis")
	.dwattr $C$DW$801, DW_AT_TI_symbol_name("axis")
	.dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$801, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$801, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$801, DW_AT_decl_column(0x12)

$C$DW$802	.dwtag  DW_TAG_member
	.dwattr $C$DW$802, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$802, DW_AT_name("active")
	.dwattr $C$DW$802, DW_AT_TI_symbol_name("active")
	.dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$802, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$802, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$802, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$89

$C$DW$T$90	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$90, DW_AT_name("css_data_t")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x03)


$C$DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x18)
$C$DW$803	.dwtag  DW_TAG_member
	.dwattr $C$DW$803, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$803, DW_AT_name("rpm")
	.dwattr $C$DW$803, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$803, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$803, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$803, DW_AT_decl_column(0x0b)

$C$DW$804	.dwtag  DW_TAG_member
	.dwattr $C$DW$804, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$804, DW_AT_name("css")
	.dwattr $C$DW$804, DW_AT_TI_symbol_name("css")
	.dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$804, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$804, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$804, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$91, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$91, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$91

$C$DW$T$94	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$94, DW_AT_name("spindle_t")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$94, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$94, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$94, DW_AT_decl_column(0x03)


$C$DW$T$97	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$97, DW_AT_byte_size(0xa8)
$C$DW$805	.dwtag  DW_TAG_member
	.dwattr $C$DW$805, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$805, DW_AT_name("modal")
	.dwattr $C$DW$805, DW_AT_TI_symbol_name("modal")
	.dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$805, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$805, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$805, DW_AT_decl_column(0x10)

$C$DW$806	.dwtag  DW_TAG_member
	.dwattr $C$DW$806, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$806, DW_AT_name("canned")
	.dwattr $C$DW$806, DW_AT_TI_symbol_name("canned")
	.dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$806, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$806, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$806, DW_AT_decl_column(0x11)

$C$DW$807	.dwtag  DW_TAG_member
	.dwattr $C$DW$807, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$807, DW_AT_name("spindle")
	.dwattr $C$DW$807, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$807, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$807, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$807, DW_AT_decl_column(0x0f)

$C$DW$808	.dwtag  DW_TAG_member
	.dwattr $C$DW$808, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$808, DW_AT_name("feed_rate")
	.dwattr $C$DW$808, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$808, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$808, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$808, DW_AT_decl_column(0x0b)

$C$DW$809	.dwtag  DW_TAG_member
	.dwattr $C$DW$809, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$809, DW_AT_name("distance_per_rev")
	.dwattr $C$DW$809, DW_AT_TI_symbol_name("distance_per_rev")
	.dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$809, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$809, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$809, DW_AT_decl_column(0x0b)

$C$DW$810	.dwtag  DW_TAG_member
	.dwattr $C$DW$810, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$810, DW_AT_name("position")
	.dwattr $C$DW$810, DW_AT_TI_symbol_name("position")
	.dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$810, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$810, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$810, DW_AT_decl_column(0x0b)

$C$DW$811	.dwtag  DW_TAG_member
	.dwattr $C$DW$811, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$811, DW_AT_name("line_number")
	.dwattr $C$DW$811, DW_AT_TI_symbol_name("line_number")
	.dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$811, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$811, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$811, DW_AT_decl_column(0x0d)

$C$DW$812	.dwtag  DW_TAG_member
	.dwattr $C$DW$812, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$812, DW_AT_name("tool_pending")
	.dwattr $C$DW$812, DW_AT_TI_symbol_name("tool_pending")
	.dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$812, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$812, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$812, DW_AT_decl_column(0x0e)

$C$DW$813	.dwtag  DW_TAG_member
	.dwattr $C$DW$813, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$813, DW_AT_name("file_run")
	.dwattr $C$DW$813, DW_AT_TI_symbol_name("file_run")
	.dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$813, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$813, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$813, DW_AT_decl_column(0x0a)

$C$DW$814	.dwtag  DW_TAG_member
	.dwattr $C$DW$814, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$814, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$814, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x85]
	.dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$814, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$814, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$814, DW_AT_decl_column(0x0a)

$C$DW$815	.dwtag  DW_TAG_member
	.dwattr $C$DW$815, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$815, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$815, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$815, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$815, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$815, DW_AT_decl_column(0x0a)

$C$DW$816	.dwtag  DW_TAG_member
	.dwattr $C$DW$816, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$816, DW_AT_name("tool_change")
	.dwattr $C$DW$816, DW_AT_TI_symbol_name("tool_change")
	.dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
	.dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$816, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$816, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$816, DW_AT_decl_column(0x0a)

$C$DW$817	.dwtag  DW_TAG_member
	.dwattr $C$DW$817, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$817, DW_AT_name("last_error")
	.dwattr $C$DW$817, DW_AT_TI_symbol_name("last_error")
	.dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$817, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$817, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$817, DW_AT_decl_column(0x13)

$C$DW$818	.dwtag  DW_TAG_member
	.dwattr $C$DW$818, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$818, DW_AT_name("g92_coord_offset_applied")
	.dwattr $C$DW$818, DW_AT_TI_symbol_name("g92_coord_offset_applied")
	.dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$818, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$818, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$818, DW_AT_decl_column(0x0a)

$C$DW$819	.dwtag  DW_TAG_member
	.dwattr $C$DW$819, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$819, DW_AT_name("g92_coord_offset")
