;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed May 31 19:52:20 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../grbl/gcode.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("sys")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("sys")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$1138)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x11)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("settings")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("settings")
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$530)

	.dwattr $C$DW$1467, DW_AT_name("NGCParam_w")
	.dwattr $C$DW$1467, DW_AT_const_value(0x28)
	.dwattr $C$DW$1467, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1467, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$1467, DW_AT_decl_column(0x05)

$C$DW$1468	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1468, DW_AT_name("NGCParam_current_tool")
	.dwattr $C$DW$1468, DW_AT_const_value(0x29)
	.dwattr $C$DW$1468, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1468, DW_AT_decl_line(0x50)
	.dwattr $C$DW$1468, DW_AT_decl_column(0x05)

$C$DW$1469	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1469, DW_AT_name("NGCParam_current_pocket")
	.dwattr $C$DW$1469, DW_AT_const_value(0x2a)
	.dwattr $C$DW$1469, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1469, DW_AT_decl_line(0x51)
	.dwattr $C$DW$1469, DW_AT_decl_column(0x05)

$C$DW$1470	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1470, DW_AT_name("NGCParam_selected_tool")
	.dwattr $C$DW$1470, DW_AT_const_value(0x2b)
	.dwattr $C$DW$1470, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1470, DW_AT_decl_line(0x52)
	.dwattr $C$DW$1470, DW_AT_decl_column(0x05)

$C$DW$1471	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1471, DW_AT_name("NGCParam_selected_pocket")
	.dwattr $C$DW$1471, DW_AT_const_value(0x2c)
	.dwattr $C$DW$1471, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1471, DW_AT_decl_line(0x53)
	.dwattr $C$DW$1471, DW_AT_decl_column(0x05)

$C$DW$1472	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1472, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$1472, DW_AT_const_value(0x2d)
	.dwattr $C$DW$1472, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1472, DW_AT_decl_line(0x54)
	.dwattr $C$DW$1472, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$812, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$812, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$812, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$812

$C$DW$T$813	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$813, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$813, DW_AT_type(*$C$DW$T$812)
	.dwattr $C$DW$T$813, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$813, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$813, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$813, DW_AT_decl_column(0x03)


$C$DW$T$814	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$814, DW_AT_byte_size(0x02)
$C$DW$1473	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1473, DW_AT_name("SettingsFormat_MachineReadable")
	.dwattr $C$DW$1473, DW_AT_const_value(0x00)
	.dwattr $C$DW$1473, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1473, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1473, DW_AT_decl_column(0x05)

$C$DW$1474	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1474, DW_AT_name("SettingsFormat_HumanReadable")
	.dwattr $C$DW$1474, DW_AT_const_value(0x01)
	.dwattr $C$DW$1474, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1474, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1474, DW_AT_decl_column(0x05)

$C$DW$1475	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1475, DW_AT_name("SettingsFormat_Grbl")
	.dwattr $C$DW$1475, DW_AT_const_value(0x02)
	.dwattr $C$DW$1475, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1475, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1475, DW_AT_decl_column(0x05)

$C$DW$1476	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1476, DW_AT_name("SettingsFormat_grblHAL")
	.dwattr $C$DW$1476, DW_AT_const_value(0x03)
	.dwattr $C$DW$1476, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1476, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1476, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$814, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$814, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$814, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$814

$C$DW$T$815	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$815, DW_AT_name("settings_format_t")
	.dwattr $C$DW$T$815, DW_AT_type(*$C$DW$T$814)
	.dwattr $C$DW$T$815, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$815, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$815, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$815, DW_AT_decl_column(0x03)


$C$DW$T$816	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$816, DW_AT_byte_size(0x02)
$C$DW$1477	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1477, DW_AT_name("PullMode_None")
	.dwattr $C$DW$1477, DW_AT_const_value(0x00)
	.dwattr $C$DW$1477, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1477, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1477, DW_AT_decl_column(0x05)

$C$DW$1478	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1478, DW_AT_name("PullMode_Up")
	.dwattr $C$DW$1478, DW_AT_const_value(0x01)
	.dwattr $C$DW$1478, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1478, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1478, DW_AT_decl_column(0x05)

$C$DW$1479	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1479, DW_AT_name("PullMode_Down")
	.dwattr $C$DW$1479, DW_AT_const_value(0x02)
	.dwattr $C$DW$1479, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1479, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1479, DW_AT_decl_column(0x05)

$C$DW$1480	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1480, DW_AT_name("PullMode_UpDown")
	.dwattr $C$DW$1480, DW_AT_const_value(0x03)
	.dwattr $C$DW$1480, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1480, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1480, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$816, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$816, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$816, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$816

$C$DW$T$817	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$817, DW_AT_name("pull_mode_t")
	.dwattr $C$DW$T$817, DW_AT_type(*$C$DW$T$816)
	.dwattr $C$DW$T$817, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$817, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$817, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$817, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$1481	.dwtag  DW_TAG_member
	.dwattr $C$DW$1481, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1481, DW_AT_name("flood")
	.dwattr $C$DW$1481, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$1481, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1481, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1481, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1481, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$1481, DW_AT_decl_column(0x11)

$C$DW$1482	.dwtag  DW_TAG_member
	.dwattr $C$DW$1482, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1482, DW_AT_name("mist")
	.dwattr $C$DW$1482, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$1482, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1482, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1482, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1482, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$1482, DW_AT_decl_column(0x11)

$C$DW$1483	.dwtag  DW_TAG_member
	.dwattr $C$DW$1483, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1483, DW_AT_name("shower")
	.dwattr $C$DW$1483, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$1483, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1483, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1483, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1483, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1483, DW_AT_decl_column(0x11)

$C$DW$1484	.dwtag  DW_TAG_member
	.dwattr $C$DW$1484, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1484, DW_AT_name("trough_spindle")
	.dwattr $C$DW$1484, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$1484, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1484, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1484, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1484, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1484, DW_AT_decl_column(0x11)

$C$DW$1485	.dwtag  DW_TAG_member
	.dwattr $C$DW$1485, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1485, DW_AT_name("unused")
	.dwattr $C$DW$1485, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$1485, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1485, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1485, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1485, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1485, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
$C$DW$1486	.dwtag  DW_TAG_member
	.dwattr $C$DW$1486, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1486, DW_AT_name("on")
	.dwattr $C$DW$1486, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$1486, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1486, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1486, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1486, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1486, DW_AT_decl_column(0x11)

$C$DW$1487	.dwtag  DW_TAG_member
	.dwattr $C$DW$1487, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1487, DW_AT_name("ccw")
	.dwattr $C$DW$1487, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$1487, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1487, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1487, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1487, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1487, DW_AT_decl_column(0x11)

$C$DW$1488	.dwtag  DW_TAG_member
	.dwattr $C$DW$1488, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1488, DW_AT_name("pwm")
	.dwattr $C$DW$1488, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$1488, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1488, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1488, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1488, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1488, DW_AT_decl_column(0x11)

$C$DW$1489	.dwtag  DW_TAG_member
	.dwattr $C$DW$1489, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1489, DW_AT_name("reserved3")
	.dwattr $C$DW$1489, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$1489, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1489, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1489, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1489, DW_AT_decl_line(0x22)
	.dwattr $C$DW$1489, DW_AT_decl_column(0x11)

$C$DW$1490	.dwtag  DW_TAG_member
	.dwattr $C$DW$1490, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1490, DW_AT_name("reserved4")
	.dwattr $C$DW$1490, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$1490, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1490, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1490, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1490, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1490, DW_AT_decl_column(0x11)

$C$DW$1491	.dwtag  DW_TAG_member
	.dwattr $C$DW$1491, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1491, DW_AT_name("encoder_error")
	.dwattr $C$DW$1491, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$1491, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1491, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1491, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1491, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1491, DW_AT_decl_column(0x11)

$C$DW$1492	.dwtag  DW_TAG_member
	.dwattr $C$DW$1492, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1492, DW_AT_name("at_speed")
	.dwattr $C$DW$1492, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$1492, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1492, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1492, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1492, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1492, DW_AT_decl_column(0x11)

$C$DW$1493	.dwtag  DW_TAG_member
	.dwattr $C$DW$1493, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1493, DW_AT_name("synchronized")
	.dwattr $C$DW$1493, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$1493, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1493, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1493, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1493, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1493, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$25


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x14)
$C$DW$1494	.dwtag  DW_TAG_member
	.dwattr $C$DW$1494, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1494, DW_AT_name("surface_speed")
	.dwattr $C$DW$1494, DW_AT_TI_symbol_name("surface_speed")
	.dwattr $C$DW$1494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1494, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1494, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$1494, DW_AT_decl_column(0x0b)

$C$DW$1495	.dwtag  DW_TAG_member
	.dwattr $C$DW$1495, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1495, DW_AT_name("target_rpm")
	.dwattr $C$DW$1495, DW_AT_TI_symbol_name("target_rpm")
	.dwattr $C$DW$1495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1495, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1495, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$1495, DW_AT_decl_column(0x0b)

$C$DW$1496	.dwtag  DW_TAG_member
	.dwattr $C$DW$1496, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1496, DW_AT_name("max_rpm")
	.dwattr $C$DW$1496, DW_AT_TI_symbol_name("max_rpm")
	.dwattr $C$DW$1496, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1496, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1496, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$1496, DW_AT_decl_column(0x0b)

$C$DW$1497	.dwtag  DW_TAG_member
	.dwattr $C$DW$1497, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1497, DW_AT_name("tool_offset")
	.dwattr $C$DW$1497, DW_AT_TI_symbol_name("tool_offset")
	.dwattr $C$DW$1497, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1497, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1497, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$1497, DW_AT_decl_column(0x0b)

$C$DW$1498	.dwtag  DW_TAG_member
	.dwattr $C$DW$1498, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1498, DW_AT_name("axis")
	.dwattr $C$DW$1498, DW_AT_TI_symbol_name("axis")
	.dwattr $C$DW$1498, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1498, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1498, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$1498, DW_AT_decl_column(0x12)

$C$DW$1499	.dwtag  DW_TAG_member
	.dwattr $C$DW$1499, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1499, DW_AT_name("active")
	.dwattr $C$DW$1499, DW_AT_TI_symbol_name("active")
	.dwattr $C$DW$1499, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1499, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1499, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$1499, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$30

$C$DW$T$31	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$31, DW_AT_name("css_data_t")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x03)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x18)
$C$DW$1500	.dwtag  DW_TAG_member
	.dwattr $C$DW$1500, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1500, DW_AT_name("rpm")
	.dwattr $C$DW$1500, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$1500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1500, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1500, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$1500, DW_AT_decl_column(0x0b)

$C$DW$1501	.dwtag  DW_TAG_member
	.dwattr $C$DW$1501, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1501, DW_AT_name("css")
	.dwattr $C$DW$1501, DW_AT_TI_symbol_name("css")
	.dwattr $C$DW$1501, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1501, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1501, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$1501, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$32

$C$DW$T$38	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$38, DW_AT_name("spindle_t")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x03)


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
$C$DW$1502	.dwtag  DW_TAG_member
	.dwattr $C$DW$1502, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1502, DW_AT_name("rapid_motion")
	.dwattr $C$DW$1502, DW_AT_TI_symbol_name("rapid_motion")
	.dwattr $C$DW$1502, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1502, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1502, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1502, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1502, DW_AT_decl_column(0x12)

$C$DW$1503	.dwtag  DW_TAG_member
	.dwattr $C$DW$1503, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1503, DW_AT_name("system_motion")
	.dwattr $C$DW$1503, DW_AT_TI_symbol_name("system_motion")
	.dwattr $C$DW$1503, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1503, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1503, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1503, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1503, DW_AT_decl_column(0x12)

$C$DW$1504	.dwtag  DW_TAG_member
	.dwattr $C$DW$1504, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1504, DW_AT_name("jog_motion")
	.dwattr $C$DW$1504, DW_AT_TI_symbol_name("jog_motion")
	.dwattr $C$DW$1504, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1504, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1504, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1504, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1504, DW_AT_decl_column(0x12)

$C$DW$1505	.dwtag  DW_TAG_member
	.dwattr $C$DW$1505, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1505, DW_AT_name("backlash_motion")
	.dwattr $C$DW$1505, DW_AT_TI_symbol_name("backlash_motion")
	.dwattr $C$DW$1505, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1505, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1505, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1505, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1505, DW_AT_decl_column(0x12)

$C$DW$1506	.dwtag  DW_TAG_member
	.dwattr $C$DW$1506, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1506, DW_AT_name("no_feed_override")
	.dwattr $C$DW$1506, DW_AT_TI_symbol_name("no_feed_override")
	.dwattr $C$DW$1506, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1506, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1506, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1506, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1506, DW_AT_decl_column(0x12)

$C$DW$1507	.dwtag  DW_TAG_member
	.dwattr $C$DW$1507, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1507, DW_AT_name("inverse_time")
	.dwattr $C$DW$1507, DW_AT_TI_symbol_name("inverse_time")
	.dwattr $C$DW$1507, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1507, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1507, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1507, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1507, DW_AT_decl_column(0x12)

$C$DW$1508	.dwtag  DW_TAG_member
	.dwattr $C$DW$1508, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1508, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1508, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1508, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1508, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1508, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1508, DW_AT_decl_line(0x29)
	.dwattr $C$DW$1508, DW_AT_decl_column(0x12)

$C$DW$1509	.dwtag  DW_TAG_member
	.dwattr $C$DW$1509, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1509, DW_AT_name("is_rpm_pos_adjusted")
	.dwattr $C$DW$1509, DW_AT_TI_symbol_name("is_rpm_pos_adjusted")
	.dwattr $C$DW$1509, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1509, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1509, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1509, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$1509, DW_AT_decl_column(0x12)

$C$DW$1510	.dwtag  DW_TAG_member
	.dwattr $C$DW$1510, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1510, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$1510, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$1510, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1510, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1510, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1510, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$1510, DW_AT_decl_column(0x12)

$C$DW$1511	.dwtag  DW_TAG_member
	.dwattr $C$DW$1511, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1511, DW_AT_name("unassigned")
	.dwattr $C$DW$1511, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1511, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1511, DW_AT_bit_size(0x07)
	.dwattr $C$DW$1511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1511, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1511, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1511, DW_AT_decl_column(0x12)

$C$DW$1512	.dwtag  DW_TAG_member
	.dwattr $C$DW$1512, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$1512, DW_AT_name("spindle")
	.dwattr $C$DW$1512, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1512, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1512, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1512, DW_AT_decl_column(0x19)

$C$DW$1513	.dwtag  DW_TAG_member
	.dwattr $C$DW$1513, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1513, DW_AT_name("coolant")
	.dwattr $C$DW$1513, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1513, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1513, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1513, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1513, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$36, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$36


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$1514	.dwtag  DW_TAG_member
	.dwattr $C$DW$1514, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1514, DW_AT_name("feed_rate_disable")
	.dwattr $C$DW$1514, DW_AT_TI_symbol_name("feed_rate_disable")
	.dwattr $C$DW$1514, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1514, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1514, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1514, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1514, DW_AT_decl_column(0x11)

$C$DW$1515	.dwtag  DW_TAG_member
	.dwattr $C$DW$1515, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1515, DW_AT_name("feed_hold_disable")
	.dwattr $C$DW$1515, DW_AT_TI_symbol_name("feed_hold_disable")
	.dwattr $C$DW$1515, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1515, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1515, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1515, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1515, DW_AT_decl_column(0x11)

$C$DW$1516	.dwtag  DW_TAG_member
	.dwattr $C$DW$1516, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1516, DW_AT_name("spindle_rpm_disable")
	.dwattr $C$DW$1516, DW_AT_TI_symbol_name("spindle_rpm_disable")
	.dwattr $C$DW$1516, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1516, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1516, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1516, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1516, DW_AT_decl_column(0x11)

$C$DW$1517	.dwtag  DW_TAG_member
	.dwattr $C$DW$1517, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1517, DW_AT_name("parking_disable")
	.dwattr $C$DW$1517, DW_AT_TI_symbol_name("parking_disable")
	.dwattr $C$DW$1517, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1517, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1517, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1517, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1517, DW_AT_decl_column(0x11)

$C$DW$1518	.dwtag  DW_TAG_member
	.dwattr $C$DW$1518, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1518, DW_AT_name("reserved")
	.dwattr $C$DW$1518, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$1518, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1518, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1518, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1518, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1518, DW_AT_decl_column(0x11)

$C$DW$1519	.dwtag  DW_TAG_member
	.dwattr $C$DW$1519, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1519, DW_AT_name("sync")
	.dwattr $C$DW$1519, DW_AT_TI_symbol_name("sync")
	.dwattr $C$DW$1519, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1519, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1519, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1519, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1519, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$37, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$37


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x2e)
$C$DW$1520	.dwtag  DW_TAG_member
	.dwattr $C$DW$1520, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1520, DW_AT_name("feed_rate")
	.dwattr $C$DW$1520, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1520, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1520, DW_AT_decl_line(0x59)
	.dwattr $C$DW$1520, DW_AT_decl_column(0x0b)

$C$DW$1521	.dwtag  DW_TAG_member
	.dwattr $C$DW$1521, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1521, DW_AT_name("spindle")
	.dwattr $C$DW$1521, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1521, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1521, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1521, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1521, DW_AT_decl_column(0x0f)

$C$DW$1522	.dwtag  DW_TAG_member
	.dwattr $C$DW$1522, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1522, DW_AT_name("condition")
	.dwattr $C$DW$1522, DW_AT_TI_symbol_name("condition")
	.dwattr $C$DW$1522, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1522, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1522, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$1522, DW_AT_decl_column(0x14)

$C$DW$1523	.dwtag  DW_TAG_member
	.dwattr $C$DW$1523, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$1523, DW_AT_name("overrides")
	.dwattr $C$DW$1523, DW_AT_TI_symbol_name("overrides")
	.dwattr $C$DW$1523, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1523, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1523, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$1523, DW_AT_decl_column(0x19)

$C$DW$1524	.dwtag  DW_TAG_member
	.dwattr $C$DW$1524, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1524, DW_AT_name("line_number")
	.dwattr $C$DW$1524, DW_AT_TI_symbol_name("line_number")
	.dwattr $C$DW$1524, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$1524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1524, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1524, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1524, DW_AT_decl_column(0x0d)

$C$DW$1525	.dwtag  DW_TAG_member
	.dwattr $C$DW$1525, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1525, DW_AT_name("message")
	.dwattr $C$DW$1525, DW_AT_TI_symbol_name("message")
	.dwattr $C$DW$1525, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1525, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1525, DW_AT_decl_line(0x60)
	.dwattr $C$DW$1525, DW_AT_decl_column(0x0b)

$C$DW$1526	.dwtag  DW_TAG_member
	.dwattr $C$DW$1526, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1526, DW_AT_name("output_commands")
	.dwattr $C$DW$1526, DW_AT_TI_symbol_name("output_commands")
	.dwattr $C$DW$1526, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1526, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1526, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1526, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$47

$C$DW$T$259	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$259, DW_AT_name("plan_line_data_t")
	.dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$259, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$259, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$T$259, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$259, DW_AT_decl_column(0x03)

$C$DW$T$260	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$260, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$T$260, DW_AT_address_class(0x14)


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x03)
$C$DW$1527	.dwtag  DW_TAG_member
	.dwattr $C$DW$1527, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1527, DW_AT_name("axis_0")
	.dwattr $C$DW$1527, DW_AT_TI_symbol_name("axis_0")
	.dwattr $C$DW$1527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1527, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1527, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$1527, DW_AT_decl_column(0x0d)

$C$DW$1528	.dwtag  DW_TAG_member
	.dwattr $C$DW$1528, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1528, DW_AT_name("axis_1")
	.dwattr $C$DW$1528, DW_AT_TI_symbol_name("axis_1")
	.dwattr $C$DW$1528, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1528, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1528, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1528, DW_AT_decl_column(0x0d)

$C$DW$1529	.dwtag  DW_TAG_member
	.dwattr $C$DW$1529, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1529, DW_AT_name("axis_linear")
	.dwattr $C$DW$1529, DW_AT_TI_symbol_name("axis_linear")
	.dwattr $C$DW$1529, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1529, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1529, DW_AT_decl_line(0x151)
	.dwattr $C$DW$1529, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$48

$C$DW$T$820	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$820, DW_AT_name("plane_t")
	.dwattr $C$DW$T$820, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$820, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$820, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$820, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$820, DW_AT_decl_column(0x03)

$C$DW$T$821	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$821, DW_AT_type(*$C$DW$T$820)
	.dwattr $C$DW$T$821, DW_AT_address_class(0x14)


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x22)
$C$DW$1530	.dwtag  DW_TAG_member
	.dwattr $C$DW$1530, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1530, DW_AT_name("xyz")
	.dwattr $C$DW$1530, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1530, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1530, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$1530, DW_AT_decl_column(0x0b)

$C$DW$1531	.dwtag  DW_TAG_member
	.dwattr $C$DW$1531, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1531, DW_AT_name("delta")
	.dwattr $C$DW$1531, DW_AT_TI_symbol_name("delta")
	.dwattr $C$DW$1531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1531, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1531, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$1531, DW_AT_decl_column(0x0b)

$C$DW$1532	.dwtag  DW_TAG_member
	.dwattr $C$DW$1532, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1532, DW_AT_name("dwell")
	.dwattr $C$DW$1532, DW_AT_TI_symbol_name("dwell")
	.dwattr $C$DW$1532, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1532, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1532, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$1532, DW_AT_decl_column(0x0b)

$C$DW$1533	.dwtag  DW_TAG_member
	.dwattr $C$DW$1533, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1533, DW_AT_name("prev_position")
	.dwattr $C$DW$1533, DW_AT_TI_symbol_name("prev_position")
	.dwattr $C$DW$1533, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1533, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1533, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$1533, DW_AT_decl_column(0x0b)

$C$DW$1534	.dwtag  DW_TAG_member
	.dwattr $C$DW$1534, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1534, DW_AT_name("retract_position")
	.dwattr $C$DW$1534, DW_AT_TI_symbol_name("retract_position")
	.dwattr $C$DW$1534, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1534, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1534, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$1534, DW_AT_decl_column(0x0b)

$C$DW$1535	.dwtag  DW_TAG_member
	.dwattr $C$DW$1535, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1535, DW_AT_name("rapid_retract")
	.dwattr $C$DW$1535, DW_AT_TI_symbol_name("rapid_retract")
	.dwattr $C$DW$1535, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1535, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1535, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$1535, DW_AT_decl_column(0x0a)

$C$DW$1536	.dwtag  DW_TAG_member
	.dwattr $C$DW$1536, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1536, DW_AT_name("spindle_off")
	.dwattr $C$DW$1536, DW_AT_TI_symbol_name("spindle_off")
	.dwattr $C$DW$1536, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1536, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1536, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$1536, DW_AT_decl_column(0x0a)

$C$DW$1537	.dwtag  DW_TAG_member
	.dwattr $C$DW$1537, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1537, DW_AT_name("retract_mode")
	.dwattr $C$DW$1537, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$1537, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1537, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1537, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$1537, DW_AT_decl_column(0x17)

$C$DW$1538	.dwtag  DW_TAG_member
	.dwattr $C$DW$1538, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1538, DW_AT_name("change")
	.dwattr $C$DW$1538, DW_AT_TI_symbol_name("change")
	.dwattr $C$DW$1538, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1538, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1538, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1538, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$52

$C$DW$T$92	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$92, DW_AT_name("gc_canned_t")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$92, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$92, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$T$92, DW_AT_decl_column(0x03)

$C$DW$T$826	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$826, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$826, DW_AT_address_class(0x14)


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x2c)
$C$DW$1539	.dwtag  DW_TAG_member
	.dwattr $C$DW$1539, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1539, DW_AT_name("pitch")
	.dwattr $C$DW$1539, DW_AT_TI_symbol_name("pitch")
	.dwattr $C$DW$1539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1539, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1539, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$1539, DW_AT_decl_column(0x0b)

$C$DW$1540	.dwtag  DW_TAG_member
	.dwattr $C$DW$1540, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1540, DW_AT_name("z_final")
	.dwattr $C$DW$1540, DW_AT_TI_symbol_name("z_final")
	.dwattr $C$DW$1540, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1540, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1540, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$1540, DW_AT_decl_column(0x0b)

$C$DW$1541	.dwtag  DW_TAG_member
	.dwattr $C$DW$1541, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1541, DW_AT_name("peak")
	.dwattr $C$DW$1541, DW_AT_TI_symbol_name("peak")
	.dwattr $C$DW$1541, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1541, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1541, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$1541, DW_AT_decl_column(0x0b)

$C$DW$1542	.dwtag  DW_TAG_member
	.dwattr $C$DW$1542, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1542, DW_AT_name("initial_depth")
	.dwattr $C$DW$1542, DW_AT_TI_symbol_name("initial_depth")
	.dwattr $C$DW$1542, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1542, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1542, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$1542, DW_AT_decl_column(0x0b)

$C$DW$1543	.dwtag  DW_TAG_member
	.dwattr $C$DW$1543, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1543, DW_AT_name("depth")
	.dwattr $C$DW$1543, DW_AT_TI_symbol_name("depth")
	.dwattr $C$DW$1543, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1543, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1543, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$1543, DW_AT_decl_column(0x0b)

$C$DW$1544	.dwtag  DW_TAG_member
	.dwattr $C$DW$1544, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1544, DW_AT_name("depth_degression")
	.dwattr $C$DW$1544, DW_AT_TI_symbol_name("depth_degression")
	.dwattr $C$DW$1544, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1544, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1544, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$1544, DW_AT_decl_column(0x0b)

$C$DW$1545	.dwtag  DW_TAG_member
	.dwattr $C$DW$1545, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1545, DW_AT_name("main_taper_height")
	.dwattr $C$DW$1545, DW_AT_TI_symbol_name("main_taper_height")
	.dwattr $C$DW$1545, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1545, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1545, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$1545, DW_AT_decl_column(0x0b)

$C$DW$1546	.dwtag  DW_TAG_member
	.dwattr $C$DW$1546, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1546, DW_AT_name("end_taper_length")
	.dwattr $C$DW$1546, DW_AT_TI_symbol_name("end_taper_length")
	.dwattr $C$DW$1546, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1546, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1546, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$1546, DW_AT_decl_column(0x0b)

$C$DW$1547	.dwtag  DW_TAG_member
	.dwattr $C$DW$1547, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1547, DW_AT_name("infeed_angle")
	.dwattr $C$DW$1547, DW_AT_TI_symbol_name("infeed_angle")
	.dwattr $C$DW$1547, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1547, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1547, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$1547, DW_AT_decl_column(0x0b)

$C$DW$1548	.dwtag  DW_TAG_member
	.dwattr $C$DW$1548, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1548, DW_AT_name("cut_direction")
	.dwattr $C$DW$1548, DW_AT_TI_symbol_name("cut_direction")
	.dwattr $C$DW$1548, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1548, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1548, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$1548, DW_AT_decl_column(0x0b)

$C$DW$1549	.dwtag  DW_TAG_member
	.dwattr $C$DW$1549, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1549, DW_AT_name("spring_passes")
	.dwattr $C$DW$1549, DW_AT_TI_symbol_name("spring_passes")
	.dwattr $C$DW$1549, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1549, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1549, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1549, DW_AT_decl_column(0x13)

$C$DW$1550	.dwtag  DW_TAG_member
	.dwattr $C$DW$1550, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$1550, DW_AT_name("end_taper_type")
	.dwattr $C$DW$1550, DW_AT_TI_symbol_name("end_taper_type")
	.dwattr $C$DW$1550, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1550, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1550, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$1550, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$57, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$57

$C$DW$T$828	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$828, DW_AT_name("gc_thread_data")
	.dwattr $C$DW$T$828, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$828, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$828, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$828, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$T$828, DW_AT_decl_column(0x03)

$C$DW$T$829	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$829, DW_AT_type(*$C$DW$T$828)
	.dwattr $C$DW$T$829, DW_AT_address_class(0x14)


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x0e)
$C$DW$1551	.dwtag  DW_TAG_member
	.dwattr $C$DW$1551, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1551, DW_AT_name("xyz")
	.dwattr $C$DW$1551, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1551, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1551, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1551, DW_AT_decl_column(0x0b)

$C$DW$1552	.dwtag  DW_TAG_member
	.dwattr $C$DW$1552, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$1552, DW_AT_name("id")
	.dwattr $C$DW$1552, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$1552, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1552, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1552, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1552, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$60

$C$DW$T$69	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$69, DW_AT_name("coord_system_t")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x03)


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x2e)
$C$DW$1553	.dwtag  DW_TAG_member
	.dwattr $C$DW$1553, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$1553, DW_AT_name("motion")
	.dwattr $C$DW$1553, DW_AT_TI_symbol_name("motion")
	.dwattr $C$DW$1553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1553, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1553, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1553, DW_AT_decl_column(0x13)

$C$DW$1554	.dwtag  DW_TAG_member
	.dwattr $C$DW$1554, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1554, DW_AT_name("feed_mode")
	.dwattr $C$DW$1554, DW_AT_TI_symbol_name("feed_mode")
	.dwattr $C$DW$1554, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1554, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1554, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1554, DW_AT_decl_column(0x11)

$C$DW$1555	.dwtag  DW_TAG_member
	.dwattr $C$DW$1555, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1555, DW_AT_name("units_imperial")
	.dwattr $C$DW$1555, DW_AT_TI_symbol_name("units_imperial")
	.dwattr $C$DW$1555, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1555, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1555, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1555, DW_AT_decl_column(0x0a)

$C$DW$1556	.dwtag  DW_TAG_member
	.dwattr $C$DW$1556, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1556, DW_AT_name("distance_incremental")
	.dwattr $C$DW$1556, DW_AT_TI_symbol_name("distance_incremental")
	.dwattr $C$DW$1556, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1556, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1556, DW_AT_decl_line(0x194)
	.dwattr $C$DW$1556, DW_AT_decl_column(0x0a)

$C$DW$1557	.dwtag  DW_TAG_member
	.dwattr $C$DW$1557, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1557, DW_AT_name("diameter_mode")
	.dwattr $C$DW$1557, DW_AT_TI_symbol_name("diameter_mode")
	.dwattr $C$DW$1557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1557, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1557, DW_AT_decl_line(0x195)
	.dwattr $C$DW$1557, DW_AT_decl_column(0x0a)

$C$DW$1558	.dwtag  DW_TAG_member
	.dwattr $C$DW$1558, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1558, DW_AT_name("plane_select")
	.dwattr $C$DW$1558, DW_AT_TI_symbol_name("plane_select")
	.dwattr $C$DW$1558, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1558, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1558, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1558, DW_AT_decl_column(0x14)

$C$DW$1559	.dwtag  DW_TAG_member
	.dwattr $C$DW$1559, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$1559, DW_AT_name("tool_offset_mode")
	.dwattr $C$DW$1559, DW_AT_TI_symbol_name("tool_offset_mode")
	.dwattr $C$DW$1559, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1559, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1559, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1559, DW_AT_decl_column(0x18)

$C$DW$1560	.dwtag  DW_TAG_member
	.dwattr $C$DW$1560, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1560, DW_AT_name("coord_system")
	.dwattr $C$DW$1560, DW_AT_TI_symbol_name("coord_system")
	.dwattr $C$DW$1560, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1560, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1560, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$1560, DW_AT_decl_column(0x14)

$C$DW$1561	.dwtag  DW_TAG_member
	.dwattr $C$DW$1561, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1561, DW_AT_name("program_flow")
	.dwattr $C$DW$1561, DW_AT_TI_symbol_name("program_flow")
	.dwattr $C$DW$1561, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1561, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1561, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1561, DW_AT_decl_column(0x14)

$C$DW$1562	.dwtag  DW_TAG_member
	.dwattr $C$DW$1562, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1562, DW_AT_name("coolant")
	.dwattr $C$DW$1562, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1562, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1562, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1562, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1562, DW_AT_decl_column(0x15)

$C$DW$1563	.dwtag  DW_TAG_member
	.dwattr $C$DW$1563, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$1563, DW_AT_name("spindle")
	.dwattr $C$DW$1563, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1563, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1563, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1563, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1563, DW_AT_decl_column(0x15)

$C$DW$1564	.dwtag  DW_TAG_member
	.dwattr $C$DW$1564, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$1564, DW_AT_name("override_ctrl")
	.dwattr $C$DW$1564, DW_AT_TI_symbol_name("override_ctrl")
	.dwattr $C$DW$1564, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1564, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1564, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1564, DW_AT_decl_column(0x19)

$C$DW$1565	.dwtag  DW_TAG_member
	.dwattr $C$DW$1565, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1565, DW_AT_name("spindle_rpm_mode")
	.dwattr $C$DW$1565, DW_AT_TI_symbol_name("spindle_rpm_mode")
	.dwattr $C$DW$1565, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1565, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1565, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$1565, DW_AT_decl_column(0x18)

$C$DW$1566	.dwtag  DW_TAG_member
	.dwattr $C$DW$1566, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1566, DW_AT_name("retract_mode")
	.dwattr $C$DW$1566, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$1566, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$1566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1566, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1566, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$1566, DW_AT_decl_column(0x17)

$C$DW$1567	.dwtag  DW_TAG_member
	.dwattr $C$DW$1567, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1567, DW_AT_name("scaling_active")
	.dwattr $C$DW$1567, DW_AT_TI_symbol_name("scaling_active")
	.dwattr $C$DW$1567, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1567, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1567, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$1567, DW_AT_decl_column(0x0a)

$C$DW$1568	.dwtag  DW_TAG_member
	.dwattr $C$DW$1568, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1568, DW_AT_name("canned_cycle_active")
	.dwattr $C$DW$1568, DW_AT_TI_symbol_name("canned_cycle_active")
	.dwattr $C$DW$1568, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$1568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1568, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1568, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$1568, DW_AT_decl_column(0x0a)

$C$DW$1569	.dwtag  DW_TAG_member
	.dwattr $C$DW$1569, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$1569, DW_AT_name("spline_pq")
	.dwattr $C$DW$1569, DW_AT_TI_symbol_name("spline_pq")
	.dwattr $C$DW$1569, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1569, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1569, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$1569, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$75, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$75

$C$DW$T$86	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$86, DW_AT_name("gc_modal_t")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x03)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x54)
$C$DW$1570	.dwtag  DW_TAG_member
	.dwattr $C$DW$1570, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1570, DW_AT_name("d")
	.dwattr $C$DW$1570, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$1570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1570, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1570, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1570, DW_AT_decl_column(0x0b)

$C$DW$1571	.dwtag  DW_TAG_member
	.dwattr $C$DW$1571, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1571, DW_AT_name("e")
	.dwattr $C$DW$1571, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$1571, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1571, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1571, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1571, DW_AT_decl_column(0x0b)

$C$DW$1572	.dwtag  DW_TAG_member
	.dwattr $C$DW$1572, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1572, DW_AT_name("f")
	.dwattr $C$DW$1572, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1572, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1572, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1572, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$1572, DW_AT_decl_column(0x0b)

$C$DW$1573	.dwtag  DW_TAG_member
	.dwattr $C$DW$1573, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1573, DW_AT_name("ijk")
	.dwattr $C$DW$1573, DW_AT_TI_symbol_name("ijk")
	.dwattr $C$DW$1573, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1573, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1573, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$1573, DW_AT_decl_column(0x0b)

$C$DW$1574	.dwtag  DW_TAG_member
	.dwattr $C$DW$1574, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1574, DW_AT_name("k")
	.dwattr $C$DW$1574, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$1574, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1574, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1574, DW_AT_decl_line(0x160)
	.dwattr $C$DW$1574, DW_AT_decl_column(0x0b)

$C$DW$1575	.dwtag  DW_TAG_member
	.dwattr $C$DW$1575, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1575, DW_AT_name("p")
	.dwattr $C$DW$1575, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1575, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1575, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1575, DW_AT_decl_line(0x161)
	.dwattr $C$DW$1575, DW_AT_decl_column(0x0b)

$C$DW$1576	.dwtag  DW_TAG_member
	.dwattr $C$DW$1576, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1576, DW_AT_name("q")
	.dwattr $C$DW$1576, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$1576, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1576, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1576, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1576, DW_AT_decl_column(0x0b)

$C$DW$1577	.dwtag  DW_TAG_member
	.dwattr $C$DW$1577, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1577, DW_AT_name("r")
	.dwattr $C$DW$1577, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$1577, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1577, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1577, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1577, DW_AT_decl_column(0x0b)

$C$DW$1578	.dwtag  DW_TAG_member
	.dwattr $C$DW$1578, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1578, DW_AT_name("s")
	.dwattr $C$DW$1578, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$1578, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1578, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1578, DW_AT_decl_line(0x164)
	.dwattr $C$DW$1578, DW_AT_decl_column(0x0b)

$C$DW$1579	.dwtag  DW_TAG_member
	.dwattr $C$DW$1579, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1579, DW_AT_name("xyz")
	.dwattr $C$DW$1579, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1579, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1579, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1579, DW_AT_decl_line(0x165)
	.dwattr $C$DW$1579, DW_AT_decl_column(0x0b)

$C$DW$1580	.dwtag  DW_TAG_member
	.dwattr $C$DW$1580, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1580, DW_AT_name("coord_data")
	.dwattr $C$DW$1580, DW_AT_TI_symbol_name("coord_data")
	.dwattr $C$DW$1580, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1580, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1580, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1580, DW_AT_decl_column(0x14)

$C$DW$1581	.dwtag  DW_TAG_member
	.dwattr $C$DW$1581, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1581, DW_AT_name("n")
	.dwattr $C$DW$1581, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$1581, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$1581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1581, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1581, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1581, DW_AT_decl_column(0x0d)

$C$DW$1582	.dwtag  DW_TAG_member
	.dwattr $C$DW$1582, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1582, DW_AT_name("h")
	.dwattr $C$DW$1582, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$1582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$1582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1582, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1582, DW_AT_decl_line(0x168)
	.dwattr $C$DW$1582, DW_AT_decl_column(0x0e)

$C$DW$1583	.dwtag  DW_TAG_member
	.dwattr $C$DW$1583, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1583, DW_AT_name("t")
	.dwattr $C$DW$1583, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$1583, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$1583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1583, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1583, DW_AT_decl_line(0x169)
	.dwattr $C$DW$1583, DW_AT_decl_column(0x0e)

$C$DW$1584	.dwtag  DW_TAG_member
	.dwattr $C$DW$1584, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1584, DW_AT_name("l")
	.dwattr $C$DW$1584, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$1584, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$1584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1584, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1584, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$1584, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$78, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$78

$C$DW$T$87	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$87, DW_AT_name("gc_values_t")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$87, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x03)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x04)
$C$DW$1585	.dwtag  DW_TAG_member
	.dwattr $C$DW$1585, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1585, DW_AT_name("e")
	.dwattr $C$DW$1585, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$1585, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$1585, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1585, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1585, DW_AT_decl_line(0x172)
	.dwattr $C$DW$1585, DW_AT_decl_column(0x12)

$C$DW$1586	.dwtag  DW_TAG_member
	.dwattr $C$DW$1586, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1586, DW_AT_name("f")
	.dwattr $C$DW$1586, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1586, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$1586, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1586, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1586, DW_AT_decl_line(0x173)
	.dwattr $C$DW$1586, DW_AT_decl_column(0x12)

$C$DW$1587	.dwtag  DW_TAG_member
	.dwattr $C$DW$1587, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1587, DW_AT_name("h")
	.dwattr $C$DW$1587, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$1587, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$1587, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1587, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1587, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1587, DW_AT_decl_column(0x12)

$C$DW$1588	.dwtag  DW_TAG_member
	.dwattr $C$DW$1588, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1588, DW_AT_name("i")
	.dwattr $C$DW$1588, DW_AT_TI_symbol_name("i")
	.dwattr $C$DW$1588, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$1588, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1588, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1588, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1588, DW_AT_decl_column(0x12)

$C$DW$1589	.dwtag  DW_TAG_member
	.dwattr $C$DW$1589, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1589, DW_AT_name("j")
	.dwattr $C$DW$1589, DW_AT_TI_symbol_name("j")
	.dwattr $C$DW$1589, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$1589, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1589, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1589, DW_AT_decl_line(0x176)
	.dwattr $C$DW$1589, DW_AT_decl_column(0x12)

$C$DW$1590	.dwtag  DW_TAG_member
	.dwattr $C$DW$1590, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1590, DW_AT_name("k")
	.dwattr $C$DW$1590, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$1590, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$1590, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1590, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1590, DW_AT_decl_line(0x177)
	.dwattr $C$DW$1590, DW_AT_decl_column(0x12)

$C$DW$1591	.dwtag  DW_TAG_member
	.dwattr $C$DW$1591, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1591, DW_AT_name("l")
	.dwattr $C$DW$1591, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$1591, DW_AT_bit_offset(0x19)
	.dwattr $C$DW$1591, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1591, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1591, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1591, DW_AT_decl_column(0x12)

$C$DW$1592	.dwtag  DW_TAG_member
	.dwattr $C$DW$1592, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1592, DW_AT_name("n")
	.dwattr $C$DW$1592, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$1592, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$1592, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1592, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1592, DW_AT_decl_line(0x179)
	.dwattr $C$DW$1592, DW_AT_decl_column(0x12)

$C$DW$1593	.dwtag  DW_TAG_member
	.dwattr $C$DW$1593, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1593, DW_AT_name("p")
	.dwattr $C$DW$1593, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1593, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$1593, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1593, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1593, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$1593, DW_AT_decl_column(0x12)

$C$DW$1594	.dwtag  DW_TAG_member
	.dwattr $C$DW$1594, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1594, DW_AT_name("r")
	.dwattr $C$DW$1594, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$1594, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$1594, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1594, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1594, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$1594, DW_AT_decl_column(0x12)

$C$DW$1595	.dwtag  DW_TAG_member
	.dwattr $C$DW$1595, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1595, DW_AT_name("s")
	.dwattr $C$DW$1595, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$1595, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$1595, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1595, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1595, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$1595, DW_AT_decl_column(0x12)

$C$DW$1596	.dwtag  DW_TAG_member
	.dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1596, DW_AT_name("t")
	.dwattr $C$DW$1596, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$1596, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$1596, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1596, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1596, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$1596, DW_AT_decl_column(0x12)

$C$DW$1597	.dwtag  DW_TAG_member
	.dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1597, DW_AT_name("x")
	.dwattr $C$DW$1597, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1597, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$1597, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1597, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1597, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$1597, DW_AT_decl_column(0x12)

$C$DW$1598	.dwtag  DW_TAG_member
	.dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1598, DW_AT_name("y")
	.dwattr $C$DW$1598, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1598, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$1598, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1598, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1598, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$1598, DW_AT_decl_column(0x12)

$C$DW$1599	.dwtag  DW_TAG_member
	.dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1599, DW_AT_name("z")
	.dwattr $C$DW$1599, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1599, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$1599, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1599, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1599, DW_AT_decl_line(0x180)
	.dwattr $C$DW$1599, DW_AT_decl_column(0x12)

$C$DW$1600	.dwtag  DW_TAG_member
	.dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1600, DW_AT_name("q")
	.dwattr $C$DW$1600, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$1600, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$1600, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1600, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1600, DW_AT_decl_line(0x181)
	.dwattr $C$DW$1600, DW_AT_decl_column(0x12)

$C$DW$1601	.dwtag  DW_TAG_member
	.dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1601, DW_AT_name("d")
	.dwattr $C$DW$1601, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$1601, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1601, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1601, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1601, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$1601, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$79, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x171)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$79


$C$DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x9a)
$C$DW$1602	.dwtag  DW_TAG_member
	.dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1602, DW_AT_name("non_modal_command")
	.dwattr $C$DW$1602, DW_AT_TI_symbol_name("non_modal_command")
	.dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1602, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1602, DW_AT_decl_line(0x20f)
	.dwattr $C$DW$1602, DW_AT_decl_column(0x11)

$C$DW$1603	.dwtag  DW_TAG_member
	.dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$1603, DW_AT_name("override_command")
	.dwattr $C$DW$1603, DW_AT_TI_symbol_name("override_command")
	.dwattr $C$DW$1603, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1603, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1603, DW_AT_decl_line(0x210)
	.dwattr $C$DW$1603, DW_AT_decl_column(0x15)

$C$DW$1604	.dwtag  DW_TAG_member
	.dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$1604, DW_AT_name("user_mcode")
	.dwattr $C$DW$1604, DW_AT_TI_symbol_name("user_mcode")
	.dwattr $C$DW$1604, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1604, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1604, DW_AT_decl_line(0x211)
	.dwattr $C$DW$1604, DW_AT_decl_column(0x12)

$C$DW$1605	.dwtag  DW_TAG_member
	.dwattr $C$DW$1605, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1605, DW_AT_name("user_mcode_sync")
	.dwattr $C$DW$1605, DW_AT_TI_symbol_name("user_mcode_sync")
	.dwattr $C$DW$1605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1605, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1605, DW_AT_decl_line(0x212)
	.dwattr $C$DW$1605, DW_AT_decl_column(0x0a)

$C$DW$1606	.dwtag  DW_TAG_member
	.dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$1606, DW_AT_name("modal")
	.dwattr $C$DW$1606, DW_AT_TI_symbol_name("modal")
	.dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1606, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1606, DW_AT_decl_line(0x213)
	.dwattr $C$DW$1606, DW_AT_decl_column(0x10)

$C$DW$1607	.dwtag  DW_TAG_member
	.dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$1607, DW_AT_name("values")
	.dwattr $C$DW$1607, DW_AT_TI_symbol_name("values")
	.dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1607, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1607, DW_AT_decl_line(0x214)
	.dwattr $C$DW$1607, DW_AT_decl_column(0x11)

$C$DW$1608	.dwtag  DW_TAG_member
	.dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$1608, DW_AT_name("words")
	.dwattr $C$DW$1608, DW_AT_TI_symbol_name("words")
	.dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1608, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1608, DW_AT_decl_line(0x215)
	.dwattr $C$DW$1608, DW_AT_decl_column(0x17)

$C$DW$1609	.dwtag  DW_TAG_member
	.dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1609, DW_AT_name("output_command")
	.dwattr $C$DW$1609, DW_AT_TI_symbol_name("output_command")
	.dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1609, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1609, DW_AT_decl_line(0x216)
	.dwattr $C$DW$1609, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x20e)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$89

$C$DW$T$497	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$497, DW_AT_name("parser_block_t")
	.dwattr $C$DW$T$497, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$497, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$497, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$497, DW_AT_decl_line(0x217)
	.dwattr $C$DW$T$497, DW_AT_decl_column(0x03)

$C$DW$T$498	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$498, DW_AT_type(*$C$DW$T$497)
	.dwattr $C$DW$T$498, DW_AT_address_class(0x14)


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x02)
$C$DW$1610	.dwtag  DW_TAG_member
	.dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1610, DW_AT_name("jog_motion")
	.dwattr $C$DW$1610, DW_AT_TI_symbol_name("jog_motion")
	.dwattr $C$DW$1610, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1610, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1610, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1610, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1610, DW_AT_decl_column(0x12)

$C$DW$1611	.dwtag  DW_TAG_member
	.dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1611, DW_AT_name("canned_cycle_change")
	.dwattr $C$DW$1611, DW_AT_TI_symbol_name("canned_cycle_change")
	.dwattr $C$DW$1611, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1611, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1611, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1611, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1611, DW_AT_decl_column(0x12)

$C$DW$1612	.dwtag  DW_TAG_member
	.dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1612, DW_AT_name("arc_is_clockwise")
	.dwattr $C$DW$1612, DW_AT_TI_symbol_name("arc_is_clockwise")
	.dwattr $C$DW$1612, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1612, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1612, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1612, DW_AT_decl_line(0x115)
	.dwattr $C$DW$1612, DW_AT_decl_column(0x12)

$C$DW$1613	.dwtag  DW_TAG_member
	.dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1613, DW_AT_name("probe_is_away")
	.dwattr $C$DW$1613, DW_AT_TI_symbol_name("probe_is_away")
	.dwattr $C$DW$1613, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1613, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1613, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1613, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1613, DW_AT_decl_column(0x12)

$C$DW$1614	.dwtag  DW_TAG_member
	.dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1614, DW_AT_name("probe_is_no_error")
	.dwattr $C$DW$1614, DW_AT_TI_symbol_name("probe_is_no_error")
	.dwattr $C$DW$1614, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1614, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1614, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1614, DW_AT_decl_line(0x117)
	.dwattr $C$DW$1614, DW_AT_decl_column(0x12)

$C$DW$1615	.dwtag  DW_TAG_member
	.dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1615, DW_AT_name("spindle_force_sync")
	.dwattr $C$DW$1615, DW_AT_TI_symbol_name("spindle_force_sync")
	.dwattr $C$DW$1615, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1615, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1615, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1615, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1615, DW_AT_decl_column(0x12)

$C$DW$1616	.dwtag  DW_TAG_member
	.dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1616, DW_AT_name("laser_disable")
	.dwattr $C$DW$1616, DW_AT_TI_symbol_name("laser_disable")
	.dwattr $C$DW$1616, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1616, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1616, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1616, DW_AT_decl_line(0x119)
	.dwattr $C$DW$1616, DW_AT_decl_column(0x12)

$C$DW$1617	.dwtag  DW_TAG_member
	.dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1617, DW_AT_name("laser_is_motion")
	.dwattr $C$DW$1617, DW_AT_TI_symbol_name("laser_is_motion")
	.dwattr $C$DW$1617, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1617, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1617, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1617, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1617, DW_AT_decl_column(0x12)

$C$DW$1618	.dwtag  DW_TAG_member
	.dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1618, DW_AT_name("set_coolant")
	.dwattr $C$DW$1618, DW_AT_TI_symbol_name("set_coolant")
	.dwattr $C$DW$1618, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1618, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1618, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1618, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$1618, DW_AT_decl_column(0x12)

$C$DW$1619	.dwtag  DW_TAG_member
	.dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1619, DW_AT_name("motion_mode_changed")
	.dwattr $C$DW$1619, DW_AT_TI_symbol_name("motion_mode_changed")
	.dwattr $C$DW$1619, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1619, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1619, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1619, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1619, DW_AT_decl_column(0x12)

$C$DW$1620	.dwtag  DW_TAG_member
	.dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1620, DW_AT_name("reserved")
	.dwattr $C$DW$1620, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$1620, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1620, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1620, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1620, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$1620, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$90


$C$DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x14)
$C$DW$1621	.dwtag  DW_TAG_member
	.dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1621, DW_AT_name("offset")
	.dwattr $C$DW$1621, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1621, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1621, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$1621, DW_AT_decl_column(0x0b)

$C$DW$1622	.dwtag  DW_TAG_member
	.dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1622, DW_AT_name("radius")
	.dwattr $C$DW$1622, DW_AT_TI_symbol_name("radius")
	.dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1622, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1622, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$1622, DW_AT_decl_column(0x0b)

$C$DW$1623	.dwtag  DW_TAG_member
	.dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1623, DW_AT_name("tool")
	.dwattr $C$DW$1623, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1623, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1623, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$1623, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$91, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$91, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$91

$C$DW$T$95	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$95, DW_AT_name("tool_data_t")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$95, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$95, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$T$95, DW_AT_decl_column(0x03)

$C$DW$T$96	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$96, DW_AT_address_class(0x14)


$C$DW$T$97	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$97, DW_AT_byte_size(0xa8)
$C$DW$1624	.dwtag  DW_TAG_member
	.dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$1624, DW_AT_name("modal")
	.dwattr $C$DW$1624, DW_AT_TI_symbol_name("modal")
	.dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1624, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1624, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1624, DW_AT_decl_column(0x10)

$C$DW$1625	.dwtag  DW_TAG_member
	.dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$1625, DW_AT_name("canned")
	.dwattr $C$DW$1625, DW_AT_TI_symbol_name("canned")
	.dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1625, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1625, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1625, DW_AT_decl_column(0x11)

$C$DW$1626	.dwtag  DW_TAG_member
	.dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1626, DW_AT_name("spindle")
	.dwattr $C$DW$1626, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1626, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1626, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1626, DW_AT_decl_column(0x0f)

$C$DW$1627	.dwtag  DW_TAG_member
	.dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1627, DW_AT_name("feed_rate")
	.dwattr $C$DW$1627, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1627, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1627, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1627, DW_AT_decl_column(0x0b)

$C$DW$1628	.dwtag  DW_TAG_member
	.dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1628, DW_AT_name("distance_per_rev")
	.dwattr $C$DW$1628, DW_AT_TI_symbol_name("distance_per_rev")
	.dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1628, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1628, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$1628, DW_AT_decl_column(0x0b)

$C$DW$1629	.dwtag  DW_TAG_member
	.dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1629, DW_AT_name("position")
	.dwattr $C$DW$1629, DW_AT_TI_symbol_name("position")
	.dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1629, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1629, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$1629, DW_AT_decl_column(0x0b)

$C$DW$1630	.dwtag  DW_TAG_member
	.dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1630, DW_AT_name("line_number")
	.dwattr $C$DW$1630, DW_AT_TI_symbol_name("line_number")
	.dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1630, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1630, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$1630, DW_AT_decl_column(0x0d)

$C$DW$1631	.dwtag  DW_TAG_member
	.dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1631, DW_AT_name("tool_pending")
	.dwattr $C$DW$1631, DW_AT_TI_symbol_name("tool_pending")
	.dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1631, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1631, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$1631, DW_AT_decl_column(0x0e)

$C$DW$1632	.dwtag  DW_TAG_member
	.dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1632, DW_AT_name("file_run")
	.dwattr $C$DW$1632, DW_AT_TI_symbol_name("file_run")
	.dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1632, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1632, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$1632, DW_AT_decl_column(0x0a)

$C$DW$1633	.dwtag  DW_TAG_member
	.dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1633, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$1633, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x85]
	.dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1633, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1633, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$1633, DW_AT_decl_column(0x0a)

$C$DW$1634	.dwtag  DW_TAG_member
	.dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1634, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1634, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1634, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1634, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$1634, DW_AT_decl_column(0x0a)

$C$DW$1635	.dwtag  DW_TAG_member
	.dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1635, DW_AT_name("tool_change")
	.dwattr $C$DW$1635, DW_AT_TI_symbol_name("tool_change")
	.dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
	.dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1635, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1635, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$1635, DW_AT_decl_column(0x0a)

$C$DW$1636	.dwtag  DW_TAG_member
	.dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$1636, DW_AT_name("last_error")
	.dwattr $C$DW$1636, DW_AT_TI_symbol_name("last_error")
	.dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1636, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1636, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$1636, DW_AT_decl_column(0x13)

$C$DW$1637	.dwtag  DW_TAG_member
	.dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1637, DW_AT_name("g92_coord_offset_applied")
	.dwattr $C$DW$1637, DW_AT_TI_symbol_name("g92_coord_offset_applied")
	.dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1637, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1637, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$1637, DW_AT_decl_column(0x0a)

$C$DW$1638	.dwtag  DW_TAG_member
	.dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1638, DW_AT_name("g92_coord_offset")
	.dwattr $C$DW$1638, DW_AT_TI_symbol_name("g92_coord_offset")
	.dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1638, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1638, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$1638, DW_AT_decl_column(0x0b)

$C$DW$1639	.dwtag  DW_TAG_member
	.dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1639, DW_AT_name("tool_length_offset")
	.dwattr $C$DW$1639, DW_AT_TI_symbol_name("tool_length_offset")
	.dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1639, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1639, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$1639, DW_AT_decl_column(0x0b)

$C$DW$1640	.dwtag  DW_TAG_member
	.dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$1640, DW_AT_name("tool")
	.dwattr $C$DW$1640, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1640, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1640, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$1640, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$97, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$97, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$T$97, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$97

$C$DW$T$400	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$400, DW_AT_name("parser_state_t")
	.dwattr $C$DW$T$400, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$400, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$400, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$400, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$T$400, DW_AT_decl_column(0x03)

$C$DW$T$401	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$401, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$T$401, DW_AT_address_class(0x14)


$C$DW$T$98	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x01)
$C$DW$1641	.dwtag  DW_TAG_member
	.dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1641, DW_AT_name("x")
	.dwattr $C$DW$1641, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1641, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1641, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1641, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1641, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1641, DW_AT_decl_column(0x11)

$C$DW$1642	.dwtag  DW_TAG_member
	.dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1642, DW_AT_name("y")
	.dwattr $C$DW$1642, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1642, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1642, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1642, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1642, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1642, DW_AT_decl_column(0x11)

$C$DW$1643	.dwtag  DW_TAG_member
	.dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1643, DW_AT_name("z")
	.dwattr $C$DW$1643, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1643, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1643, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1643, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1643, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1643, DW_AT_decl_column(0x11)

$C$DW$1644	.dwtag  DW_TAG_member
	.dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1644, DW_AT_name("a")
	.dwattr $C$DW$1644, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1644, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1644, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1644, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1644, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1644, DW_AT_decl_column(0x11)

$C$DW$1645	.dwtag  DW_TAG_member
	.dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1645, DW_AT_name("b")
	.dwattr $C$DW$1645, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$1645, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1645, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1645, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1645, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1645, DW_AT_decl_column(0x11)

$C$DW$1646	.dwtag  DW_TAG_member
	.dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1646, DW_AT_name("c")
	.dwattr $C$DW$1646, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$1646, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1646, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1646, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1646, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1646, DW_AT_decl_column(0x11)

$C$DW$1647	.dwtag  DW_TAG_member
	.dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1647, DW_AT_name("u")
	.dwattr $C$DW$1647, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$1647, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1647, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1647, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1647, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1647, DW_AT_decl_column(0x11)

$C$DW$1648	.dwtag  DW_TAG_member
	.dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1648, DW_AT_name("v")
	.dwattr $C$DW$1648, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$1648, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1648, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1648, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1648, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1648, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$98, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$98, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$98, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$98


$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x02)
$C$DW$1649	.dwtag  DW_TAG_member
	.dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1649, DW_AT_name("mpg_mode")
	.dwattr $C$DW$1649, DW_AT_TI_symbol_name("mpg_mode")
	.dwattr $C$DW$1649, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1649, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1649, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1649, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1649, DW_AT_decl_column(0x12)

$C$DW$1650	.dwtag  DW_TAG_member
	.dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1650, DW_AT_name("probe_succeeded")
	.dwattr $C$DW$1650, DW_AT_TI_symbol_name("probe_succeeded")
	.dwattr $C$DW$1650, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1650, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1650, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1650, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$1650, DW_AT_decl_column(0x12)

$C$DW$1651	.dwtag  DW_TAG_member
	.dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$33)
