;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed May 31 19:52:27 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../grbl/motion_control.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("gc_state")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("gc_state")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x202)
	.dwattr $C$DW$1, DW_AT_decl_column(0x17)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("sys")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("sys")
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$1048)

	.dwattr $C$DW$1664, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$1664, DW_AT_const_value(0x2d)
	.dwattr $C$DW$1664, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1664, DW_AT_decl_line(0x54)
	.dwattr $C$DW$1664, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$773, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$773, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$773, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$773

$C$DW$T$774	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$774, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$774, DW_AT_type(*$C$DW$T$773)
	.dwattr $C$DW$T$774, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$774, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$774, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$774, DW_AT_decl_column(0x03)


$C$DW$T$775	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$775, DW_AT_byte_size(0x02)
$C$DW$1665	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1665, DW_AT_name("Message_Plain")
	.dwattr $C$DW$1665, DW_AT_const_value(0x00)
	.dwattr $C$DW$1665, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1665, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1665, DW_AT_decl_column(0x05)

$C$DW$1666	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1666, DW_AT_name("Message_Info")
	.dwattr $C$DW$1666, DW_AT_const_value(0x01)
	.dwattr $C$DW$1666, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1666, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1666, DW_AT_decl_column(0x05)

$C$DW$1667	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1667, DW_AT_name("Message_Warning")
	.dwattr $C$DW$1667, DW_AT_const_value(0x02)
	.dwattr $C$DW$1667, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1667, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1667, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$775, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$775, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$775, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$775

$C$DW$T$776	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$776, DW_AT_name("message_type_t")
	.dwattr $C$DW$T$776, DW_AT_type(*$C$DW$T$775)
	.dwattr $C$DW$T$776, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$776, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$776, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$776, DW_AT_decl_column(0x03)


$C$DW$T$777	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$777, DW_AT_byte_size(0x02)
$C$DW$1668	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1668, DW_AT_name("SettingsFormat_MachineReadable")
	.dwattr $C$DW$1668, DW_AT_const_value(0x00)
	.dwattr $C$DW$1668, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1668, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1668, DW_AT_decl_column(0x05)

$C$DW$1669	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1669, DW_AT_name("SettingsFormat_HumanReadable")
	.dwattr $C$DW$1669, DW_AT_const_value(0x01)
	.dwattr $C$DW$1669, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1669, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1669, DW_AT_decl_column(0x05)

$C$DW$1670	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1670, DW_AT_name("SettingsFormat_Grbl")
	.dwattr $C$DW$1670, DW_AT_const_value(0x02)
	.dwattr $C$DW$1670, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1670, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1670, DW_AT_decl_column(0x05)

$C$DW$1671	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1671, DW_AT_name("SettingsFormat_grblHAL")
	.dwattr $C$DW$1671, DW_AT_const_value(0x03)
	.dwattr $C$DW$1671, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1671, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1671, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$777, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$777, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$777, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$777

$C$DW$T$778	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$778, DW_AT_name("settings_format_t")
	.dwattr $C$DW$T$778, DW_AT_type(*$C$DW$T$777)
	.dwattr $C$DW$T$778, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$778, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$778, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$778, DW_AT_decl_column(0x03)


$C$DW$T$779	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$779, DW_AT_byte_size(0x02)
$C$DW$1672	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1672, DW_AT_name("PullMode_None")
	.dwattr $C$DW$1672, DW_AT_const_value(0x00)
	.dwattr $C$DW$1672, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1672, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1672, DW_AT_decl_column(0x05)

$C$DW$1673	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1673, DW_AT_name("PullMode_Up")
	.dwattr $C$DW$1673, DW_AT_const_value(0x01)
	.dwattr $C$DW$1673, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1673, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1673, DW_AT_decl_column(0x05)

$C$DW$1674	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1674, DW_AT_name("PullMode_Down")
	.dwattr $C$DW$1674, DW_AT_const_value(0x02)
	.dwattr $C$DW$1674, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1674, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1674, DW_AT_decl_column(0x05)

$C$DW$1675	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1675, DW_AT_name("PullMode_UpDown")
	.dwattr $C$DW$1675, DW_AT_const_value(0x03)
	.dwattr $C$DW$1675, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1675, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1675, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$779, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$779, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$779, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$779

$C$DW$T$780	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$780, DW_AT_name("pull_mode_t")
	.dwattr $C$DW$T$780, DW_AT_type(*$C$DW$T$779)
	.dwattr $C$DW$T$780, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$780, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$780, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$780, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$1676	.dwtag  DW_TAG_member
	.dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1676, DW_AT_name("on")
	.dwattr $C$DW$1676, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$1676, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1676, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1676, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1676, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1676, DW_AT_decl_column(0x11)

$C$DW$1677	.dwtag  DW_TAG_member
	.dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1677, DW_AT_name("ccw")
	.dwattr $C$DW$1677, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$1677, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1677, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1677, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1677, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1677, DW_AT_decl_column(0x11)

$C$DW$1678	.dwtag  DW_TAG_member
	.dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1678, DW_AT_name("pwm")
	.dwattr $C$DW$1678, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$1678, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1678, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1678, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1678, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1678, DW_AT_decl_column(0x11)

$C$DW$1679	.dwtag  DW_TAG_member
	.dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1679, DW_AT_name("reserved3")
	.dwattr $C$DW$1679, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$1679, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1679, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1679, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1679, DW_AT_decl_line(0x22)
	.dwattr $C$DW$1679, DW_AT_decl_column(0x11)

$C$DW$1680	.dwtag  DW_TAG_member
	.dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1680, DW_AT_name("reserved4")
	.dwattr $C$DW$1680, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$1680, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1680, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1680, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1680, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1680, DW_AT_decl_column(0x11)

$C$DW$1681	.dwtag  DW_TAG_member
	.dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1681, DW_AT_name("encoder_error")
	.dwattr $C$DW$1681, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$1681, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1681, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1681, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1681, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1681, DW_AT_decl_column(0x11)

$C$DW$1682	.dwtag  DW_TAG_member
	.dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1682, DW_AT_name("at_speed")
	.dwattr $C$DW$1682, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$1682, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1682, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1682, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1682, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1682, DW_AT_decl_column(0x11)

$C$DW$1683	.dwtag  DW_TAG_member
	.dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1683, DW_AT_name("synchronized")
	.dwattr $C$DW$1683, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$1683, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1683, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1683, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1683, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1683, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$24


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
$C$DW$1684	.dwtag  DW_TAG_member
	.dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1684, DW_AT_name("surface_speed")
	.dwattr $C$DW$1684, DW_AT_TI_symbol_name("surface_speed")
	.dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1684, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1684, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$1684, DW_AT_decl_column(0x0b)

$C$DW$1685	.dwtag  DW_TAG_member
	.dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1685, DW_AT_name("target_rpm")
	.dwattr $C$DW$1685, DW_AT_TI_symbol_name("target_rpm")
	.dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1685, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1685, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$1685, DW_AT_decl_column(0x0b)

$C$DW$1686	.dwtag  DW_TAG_member
	.dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1686, DW_AT_name("max_rpm")
	.dwattr $C$DW$1686, DW_AT_TI_symbol_name("max_rpm")
	.dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1686, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1686, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$1686, DW_AT_decl_column(0x0b)

$C$DW$1687	.dwtag  DW_TAG_member
	.dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1687, DW_AT_name("tool_offset")
	.dwattr $C$DW$1687, DW_AT_TI_symbol_name("tool_offset")
	.dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1687, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1687, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$1687, DW_AT_decl_column(0x0b)

$C$DW$1688	.dwtag  DW_TAG_member
	.dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$1688, DW_AT_name("axis")
	.dwattr $C$DW$1688, DW_AT_TI_symbol_name("axis")
	.dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1688, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1688, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$1688, DW_AT_decl_column(0x12)

$C$DW$1689	.dwtag  DW_TAG_member
	.dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1689, DW_AT_name("active")
	.dwattr $C$DW$1689, DW_AT_TI_symbol_name("active")
	.dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1689, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1689, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$1689, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$29, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$29

$C$DW$T$30	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$30, DW_AT_name("css_data_t")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x03)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x18)
$C$DW$1690	.dwtag  DW_TAG_member
	.dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1690, DW_AT_name("rpm")
	.dwattr $C$DW$1690, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1690, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1690, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$1690, DW_AT_decl_column(0x0b)

$C$DW$1691	.dwtag  DW_TAG_member
	.dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1691, DW_AT_name("css")
	.dwattr $C$DW$1691, DW_AT_TI_symbol_name("css")
	.dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1691, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1691, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$1691, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

$C$DW$T$38	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$38, DW_AT_name("spindle_t")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x03)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
$C$DW$1692	.dwtag  DW_TAG_member
	.dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1692, DW_AT_name("flood")
	.dwattr $C$DW$1692, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$1692, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1692, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1692, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1692, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$1692, DW_AT_decl_column(0x11)

$C$DW$1693	.dwtag  DW_TAG_member
	.dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1693, DW_AT_name("mist")
	.dwattr $C$DW$1693, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$1693, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1693, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1693, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1693, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$1693, DW_AT_decl_column(0x11)

$C$DW$1694	.dwtag  DW_TAG_member
	.dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1694, DW_AT_name("shower")
	.dwattr $C$DW$1694, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$1694, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1694, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1694, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1694, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1694, DW_AT_decl_column(0x11)

$C$DW$1695	.dwtag  DW_TAG_member
	.dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1695, DW_AT_name("trough_spindle")
	.dwattr $C$DW$1695, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$1695, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1695, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1695, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1695, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1695, DW_AT_decl_column(0x11)

$C$DW$1696	.dwtag  DW_TAG_member
	.dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1696, DW_AT_name("unused")
	.dwattr $C$DW$1696, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$1696, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1696, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1696, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1696, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1696, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$32


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
$C$DW$1697	.dwtag  DW_TAG_member
	.dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1697, DW_AT_name("rapid_motion")
	.dwattr $C$DW$1697, DW_AT_TI_symbol_name("rapid_motion")
	.dwattr $C$DW$1697, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1697, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1697, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1697, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1697, DW_AT_decl_column(0x12)

$C$DW$1698	.dwtag  DW_TAG_member
	.dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1698, DW_AT_name("system_motion")
	.dwattr $C$DW$1698, DW_AT_TI_symbol_name("system_motion")
	.dwattr $C$DW$1698, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1698, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1698, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1698, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1698, DW_AT_decl_column(0x12)

$C$DW$1699	.dwtag  DW_TAG_member
	.dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1699, DW_AT_name("jog_motion")
	.dwattr $C$DW$1699, DW_AT_TI_symbol_name("jog_motion")
	.dwattr $C$DW$1699, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1699, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1699, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1699, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1699, DW_AT_decl_column(0x12)

$C$DW$1700	.dwtag  DW_TAG_member
	.dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1700, DW_AT_name("backlash_motion")
	.dwattr $C$DW$1700, DW_AT_TI_symbol_name("backlash_motion")
	.dwattr $C$DW$1700, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1700, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1700, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1700, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1700, DW_AT_decl_column(0x12)

$C$DW$1701	.dwtag  DW_TAG_member
	.dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1701, DW_AT_name("no_feed_override")
	.dwattr $C$DW$1701, DW_AT_TI_symbol_name("no_feed_override")
	.dwattr $C$DW$1701, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1701, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1701, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1701, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1701, DW_AT_decl_column(0x12)

$C$DW$1702	.dwtag  DW_TAG_member
	.dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1702, DW_AT_name("inverse_time")
	.dwattr $C$DW$1702, DW_AT_TI_symbol_name("inverse_time")
	.dwattr $C$DW$1702, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1702, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1702, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1702, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1702, DW_AT_decl_column(0x12)

$C$DW$1703	.dwtag  DW_TAG_member
	.dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1703, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1703, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1703, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1703, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1703, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1703, DW_AT_decl_line(0x29)
	.dwattr $C$DW$1703, DW_AT_decl_column(0x12)

$C$DW$1704	.dwtag  DW_TAG_member
	.dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1704, DW_AT_name("is_rpm_pos_adjusted")
	.dwattr $C$DW$1704, DW_AT_TI_symbol_name("is_rpm_pos_adjusted")
	.dwattr $C$DW$1704, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1704, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1704, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1704, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$1704, DW_AT_decl_column(0x12)

$C$DW$1705	.dwtag  DW_TAG_member
	.dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1705, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$1705, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$1705, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1705, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1705, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1705, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$1705, DW_AT_decl_column(0x12)

$C$DW$1706	.dwtag  DW_TAG_member
	.dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1706, DW_AT_name("unassigned")
	.dwattr $C$DW$1706, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1706, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1706, DW_AT_bit_size(0x07)
	.dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1706, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1706, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1706, DW_AT_decl_column(0x12)

$C$DW$1707	.dwtag  DW_TAG_member
	.dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$1707, DW_AT_name("spindle")
	.dwattr $C$DW$1707, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1707, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1707, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1707, DW_AT_decl_column(0x19)

$C$DW$1708	.dwtag  DW_TAG_member
	.dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1708, DW_AT_name("coolant")
	.dwattr $C$DW$1708, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1708, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1708, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1708, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$36, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$36


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$1709	.dwtag  DW_TAG_member
	.dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1709, DW_AT_name("feed_rate_disable")
	.dwattr $C$DW$1709, DW_AT_TI_symbol_name("feed_rate_disable")
	.dwattr $C$DW$1709, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1709, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1709, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1709, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1709, DW_AT_decl_column(0x11)

$C$DW$1710	.dwtag  DW_TAG_member
	.dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1710, DW_AT_name("feed_hold_disable")
	.dwattr $C$DW$1710, DW_AT_TI_symbol_name("feed_hold_disable")
	.dwattr $C$DW$1710, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1710, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1710, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1710, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1710, DW_AT_decl_column(0x11)

$C$DW$1711	.dwtag  DW_TAG_member
	.dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1711, DW_AT_name("spindle_rpm_disable")
	.dwattr $C$DW$1711, DW_AT_TI_symbol_name("spindle_rpm_disable")
	.dwattr $C$DW$1711, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1711, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1711, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1711, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1711, DW_AT_decl_column(0x11)

$C$DW$1712	.dwtag  DW_TAG_member
	.dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1712, DW_AT_name("parking_disable")
	.dwattr $C$DW$1712, DW_AT_TI_symbol_name("parking_disable")
	.dwattr $C$DW$1712, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1712, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1712, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1712, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1712, DW_AT_decl_column(0x11)

$C$DW$1713	.dwtag  DW_TAG_member
	.dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1713, DW_AT_name("reserved")
	.dwattr $C$DW$1713, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$1713, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1713, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1713, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1713, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1713, DW_AT_decl_column(0x11)

$C$DW$1714	.dwtag  DW_TAG_member
	.dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1714, DW_AT_name("sync")
	.dwattr $C$DW$1714, DW_AT_TI_symbol_name("sync")
	.dwattr $C$DW$1714, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1714, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1714, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1714, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1714, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$37, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$37


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x2e)
$C$DW$1715	.dwtag  DW_TAG_member
	.dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1715, DW_AT_name("feed_rate")
	.dwattr $C$DW$1715, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1715, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1715, DW_AT_decl_line(0x59)
	.dwattr $C$DW$1715, DW_AT_decl_column(0x0b)

$C$DW$1716	.dwtag  DW_TAG_member
	.dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1716, DW_AT_name("spindle")
	.dwattr $C$DW$1716, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1716, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1716, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1716, DW_AT_decl_column(0x0f)

$C$DW$1717	.dwtag  DW_TAG_member
	.dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1717, DW_AT_name("condition")
	.dwattr $C$DW$1717, DW_AT_TI_symbol_name("condition")
	.dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1717, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1717, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$1717, DW_AT_decl_column(0x14)

$C$DW$1718	.dwtag  DW_TAG_member
	.dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$1718, DW_AT_name("overrides")
	.dwattr $C$DW$1718, DW_AT_TI_symbol_name("overrides")
	.dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1718, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1718, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$1718, DW_AT_decl_column(0x19)

$C$DW$1719	.dwtag  DW_TAG_member
	.dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1719, DW_AT_name("line_number")
	.dwattr $C$DW$1719, DW_AT_TI_symbol_name("line_number")
	.dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1719, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1719, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1719, DW_AT_decl_column(0x0d)

$C$DW$1720	.dwtag  DW_TAG_member
	.dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1720, DW_AT_name("message")
	.dwattr $C$DW$1720, DW_AT_TI_symbol_name("message")
	.dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1720, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1720, DW_AT_decl_line(0x60)
	.dwattr $C$DW$1720, DW_AT_decl_column(0x0b)

$C$DW$1721	.dwtag  DW_TAG_member
	.dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1721, DW_AT_name("output_commands")
	.dwattr $C$DW$1721, DW_AT_TI_symbol_name("output_commands")
	.dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1721, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1721, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1721, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$47

$C$DW$T$259	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$259, DW_AT_name("plan_line_data_t")
	.dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$259, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$259, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$T$259, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$259, DW_AT_decl_column(0x03)

$C$DW$T$260	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$260, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$T$260, DW_AT_address_class(0x14)


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$1722	.dwtag  DW_TAG_member
	.dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1722, DW_AT_name("x")
	.dwattr $C$DW$1722, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1722, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1722, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1722, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1722, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1722, DW_AT_decl_column(0x11)

$C$DW$1723	.dwtag  DW_TAG_member
	.dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1723, DW_AT_name("y")
	.dwattr $C$DW$1723, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1723, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1723, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1723, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1723, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1723, DW_AT_decl_column(0x11)

$C$DW$1724	.dwtag  DW_TAG_member
	.dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1724, DW_AT_name("z")
	.dwattr $C$DW$1724, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1724, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1724, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1724, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1724, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1724, DW_AT_decl_column(0x11)

$C$DW$1725	.dwtag  DW_TAG_member
	.dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1725, DW_AT_name("a")
	.dwattr $C$DW$1725, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1725, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1725, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1725, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1725, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1725, DW_AT_decl_column(0x11)

$C$DW$1726	.dwtag  DW_TAG_member
	.dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1726, DW_AT_name("b")
	.dwattr $C$DW$1726, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$1726, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1726, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1726, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1726, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1726, DW_AT_decl_column(0x11)

$C$DW$1727	.dwtag  DW_TAG_member
	.dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1727, DW_AT_name("c")
	.dwattr $C$DW$1727, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$1727, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1727, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1727, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1727, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1727, DW_AT_decl_column(0x11)

$C$DW$1728	.dwtag  DW_TAG_member
	.dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1728, DW_AT_name("u")
	.dwattr $C$DW$1728, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$1728, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1728, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1728, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1728, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1728, DW_AT_decl_column(0x11)

$C$DW$1729	.dwtag  DW_TAG_member
	.dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1729, DW_AT_name("v")
	.dwattr $C$DW$1729, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$1729, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1729, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1729, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1729, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1729, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$48


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
$C$DW$1730	.dwtag  DW_TAG_member
	.dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1730, DW_AT_name("min")
	.dwattr $C$DW$1730, DW_AT_TI_symbol_name("min")
	.dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1730, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1730, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1730, DW_AT_decl_column(0x14)

$C$DW$1731	.dwtag  DW_TAG_member
	.dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1731, DW_AT_name("max")
	.dwattr $C$DW$1731, DW_AT_TI_symbol_name("max")
	.dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1731, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1731, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1731, DW_AT_decl_column(0x14)

$C$DW$1732	.dwtag  DW_TAG_member
	.dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1732, DW_AT_name("min2")
	.dwattr $C$DW$1732, DW_AT_TI_symbol_name("min2")
	.dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1732, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1732, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$1732, DW_AT_decl_column(0x14)

$C$DW$1733	.dwtag  DW_TAG_member
	.dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1733, DW_AT_name("max2")
	.dwattr $C$DW$1733, DW_AT_TI_symbol_name("max2")
	.dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1733, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1733, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1733, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$50, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$50

$C$DW$T$109	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$109, DW_AT_name("limit_signals_t")
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$109, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x03)


$C$DW$T$280	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$280, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$280, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$280

$C$DW$T$281	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$281, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$T$281, DW_AT_address_class(0x14)

$C$DW$T$282	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$282, DW_AT_name("limits_get_state_ptr")
	.dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$281)
	.dwattr $C$DW$T$282, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$282, DW_AT_decl_file("..\grbl\hal.h")
	.dwattr $C$DW$T$282, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$282, DW_AT_decl_column(0x1b)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x03)
$C$DW$1734	.dwtag  DW_TAG_member
	.dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1734, DW_AT_name("axis_0")
	.dwattr $C$DW$1734, DW_AT_TI_symbol_name("axis_0")
	.dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1734, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1734, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$1734, DW_AT_decl_column(0x0d)

$C$DW$1735	.dwtag  DW_TAG_member
	.dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1735, DW_AT_name("axis_1")
	.dwattr $C$DW$1735, DW_AT_TI_symbol_name("axis_1")
	.dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1735, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1735, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1735, DW_AT_decl_column(0x0d)

$C$DW$1736	.dwtag  DW_TAG_member
	.dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1736, DW_AT_name("axis_linear")
	.dwattr $C$DW$1736, DW_AT_TI_symbol_name("axis_linear")
	.dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1736, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1736, DW_AT_decl_line(0x151)
	.dwattr $C$DW$1736, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$51

$C$DW$T$786	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$786, DW_AT_name("plane_t")
	.dwattr $C$DW$T$786, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$786, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$786, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$786, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$786, DW_AT_decl_column(0x03)

$C$DW$T$787	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$787, DW_AT_type(*$C$DW$T$786)
	.dwattr $C$DW$T$787, DW_AT_address_class(0x14)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x22)
$C$DW$1737	.dwtag  DW_TAG_member
	.dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1737, DW_AT_name("xyz")
	.dwattr $C$DW$1737, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1737, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1737, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$1737, DW_AT_decl_column(0x0b)

$C$DW$1738	.dwtag  DW_TAG_member
	.dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1738, DW_AT_name("delta")
	.dwattr $C$DW$1738, DW_AT_TI_symbol_name("delta")
	.dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1738, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1738, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$1738, DW_AT_decl_column(0x0b)

$C$DW$1739	.dwtag  DW_TAG_member
	.dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1739, DW_AT_name("dwell")
	.dwattr $C$DW$1739, DW_AT_TI_symbol_name("dwell")
	.dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1739, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1739, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$1739, DW_AT_decl_column(0x0b)

$C$DW$1740	.dwtag  DW_TAG_member
	.dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1740, DW_AT_name("prev_position")
	.dwattr $C$DW$1740, DW_AT_TI_symbol_name("prev_position")
	.dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1740, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1740, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$1740, DW_AT_decl_column(0x0b)

$C$DW$1741	.dwtag  DW_TAG_member
	.dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1741, DW_AT_name("retract_position")
	.dwattr $C$DW$1741, DW_AT_TI_symbol_name("retract_position")
	.dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1741, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1741, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$1741, DW_AT_decl_column(0x0b)

$C$DW$1742	.dwtag  DW_TAG_member
	.dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1742, DW_AT_name("rapid_retract")
	.dwattr $C$DW$1742, DW_AT_TI_symbol_name("rapid_retract")
	.dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1742, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1742, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$1742, DW_AT_decl_column(0x0a)

$C$DW$1743	.dwtag  DW_TAG_member
	.dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1743, DW_AT_name("spindle_off")
	.dwattr $C$DW$1743, DW_AT_TI_symbol_name("spindle_off")
	.dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1743, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1743, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$1743, DW_AT_decl_column(0x0a)

$C$DW$1744	.dwtag  DW_TAG_member
	.dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1744, DW_AT_name("retract_mode")
	.dwattr $C$DW$1744, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1744, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1744, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$1744, DW_AT_decl_column(0x17)

$C$DW$1745	.dwtag  DW_TAG_member
	.dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1745, DW_AT_name("change")
	.dwattr $C$DW$1745, DW_AT_TI_symbol_name("change")
	.dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1745, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1745, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1745, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$55

$C$DW$T$95	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$95, DW_AT_name("gc_canned_t")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$95, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$95, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$T$95, DW_AT_decl_column(0x03)

$C$DW$T$789	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$789, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$789, DW_AT_address_class(0x14)


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x2c)
$C$DW$1746	.dwtag  DW_TAG_member
	.dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1746, DW_AT_name("pitch")
	.dwattr $C$DW$1746, DW_AT_TI_symbol_name("pitch")
	.dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1746, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1746, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$1746, DW_AT_decl_column(0x0b)

$C$DW$1747	.dwtag  DW_TAG_member
	.dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1747, DW_AT_name("z_final")
	.dwattr $C$DW$1747, DW_AT_TI_symbol_name("z_final")
	.dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1747, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1747, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$1747, DW_AT_decl_column(0x0b)

$C$DW$1748	.dwtag  DW_TAG_member
	.dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1748, DW_AT_name("peak")
	.dwattr $C$DW$1748, DW_AT_TI_symbol_name("peak")
	.dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1748, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1748, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$1748, DW_AT_decl_column(0x0b)

$C$DW$1749	.dwtag  DW_TAG_member
	.dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1749, DW_AT_name("initial_depth")
	.dwattr $C$DW$1749, DW_AT_TI_symbol_name("initial_depth")
	.dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1749, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1749, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$1749, DW_AT_decl_column(0x0b)

$C$DW$1750	.dwtag  DW_TAG_member
	.dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1750, DW_AT_name("depth")
	.dwattr $C$DW$1750, DW_AT_TI_symbol_name("depth")
	.dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1750, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1750, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$1750, DW_AT_decl_column(0x0b)

$C$DW$1751	.dwtag  DW_TAG_member
	.dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1751, DW_AT_name("depth_degression")
	.dwattr $C$DW$1751, DW_AT_TI_symbol_name("depth_degression")
	.dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1751, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1751, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$1751, DW_AT_decl_column(0x0b)

$C$DW$1752	.dwtag  DW_TAG_member
	.dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1752, DW_AT_name("main_taper_height")
	.dwattr $C$DW$1752, DW_AT_TI_symbol_name("main_taper_height")
	.dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1752, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1752, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$1752, DW_AT_decl_column(0x0b)

$C$DW$1753	.dwtag  DW_TAG_member
	.dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1753, DW_AT_name("end_taper_length")
	.dwattr $C$DW$1753, DW_AT_TI_symbol_name("end_taper_length")
	.dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1753, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1753, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$1753, DW_AT_decl_column(0x0b)

$C$DW$1754	.dwtag  DW_TAG_member
	.dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1754, DW_AT_name("infeed_angle")
	.dwattr $C$DW$1754, DW_AT_TI_symbol_name("infeed_angle")
	.dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1754, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1754, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$1754, DW_AT_decl_column(0x0b)

$C$DW$1755	.dwtag  DW_TAG_member
	.dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1755, DW_AT_name("cut_direction")
	.dwattr $C$DW$1755, DW_AT_TI_symbol_name("cut_direction")
	.dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1755, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1755, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$1755, DW_AT_decl_column(0x0b)

$C$DW$1756	.dwtag  DW_TAG_member
	.dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1756, DW_AT_name("spring_passes")
	.dwattr $C$DW$1756, DW_AT_TI_symbol_name("spring_passes")
	.dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1756, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1756, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1756, DW_AT_decl_column(0x13)

$C$DW$1757	.dwtag  DW_TAG_member
	.dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$1757, DW_AT_name("end_taper_type")
	.dwattr $C$DW$1757, DW_AT_TI_symbol_name("end_taper_type")
	.dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1757, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1757, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$1757, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$60

$C$DW$T$791	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$791, DW_AT_name("gc_thread_data")
	.dwattr $C$DW$T$791, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$791, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$791, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$791, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$T$791, DW_AT_decl_column(0x03)

$C$DW$T$792	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$792, DW_AT_type(*$C$DW$T$791)
	.dwattr $C$DW$T$792, DW_AT_address_class(0x14)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x0e)
$C$DW$1758	.dwtag  DW_TAG_member
	.dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1758, DW_AT_name("xyz")
	.dwattr $C$DW$1758, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1758, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1758, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1758, DW_AT_decl_column(0x0b)

$C$DW$1759	.dwtag  DW_TAG_member
	.dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$1759, DW_AT_name("id")
	.dwattr $C$DW$1759, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1759, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1759, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1759, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$63

$C$DW$T$72	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$72, DW_AT_name("coord_system_t")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$72, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x03)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x2e)
$C$DW$1760	.dwtag  DW_TAG_member
	.dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$1760, DW_AT_name("motion")
	.dwattr $C$DW$1760, DW_AT_TI_symbol_name("motion")
	.dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1760, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1760, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1760, DW_AT_decl_column(0x13)

$C$DW$1761	.dwtag  DW_TAG_member
	.dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1761, DW_AT_name("feed_mode")
	.dwattr $C$DW$1761, DW_AT_TI_symbol_name("feed_mode")
	.dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1761, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1761, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1761, DW_AT_decl_column(0x11)

$C$DW$1762	.dwtag  DW_TAG_member
	.dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1762, DW_AT_name("units_imperial")
	.dwattr $C$DW$1762, DW_AT_TI_symbol_name("units_imperial")
	.dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1762, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1762, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1762, DW_AT_decl_column(0x0a)

$C$DW$1763	.dwtag  DW_TAG_member
	.dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1763, DW_AT_name("distance_incremental")
	.dwattr $C$DW$1763, DW_AT_TI_symbol_name("distance_incremental")
	.dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1763, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1763, DW_AT_decl_line(0x194)
	.dwattr $C$DW$1763, DW_AT_decl_column(0x0a)

$C$DW$1764	.dwtag  DW_TAG_member
	.dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1764, DW_AT_name("diameter_mode")
	.dwattr $C$DW$1764, DW_AT_TI_symbol_name("diameter_mode")
	.dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1764, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1764, DW_AT_decl_line(0x195)
	.dwattr $C$DW$1764, DW_AT_decl_column(0x0a)

$C$DW$1765	.dwtag  DW_TAG_member
	.dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1765, DW_AT_name("plane_select")
	.dwattr $C$DW$1765, DW_AT_TI_symbol_name("plane_select")
	.dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1765, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1765, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1765, DW_AT_decl_column(0x14)

$C$DW$1766	.dwtag  DW_TAG_member
	.dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1766, DW_AT_name("tool_offset_mode")
	.dwattr $C$DW$1766, DW_AT_TI_symbol_name("tool_offset_mode")
	.dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1766, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1766, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1766, DW_AT_decl_column(0x18)

$C$DW$1767	.dwtag  DW_TAG_member
	.dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$1767, DW_AT_name("coord_system")
	.dwattr $C$DW$1767, DW_AT_TI_symbol_name("coord_system")
	.dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1767, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1767, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$1767, DW_AT_decl_column(0x14)

$C$DW$1768	.dwtag  DW_TAG_member
	.dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$1768, DW_AT_name("program_flow")
	.dwattr $C$DW$1768, DW_AT_TI_symbol_name("program_flow")
	.dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1768, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1768, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1768, DW_AT_decl_column(0x14)

$C$DW$1769	.dwtag  DW_TAG_member
	.dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1769, DW_AT_name("coolant")
	.dwattr $C$DW$1769, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1769, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1769, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1769, DW_AT_decl_column(0x15)

$C$DW$1770	.dwtag  DW_TAG_member
	.dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$1770, DW_AT_name("spindle")
	.dwattr $C$DW$1770, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1770, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1770, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1770, DW_AT_decl_column(0x15)

$C$DW$1771	.dwtag  DW_TAG_member
	.dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$1771, DW_AT_name("override_ctrl")
	.dwattr $C$DW$1771, DW_AT_TI_symbol_name("override_ctrl")
	.dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1771, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1771, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1771, DW_AT_decl_column(0x19)

$C$DW$1772	.dwtag  DW_TAG_member
	.dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$1772, DW_AT_name("spindle_rpm_mode")
	.dwattr $C$DW$1772, DW_AT_TI_symbol_name("spindle_rpm_mode")
	.dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1772, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1772, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$1772, DW_AT_decl_column(0x18)

$C$DW$1773	.dwtag  DW_TAG_member
	.dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1773, DW_AT_name("retract_mode")
	.dwattr $C$DW$1773, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1773, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1773, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$1773, DW_AT_decl_column(0x17)

$C$DW$1774	.dwtag  DW_TAG_member
	.dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1774, DW_AT_name("scaling_active")
	.dwattr $C$DW$1774, DW_AT_TI_symbol_name("scaling_active")
	.dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1774, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1774, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$1774, DW_AT_decl_column(0x0a)

$C$DW$1775	.dwtag  DW_TAG_member
	.dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1775, DW_AT_name("canned_cycle_active")
	.dwattr $C$DW$1775, DW_AT_TI_symbol_name("canned_cycle_active")
	.dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1775, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1775, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$1775, DW_AT_decl_column(0x0a)

$C$DW$1776	.dwtag  DW_TAG_member
	.dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$1776, DW_AT_name("spline_pq")
	.dwattr $C$DW$1776, DW_AT_TI_symbol_name("spline_pq")
	.dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1776, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1776, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$1776, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$78, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$78

$C$DW$T$89	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$89, DW_AT_name("gc_modal_t")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x03)


$C$DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x54)
$C$DW$1777	.dwtag  DW_TAG_member
	.dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1777, DW_AT_name("d")
	.dwattr $C$DW$1777, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1777, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1777, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1777, DW_AT_decl_column(0x0b)

$C$DW$1778	.dwtag  DW_TAG_member
	.dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1778, DW_AT_name("e")
	.dwattr $C$DW$1778, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1778, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1778, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1778, DW_AT_decl_column(0x0b)

$C$DW$1779	.dwtag  DW_TAG_member
	.dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1779, DW_AT_name("f")
	.dwattr $C$DW$1779, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1779, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1779, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$1779, DW_AT_decl_column(0x0b)

$C$DW$1780	.dwtag  DW_TAG_member
	.dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1780, DW_AT_name("ijk")
	.dwattr $C$DW$1780, DW_AT_TI_symbol_name("ijk")
	.dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1780, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1780, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$1780, DW_AT_decl_column(0x0b)

$C$DW$1781	.dwtag  DW_TAG_member
	.dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1781, DW_AT_name("k")
	.dwattr $C$DW$1781, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1781, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1781, DW_AT_decl_line(0x160)
	.dwattr $C$DW$1781, DW_AT_decl_column(0x0b)

$C$DW$1782	.dwtag  DW_TAG_member
	.dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1782, DW_AT_name("p")
	.dwattr $C$DW$1782, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1782, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1782, DW_AT_decl_line(0x161)
	.dwattr $C$DW$1782, DW_AT_decl_column(0x0b)

$C$DW$1783	.dwtag  DW_TAG_member
	.dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1783, DW_AT_name("q")
	.dwattr $C$DW$1783, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1783, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1783, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1783, DW_AT_decl_column(0x0b)

$C$DW$1784	.dwtag  DW_TAG_member
	.dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1784, DW_AT_name("r")
	.dwattr $C$DW$1784, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1784, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1784, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1784, DW_AT_decl_column(0x0b)

$C$DW$1785	.dwtag  DW_TAG_member
	.dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1785, DW_AT_name("s")
	.dwattr $C$DW$1785, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1785, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1785, DW_AT_decl_line(0x164)
	.dwattr $C$DW$1785, DW_AT_decl_column(0x0b)

$C$DW$1786	.dwtag  DW_TAG_member
	.dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1786, DW_AT_name("xyz")
	.dwattr $C$DW$1786, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1786, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1786, DW_AT_decl_line(0x165)
	.dwattr $C$DW$1786, DW_AT_decl_column(0x0b)

$C$DW$1787	.dwtag  DW_TAG_member
	.dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$1787, DW_AT_name("coord_data")
	.dwattr $C$DW$1787, DW_AT_TI_symbol_name("coord_data")
	.dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1787, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1787, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1787, DW_AT_decl_column(0x14)

$C$DW$1788	.dwtag  DW_TAG_member
	.dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1788, DW_AT_name("n")
	.dwattr $C$DW$1788, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1788, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1788, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1788, DW_AT_decl_column(0x0d)

$C$DW$1789	.dwtag  DW_TAG_member
	.dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1789, DW_AT_name("h")
	.dwattr $C$DW$1789, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1789, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1789, DW_AT_decl_line(0x168)
	.dwattr $C$DW$1789, DW_AT_decl_column(0x0e)

$C$DW$1790	.dwtag  DW_TAG_member
	.dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1790, DW_AT_name("t")
	.dwattr $C$DW$1790, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1790, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1790, DW_AT_decl_line(0x169)
	.dwattr $C$DW$1790, DW_AT_decl_column(0x0e)

$C$DW$1791	.dwtag  DW_TAG_member
	.dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1791, DW_AT_name("l")
	.dwattr $C$DW$1791, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1791, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1791, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$1791, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$81, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$81, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$T$81, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$81

$C$DW$T$90	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$90, DW_AT_name("gc_values_t")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x03)


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x04)
$C$DW$1792	.dwtag  DW_TAG_member
	.dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1792, DW_AT_name("e")
	.dwattr $C$DW$1792, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$1792, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$1792, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1792, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1792, DW_AT_decl_line(0x172)
	.dwattr $C$DW$1792, DW_AT_decl_column(0x12)

$C$DW$1793	.dwtag  DW_TAG_member
	.dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1793, DW_AT_name("f")
	.dwattr $C$DW$1793, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1793, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$1793, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1793, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1793, DW_AT_decl_line(0x173)
	.dwattr $C$DW$1793, DW_AT_decl_column(0x12)

$C$DW$1794	.dwtag  DW_TAG_member
	.dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1794, DW_AT_name("h")
	.dwattr $C$DW$1794, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$1794, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$1794, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1794, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1794, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1794, DW_AT_decl_column(0x12)

$C$DW$1795	.dwtag  DW_TAG_member
	.dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1795, DW_AT_name("i")
	.dwattr $C$DW$1795, DW_AT_TI_symbol_name("i")
	.dwattr $C$DW$1795, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$1795, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1795, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1795, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1795, DW_AT_decl_column(0x12)

$C$DW$1796	.dwtag  DW_TAG_member
	.dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1796, DW_AT_name("j")
	.dwattr $C$DW$1796, DW_AT_TI_symbol_name("j")
	.dwattr $C$DW$1796, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$1796, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1796, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1796, DW_AT_decl_line(0x176)
	.dwattr $C$DW$1796, DW_AT_decl_column(0x12)

$C$DW$1797	.dwtag  DW_TAG_member
	.dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1797, DW_AT_name("k")
	.dwattr $C$DW$1797, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$1797, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$1797, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1797, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1797, DW_AT_decl_line(0x177)
	.dwattr $C$DW$1797, DW_AT_decl_column(0x12)

$C$DW$1798	.dwtag  DW_TAG_member
	.dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1798, DW_AT_name("l")
	.dwattr $C$DW$1798, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$1798, DW_AT_bit_offset(0x19)
	.dwattr $C$DW$1798, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1798, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1798, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1798, DW_AT_decl_column(0x12)

$C$DW$1799	.dwtag  DW_TAG_member
	.dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1799, DW_AT_name("n")
	.dwattr $C$DW$1799, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$1799, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$1799, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1799, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1799, DW_AT_decl_line(0x179)
	.dwattr $C$DW$1799, DW_AT_decl_column(0x12)

$C$DW$1800	.dwtag  DW_TAG_member
	.dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1800, DW_AT_name("p")
	.dwattr $C$DW$1800, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1800, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$1800, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1800, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1800, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$1800, DW_AT_decl_column(0x12)

$C$DW$1801	.dwtag  DW_TAG_member
	.dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1801, DW_AT_name("r")
	.dwattr $C$DW$1801, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$1801, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$1801, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1801, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1801, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$1801, DW_AT_decl_column(0x12)

$C$DW$1802	.dwtag  DW_TAG_member
	.dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1802, DW_AT_name("s")
	.dwattr $C$DW$1802, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$1802, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$1802, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1802, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1802, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$1802, DW_AT_decl_column(0x12)

$C$DW$1803	.dwtag  DW_TAG_member
	.dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1803, DW_AT_name("t")
	.dwattr $C$DW$1803, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$1803, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$1803, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1803, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1803, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$1803, DW_AT_decl_column(0x12)

$C$DW$1804	.dwtag  DW_TAG_member
	.dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1804, DW_AT_name("x")
	.dwattr $C$DW$1804, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1804, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$1804, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1804, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1804, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$1804, DW_AT_decl_column(0x12)

$C$DW$1805	.dwtag  DW_TAG_member
	.dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1805, DW_AT_name("y")
	.dwattr $C$DW$1805, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1805, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$1805, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1805, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1805, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$1805, DW_AT_decl_column(0x12)

$C$DW$1806	.dwtag  DW_TAG_member
	.dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1806, DW_AT_name("z")
	.dwattr $C$DW$1806, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1806, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$1806, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1806, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1806, DW_AT_decl_line(0x180)
	.dwattr $C$DW$1806, DW_AT_decl_column(0x12)

$C$DW$1807	.dwtag  DW_TAG_member
	.dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1807, DW_AT_name("q")
	.dwattr $C$DW$1807, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$1807, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$1807, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1807, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1807, DW_AT_decl_line(0x181)
	.dwattr $C$DW$1807, DW_AT_decl_column(0x12)

$C$DW$1808	.dwtag  DW_TAG_member
	.dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1808, DW_AT_name("d")
	.dwattr $C$DW$1808, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$1808, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1808, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1808, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1808, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$1808, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$82, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x171)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$82


$C$DW$T$92	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$92, DW_AT_byte_size(0x9a)
$C$DW$1809	.dwtag  DW_TAG_member
	.dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$1809, DW_AT_name("non_modal_command")
	.dwattr $C$DW$1809, DW_AT_TI_symbol_name("non_modal_command")
	.dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1809, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1809, DW_AT_decl_line(0x20f)
	.dwattr $C$DW$1809, DW_AT_decl_column(0x11)

$C$DW$1810	.dwtag  DW_TAG_member
	.dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$1810, DW_AT_name("override_command")
	.dwattr $C$DW$1810, DW_AT_TI_symbol_name("override_command")
	.dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1810, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1810, DW_AT_decl_line(0x210)
	.dwattr $C$DW$1810, DW_AT_decl_column(0x15)

$C$DW$1811	.dwtag  DW_TAG_member
	.dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$1811, DW_AT_name("user_mcode")
	.dwattr $C$DW$1811, DW_AT_TI_symbol_name("user_mcode")
	.dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1811, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1811, DW_AT_decl_line(0x211)
	.dwattr $C$DW$1811, DW_AT_decl_column(0x12)

$C$DW$1812	.dwtag  DW_TAG_member
	.dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1812, DW_AT_name("user_mcode_sync")
	.dwattr $C$DW$1812, DW_AT_TI_symbol_name("user_mcode_sync")
	.dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1812, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1812, DW_AT_decl_line(0x212)
	.dwattr $C$DW$1812, DW_AT_decl_column(0x0a)

$C$DW$1813	.dwtag  DW_TAG_member
	.dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$1813, DW_AT_name("modal")
	.dwattr $C$DW$1813, DW_AT_TI_symbol_name("modal")
	.dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1813, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1813, DW_AT_decl_line(0x213)
	.dwattr $C$DW$1813, DW_AT_decl_column(0x10)

$C$DW$1814	.dwtag  DW_TAG_member
	.dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$1814, DW_AT_name("values")
	.dwattr $C$DW$1814, DW_AT_TI_symbol_name("values")
	.dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1814, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1814, DW_AT_decl_line(0x214)
	.dwattr $C$DW$1814, DW_AT_decl_column(0x11)

$C$DW$1815	.dwtag  DW_TAG_member
	.dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$1815, DW_AT_name("words")
	.dwattr $C$DW$1815, DW_AT_TI_symbol_name("words")
	.dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1815, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1815, DW_AT_decl_line(0x215)
	.dwattr $C$DW$1815, DW_AT_decl_column(0x17)

$C$DW$1816	.dwtag  DW_TAG_member
	.dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1816, DW_AT_name("output_command")
	.dwattr $C$DW$1816, DW_AT_TI_symbol_name("output_command")
	.dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1816, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1816, DW_AT_decl_line(0x216)
	.dwattr $C$DW$1816, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$92, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$92, DW_AT_decl_line(0x20e)
	.dwattr $C$DW$T$92, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$92

$C$DW$T$497	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$497, DW_AT_name("parser_block_t")
	.dwattr $C$DW$T$497, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$497, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$497, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$497, DW_AT_decl_line(0x217)
	.dwattr $C$DW$T$497, DW_AT_decl_column(0x03)

$C$DW$T$498	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$498, DW_AT_type(*$C$DW$T$497)
	.dwattr $C$DW$T$498, DW_AT_address_class(0x14)


$C$DW$T$93	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
$C$DW$1817	.dwtag  DW_TAG_member
	.dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1817, DW_AT_name("jog_motion")
	.dwattr $C$DW$1817, DW_AT_TI_symbol_name("jog_motion")
	.dwattr $C$DW$1817, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1817, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1817, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1817, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1817, DW_AT_decl_column(0x12)

$C$DW$1818	.dwtag  DW_TAG_member
	.dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1818, DW_AT_name("canned_cycle_change")
	.dwattr $C$DW$1818, DW_AT_TI_symbol_name("canned_cycle_change")
	.dwattr $C$DW$1818, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1818, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1818, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1818, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1818, DW_AT_decl_column(0x12)

$C$DW$1819	.dwtag  DW_TAG_member
	.dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1819, DW_AT_name("arc_is_clockwise")
	.dwattr $C$DW$1819, DW_AT_TI_symbol_name("arc_is_clockwise")
	.dwattr $C$DW$1819, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1819, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1819, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1819, DW_AT_decl_line(0x115)
	.dwattr $C$DW$1819, DW_AT_decl_column(0x12)

$C$DW$1820	.dwtag  DW_TAG_member
	.dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1820, DW_AT_name("probe_is_away")
	.dwattr $C$DW$1820, DW_AT_TI_symbol_name("probe_is_away")
	.dwattr $C$DW$1820, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1820, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1820, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1820, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1820, DW_AT_decl_column(0x12)

$C$DW$1821	.dwtag  DW_TAG_member
	.dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1821, DW_AT_name("probe_is_no_error")
	.dwattr $C$DW$1821, DW_AT_TI_symbol_name("probe_is_no_error")
	.dwattr $C$DW$1821, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1821, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1821, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1821, DW_AT_decl_line(0x117)
	.dwattr $C$DW$1821, DW_AT_decl_column(0x12)

$C$DW$1822	.dwtag  DW_TAG_member
	.dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1822, DW_AT_name("spindle_force_sync")
	.dwattr $C$DW$1822, DW_AT_TI_symbol_name("spindle_force_sync")
	.dwattr $C$DW$1822, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1822, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1822, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1822, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1822, DW_AT_decl_column(0x12)

$C$DW$1823	.dwtag  DW_TAG_member
	.dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1823, DW_AT_name("laser_disable")
	.dwattr $C$DW$1823, DW_AT_TI_symbol_name("laser_disable")
	.dwattr $C$DW$1823, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1823, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1823, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1823, DW_AT_decl_line(0x119)
	.dwattr $C$DW$1823, DW_AT_decl_column(0x12)

$C$DW$1824	.dwtag  DW_TAG_member
	.dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1824, DW_AT_name("laser_is_motion")
	.dwattr $C$DW$1824, DW_AT_TI_symbol_name("laser_is_motion")
	.dwattr $C$DW$1824, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1824, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1824, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1824, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1824, DW_AT_decl_column(0x12)

$C$DW$1825	.dwtag  DW_TAG_member
	.dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1825, DW_AT_name("set_coolant")
	.dwattr $C$DW$1825, DW_AT_TI_symbol_name("set_coolant")
	.dwattr $C$DW$1825, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1825, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1825, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1825, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$1825, DW_AT_decl_column(0x12)

$C$DW$1826	.dwtag  DW_TAG_member
	.dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1826, DW_AT_name("motion_mode_changed")
	.dwattr $C$DW$1826, DW_AT_TI_symbol_name("motion_mode_changed")
	.dwattr $C$DW$1826, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1826, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1826, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1826, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1826, DW_AT_decl_column(0x12)

$C$DW$1827	.dwtag  DW_TAG_member
	.dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1827, DW_AT_name("reserved")
	.dwattr $C$DW$1827, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$1827, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1827, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1827, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1827, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$1827, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$93, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$93, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$93, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$93


$C$DW$T$94	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$94, DW_AT_byte_size(0x14)
$C$DW$1828	.dwtag  DW_TAG_member
	.dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1828, DW_AT_name("offset")
	.dwattr $C$DW$1828, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1828, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1828, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$1828, DW_AT_decl_column(0x0b)

$C$DW$1829	.dwtag  DW_TAG_member
	.dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1829, DW_AT_name("radius")
	.dwattr $C$DW$1829, DW_AT_TI_symbol_name("radius")
	.dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1829, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1829, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$1829, DW_AT_decl_column(0x0b)

$C$DW$1830	.dwtag  DW_TAG_member
	.dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1830, DW_AT_name("tool")
	.dwattr $C$DW$1830, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1830, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1830, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$1830, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$94, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$94, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$94, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$94

$C$DW$T$98	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$98, DW_AT_name("tool_data_t")
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$98, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$98, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$T$98, DW_AT_decl_column(0x03)

$C$DW$T$99	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$99, DW_AT_address_class(0x14)


$C$DW$T$100	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$100, DW_AT_byte_size(0xa8)
$C$DW$1831	.dwtag  DW_TAG_member
	.dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$1831, DW_AT_name("modal")
	.dwattr $C$DW$1831, DW_AT_TI_symbol_name("modal")
	.dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1831, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1831, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1831, DW_AT_decl_column(0x10)

$C$DW$1832	.dwtag  DW_TAG_member
	.dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$1832, DW_AT_name("canned")
	.dwattr $C$DW$1832, DW_AT_TI_symbol_name("canned")
	.dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1832, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1832, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1832, DW_AT_decl_column(0x11)

$C$DW$1833	.dwtag  DW_TAG_member
	.dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1833, DW_AT_name("spindle")
	.dwattr $C$DW$1833, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1833, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1833, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1833, DW_AT_decl_column(0x0f)

$C$DW$1834	.dwtag  DW_TAG_member
	.dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1834, DW_AT_name("feed_rate")
	.dwattr $C$DW$1834, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1834, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1834, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1834, DW_AT_decl_column(0x0b)

$C$DW$1835	.dwtag  DW_TAG_member
	.dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1835, DW_AT_name("distance_per_rev")
	.dwattr $C$DW$1835, DW_AT_TI_symbol_name("distance_per_rev")
	.dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1835, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1835, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$1835, DW_AT_decl_column(0x0b)

$C$DW$1836	.dwtag  DW_TAG_member
	.dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1836, DW_AT_name("position")
	.dwattr $C$DW$1836, DW_AT_TI_symbol_name("position")
	.dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1836, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1836, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$1836, DW_AT_decl_column(0x0b)

$C$DW$1837	.dwtag  DW_TAG_member
	.dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1837, DW_AT_name("line_number")
	.dwattr $C$DW$1837, DW_AT_TI_symbol_name("line_number")
	.dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1837, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1837, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$1837, DW_AT_decl_column(0x0d)

$C$DW$1838	.dwtag  DW_TAG_member
	.dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1838, DW_AT_name("tool_pending")
	.dwattr $C$DW$1838, DW_AT_TI_symbol_name("tool_pending")
	.dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1838, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1838, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$1838, DW_AT_decl_column(0x0e)

$C$DW$1839	.dwtag  DW_TAG_member
	.dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1839, DW_AT_name("file_run")
	.dwattr $C$DW$1839, DW_AT_TI_symbol_name("file_run")
	.dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1839, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1839, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$1839, DW_AT_decl_column(0x0a)

$C$DW$1840	.dwtag  DW_TAG_member
	.dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1840, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$1840, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x85]
	.dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1840, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1840, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$1840, DW_AT_decl_column(0x0a)

$C$DW$1841	.dwtag  DW_TAG_member
	.dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1841, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1841, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1841, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1841, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$1841, DW_AT_decl_column(0x0a)

$C$DW$1842	.dwtag  DW_TAG_member
	.dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1842, DW_AT_name("tool_change")
	.dwattr $C$DW$1842, DW_AT_TI_symbol_name("tool_change")
	.dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
	.dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1842, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1842, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$1842, DW_AT_decl_column(0x0a)

$C$DW$1843	.dwtag  DW_TAG_member
	.dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$1843, DW_AT_name("last_error")
	.dwattr $C$DW$1843, DW_AT_TI_symbol_name("last_error")
	.dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1843, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1843, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$1843, DW_AT_decl_column(0x13)

$C$DW$1844	.dwtag  DW_TAG_member
	.dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1844, DW_AT_name("g92_coord_offset_applied")
	.dwattr $C$DW$1844, DW_AT_TI_symbol_name("g92_coord_offset_applied")
	.dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1844, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1844, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$1844, DW_AT_decl_column(0x0a)

$C$DW$1845	.dwtag  DW_TAG_member
	.dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1845, DW_AT_name("g92_coord_offset")
	.dwattr $C$DW$1845, DW_AT_TI_symbol_name("g92_coord_offset")
	.dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
