;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed May 31 19:52:30 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../grbl/ngc_params.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("gc_state")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("gc_state")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$385)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x202)
	.dwattr $C$DW$1, DW_AT_decl_column(0x17)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("sys")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("sys")
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$649)

	.dwattr $C$DW$878, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$878, DW_AT_decl_line(0x107)
	.dwattr $C$DW$878, DW_AT_decl_column(0x05)

$C$DW$879	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$879, DW_AT_name("GCProbe_CheckMode")
	.dwattr $C$DW$879, DW_AT_const_value(0x00)
	.dwattr $C$DW$879, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$879, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$879, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$374, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$374, DW_AT_decl_line(0x103)
	.dwattr $C$DW$T$374, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$374

$C$DW$T$375	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$375, DW_AT_name("gc_probe_t")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$375, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$375, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$375, DW_AT_decl_column(0x03)


$C$DW$T$376	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$376, DW_AT_byte_size(0x02)
$C$DW$880	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$880, DW_AT_name("WiFiMode_NULL")
	.dwattr $C$DW$880, DW_AT_const_value(0x00)
	.dwattr $C$DW$880, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$880, DW_AT_decl_line(0x55)
	.dwattr $C$DW$880, DW_AT_decl_column(0x05)

$C$DW$881	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$881, DW_AT_name("WiFiMode_STA")
	.dwattr $C$DW$881, DW_AT_const_value(0x01)
	.dwattr $C$DW$881, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$881, DW_AT_decl_line(0x56)
	.dwattr $C$DW$881, DW_AT_decl_column(0x05)

$C$DW$882	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$882, DW_AT_name("WiFiMode_AP")
	.dwattr $C$DW$882, DW_AT_const_value(0x02)
	.dwattr $C$DW$882, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$882, DW_AT_decl_line(0x57)
	.dwattr $C$DW$882, DW_AT_decl_column(0x05)

$C$DW$883	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$883, DW_AT_name("WiFiMode_APSTA")
	.dwattr $C$DW$883, DW_AT_const_value(0x03)
	.dwattr $C$DW$883, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$883, DW_AT_decl_line(0x58)
	.dwattr $C$DW$883, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$376, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$T$376, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$376, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$376

$C$DW$T$377	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$377, DW_AT_name("grbl_wifi_mode_t")
	.dwattr $C$DW$T$377, DW_AT_type(*$C$DW$T$376)
	.dwattr $C$DW$T$377, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$377, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$T$377, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$377, DW_AT_decl_column(0x03)


$C$DW$T$378	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$378, DW_AT_byte_size(0x02)
$C$DW$884	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$884, DW_AT_name("Setting_EncoderMode")
	.dwattr $C$DW$884, DW_AT_const_value(0x00)
	.dwattr $C$DW$884, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$884, DW_AT_decl_line(0x85)
	.dwattr $C$DW$884, DW_AT_decl_column(0x05)

$C$DW$885	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$885, DW_AT_name("Setting_EncoderCPR")
	.dwattr $C$DW$885, DW_AT_const_value(0x01)
	.dwattr $C$DW$885, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$885, DW_AT_decl_line(0x86)
	.dwattr $C$DW$885, DW_AT_decl_column(0x05)

$C$DW$886	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$886, DW_AT_name("Setting_EncoderCPD")
	.dwattr $C$DW$886, DW_AT_const_value(0x02)
	.dwattr $C$DW$886, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$886, DW_AT_decl_line(0x87)
	.dwattr $C$DW$886, DW_AT_decl_column(0x05)

$C$DW$887	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$887, DW_AT_name("Setting_EncoderDblClickWindow")
	.dwattr $C$DW$887, DW_AT_const_value(0x03)
	.dwattr $C$DW$887, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$887, DW_AT_decl_line(0x88)
	.dwattr $C$DW$887, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$378, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$T$378, DW_AT_decl_line(0x84)
	.dwattr $C$DW$T$378, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$378

$C$DW$T$379	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$379, DW_AT_name("encoder_setting_id_t")
	.dwattr $C$DW$T$379, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$T$379, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$379, DW_AT_decl_file("..\grbl\plugins.h")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x03)


$C$DW$T$380	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$380, DW_AT_byte_size(0x02)
$C$DW$888	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$888, DW_AT_name("SpindleAction_None")
	.dwattr $C$DW$888, DW_AT_const_value(0x00)
	.dwattr $C$DW$888, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$888, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$888, DW_AT_decl_column(0x05)

$C$DW$889	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$889, DW_AT_name("SpindleAction_DisableWithZeroSPeed")
	.dwattr $C$DW$889, DW_AT_const_value(0x01)
	.dwattr $C$DW$889, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$889, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$889, DW_AT_decl_column(0x05)

$C$DW$890	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$890, DW_AT_name("SpindleAction_EnableWithAllSPeeds")
	.dwattr $C$DW$890, DW_AT_const_value(0x02)
	.dwattr $C$DW$890, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$890, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$890, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$380, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$380, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$T$380, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$380

$C$DW$T$381	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$381, DW_AT_name("spindle_action_t")
	.dwattr $C$DW$T$381, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$T$381, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$381, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$381, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$381, DW_AT_decl_column(0x03)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
$C$DW$891	.dwtag  DW_TAG_member
	.dwattr $C$DW$891, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$891, DW_AT_name("xyz")
	.dwattr $C$DW$891, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$891, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$891, DW_AT_decl_line(0x149)
	.dwattr $C$DW$891, DW_AT_decl_column(0x0b)

$C$DW$892	.dwtag  DW_TAG_member
	.dwattr $C$DW$892, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$892, DW_AT_name("id")
	.dwattr $C$DW$892, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$892, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$892, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$892, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$25

$C$DW$T$40	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$40, DW_AT_name("coord_system_t")
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$40, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x03)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
$C$DW$893	.dwtag  DW_TAG_member
	.dwattr $C$DW$893, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$893, DW_AT_name("flood")
	.dwattr $C$DW$893, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$893, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$893, DW_AT_bit_size(0x01)
	.dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$893, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$893, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$893, DW_AT_decl_column(0x11)

$C$DW$894	.dwtag  DW_TAG_member
	.dwattr $C$DW$894, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$894, DW_AT_name("mist")
	.dwattr $C$DW$894, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$894, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$894, DW_AT_bit_size(0x01)
	.dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$894, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$894, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$894, DW_AT_decl_column(0x11)

$C$DW$895	.dwtag  DW_TAG_member
	.dwattr $C$DW$895, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$895, DW_AT_name("shower")
	.dwattr $C$DW$895, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$895, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$895, DW_AT_bit_size(0x01)
	.dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$895, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$895, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$895, DW_AT_decl_column(0x11)

$C$DW$896	.dwtag  DW_TAG_member
	.dwattr $C$DW$896, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$896, DW_AT_name("trough_spindle")
	.dwattr $C$DW$896, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$896, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$896, DW_AT_bit_size(0x01)
	.dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$896, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$896, DW_AT_decl_line(0x20)
	.dwattr $C$DW$896, DW_AT_decl_column(0x11)

$C$DW$897	.dwtag  DW_TAG_member
	.dwattr $C$DW$897, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$897, DW_AT_name("unused")
	.dwattr $C$DW$897, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$897, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$897, DW_AT_bit_size(0x04)
	.dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$897, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$897, DW_AT_decl_line(0x21)
	.dwattr $C$DW$897, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$28, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$28


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
$C$DW$898	.dwtag  DW_TAG_member
	.dwattr $C$DW$898, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$898, DW_AT_name("on")
	.dwattr $C$DW$898, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$898, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$898, DW_AT_bit_size(0x01)
	.dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$898, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$898, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$898, DW_AT_decl_column(0x11)

$C$DW$899	.dwtag  DW_TAG_member
	.dwattr $C$DW$899, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$899, DW_AT_name("ccw")
	.dwattr $C$DW$899, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$899, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$899, DW_AT_bit_size(0x01)
	.dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$899, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$899, DW_AT_decl_line(0x20)
	.dwattr $C$DW$899, DW_AT_decl_column(0x11)

$C$DW$900	.dwtag  DW_TAG_member
	.dwattr $C$DW$900, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$900, DW_AT_name("pwm")
	.dwattr $C$DW$900, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$900, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$900, DW_AT_bit_size(0x01)
	.dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$900, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$900, DW_AT_decl_line(0x21)
	.dwattr $C$DW$900, DW_AT_decl_column(0x11)

$C$DW$901	.dwtag  DW_TAG_member
	.dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$901, DW_AT_name("reserved3")
	.dwattr $C$DW$901, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$901, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$901, DW_AT_bit_size(0x01)
	.dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$901, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$901, DW_AT_decl_line(0x22)
	.dwattr $C$DW$901, DW_AT_decl_column(0x11)

$C$DW$902	.dwtag  DW_TAG_member
	.dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$902, DW_AT_name("reserved4")
	.dwattr $C$DW$902, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$902, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$902, DW_AT_bit_size(0x01)
	.dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$902, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$902, DW_AT_decl_line(0x23)
	.dwattr $C$DW$902, DW_AT_decl_column(0x11)

$C$DW$903	.dwtag  DW_TAG_member
	.dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$903, DW_AT_name("encoder_error")
	.dwattr $C$DW$903, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$903, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$903, DW_AT_bit_size(0x01)
	.dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$903, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$903, DW_AT_decl_line(0x24)
	.dwattr $C$DW$903, DW_AT_decl_column(0x11)

$C$DW$904	.dwtag  DW_TAG_member
	.dwattr $C$DW$904, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$904, DW_AT_name("at_speed")
	.dwattr $C$DW$904, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$904, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$904, DW_AT_bit_size(0x01)
	.dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$904, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$904, DW_AT_decl_line(0x25)
	.dwattr $C$DW$904, DW_AT_decl_column(0x11)

$C$DW$905	.dwtag  DW_TAG_member
	.dwattr $C$DW$905, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$905, DW_AT_name("synchronized")
	.dwattr $C$DW$905, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$905, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$905, DW_AT_bit_size(0x01)
	.dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$905, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$905, DW_AT_decl_line(0x26)
	.dwattr $C$DW$905, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$29, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$29


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$906, DW_AT_name("feed_rate_disable")
	.dwattr $C$DW$906, DW_AT_TI_symbol_name("feed_rate_disable")
	.dwattr $C$DW$906, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$906, DW_AT_bit_size(0x01)
	.dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$906, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$906, DW_AT_decl_line(0x125)
	.dwattr $C$DW$906, DW_AT_decl_column(0x11)

$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$907, DW_AT_name("feed_hold_disable")
	.dwattr $C$DW$907, DW_AT_TI_symbol_name("feed_hold_disable")
	.dwattr $C$DW$907, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$907, DW_AT_bit_size(0x01)
	.dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$907, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$907, DW_AT_decl_line(0x126)
	.dwattr $C$DW$907, DW_AT_decl_column(0x11)

$C$DW$908	.dwtag  DW_TAG_member
	.dwattr $C$DW$908, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$908, DW_AT_name("spindle_rpm_disable")
	.dwattr $C$DW$908, DW_AT_TI_symbol_name("spindle_rpm_disable")
	.dwattr $C$DW$908, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$908, DW_AT_bit_size(0x01)
	.dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$908, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$908, DW_AT_decl_line(0x127)
	.dwattr $C$DW$908, DW_AT_decl_column(0x11)

$C$DW$909	.dwtag  DW_TAG_member
	.dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$909, DW_AT_name("parking_disable")
	.dwattr $C$DW$909, DW_AT_TI_symbol_name("parking_disable")
	.dwattr $C$DW$909, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$909, DW_AT_bit_size(0x01)
	.dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$909, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$909, DW_AT_decl_line(0x128)
	.dwattr $C$DW$909, DW_AT_decl_column(0x11)

$C$DW$910	.dwtag  DW_TAG_member
	.dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$910, DW_AT_name("reserved")
	.dwattr $C$DW$910, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$910, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$910, DW_AT_bit_size(0x03)
	.dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$910, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$910, DW_AT_decl_line(0x129)
	.dwattr $C$DW$910, DW_AT_decl_column(0x11)

$C$DW$911	.dwtag  DW_TAG_member
	.dwattr $C$DW$911, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$911, DW_AT_name("sync")
	.dwattr $C$DW$911, DW_AT_TI_symbol_name("sync")
	.dwattr $C$DW$911, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$911, DW_AT_bit_size(0x01)
	.dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$911, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$911, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$911, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$30


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x2e)
$C$DW$912	.dwtag  DW_TAG_member
	.dwattr $C$DW$912, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$912, DW_AT_name("motion")
	.dwattr $C$DW$912, DW_AT_TI_symbol_name("motion")
	.dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$912, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$912, DW_AT_decl_line(0x191)
	.dwattr $C$DW$912, DW_AT_decl_column(0x13)

$C$DW$913	.dwtag  DW_TAG_member
	.dwattr $C$DW$913, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$913, DW_AT_name("feed_mode")
	.dwattr $C$DW$913, DW_AT_TI_symbol_name("feed_mode")
	.dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$913, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$913, DW_AT_decl_line(0x192)
	.dwattr $C$DW$913, DW_AT_decl_column(0x11)

$C$DW$914	.dwtag  DW_TAG_member
	.dwattr $C$DW$914, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$914, DW_AT_name("units_imperial")
	.dwattr $C$DW$914, DW_AT_TI_symbol_name("units_imperial")
	.dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$914, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$914, DW_AT_decl_line(0x193)
	.dwattr $C$DW$914, DW_AT_decl_column(0x0a)

$C$DW$915	.dwtag  DW_TAG_member
	.dwattr $C$DW$915, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$915, DW_AT_name("distance_incremental")
	.dwattr $C$DW$915, DW_AT_TI_symbol_name("distance_incremental")
	.dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$915, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$915, DW_AT_decl_line(0x194)
	.dwattr $C$DW$915, DW_AT_decl_column(0x0a)

$C$DW$916	.dwtag  DW_TAG_member
	.dwattr $C$DW$916, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$916, DW_AT_name("diameter_mode")
	.dwattr $C$DW$916, DW_AT_TI_symbol_name("diameter_mode")
	.dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$916, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$916, DW_AT_decl_line(0x195)
	.dwattr $C$DW$916, DW_AT_decl_column(0x0a)

$C$DW$917	.dwtag  DW_TAG_member
	.dwattr $C$DW$917, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$917, DW_AT_name("plane_select")
	.dwattr $C$DW$917, DW_AT_TI_symbol_name("plane_select")
	.dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$917, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$917, DW_AT_decl_line(0x197)
	.dwattr $C$DW$917, DW_AT_decl_column(0x14)

$C$DW$918	.dwtag  DW_TAG_member
	.dwattr $C$DW$918, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$918, DW_AT_name("tool_offset_mode")
	.dwattr $C$DW$918, DW_AT_TI_symbol_name("tool_offset_mode")
	.dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$918, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$918, DW_AT_decl_line(0x199)
	.dwattr $C$DW$918, DW_AT_decl_column(0x18)

$C$DW$919	.dwtag  DW_TAG_member
	.dwattr $C$DW$919, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$919, DW_AT_name("coord_system")
	.dwattr $C$DW$919, DW_AT_TI_symbol_name("coord_system")
	.dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$919, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$919, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$919, DW_AT_decl_column(0x14)

$C$DW$920	.dwtag  DW_TAG_member
	.dwattr $C$DW$920, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$920, DW_AT_name("program_flow")
	.dwattr $C$DW$920, DW_AT_TI_symbol_name("program_flow")
	.dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$920, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$920, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$920, DW_AT_decl_column(0x14)

$C$DW$921	.dwtag  DW_TAG_member
	.dwattr $C$DW$921, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$921, DW_AT_name("coolant")
	.dwattr $C$DW$921, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$921, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$921, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$921, DW_AT_decl_column(0x15)

$C$DW$922	.dwtag  DW_TAG_member
	.dwattr $C$DW$922, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$922, DW_AT_name("spindle")
	.dwattr $C$DW$922, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$922, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$922, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$922, DW_AT_decl_column(0x15)

$C$DW$923	.dwtag  DW_TAG_member
	.dwattr $C$DW$923, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$923, DW_AT_name("override_ctrl")
	.dwattr $C$DW$923, DW_AT_TI_symbol_name("override_ctrl")
	.dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$923, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$923, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$923, DW_AT_decl_column(0x19)

$C$DW$924	.dwtag  DW_TAG_member
	.dwattr $C$DW$924, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$924, DW_AT_name("spindle_rpm_mode")
	.dwattr $C$DW$924, DW_AT_TI_symbol_name("spindle_rpm_mode")
	.dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$924, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$924, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$924, DW_AT_decl_column(0x18)

$C$DW$925	.dwtag  DW_TAG_member
	.dwattr $C$DW$925, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$925, DW_AT_name("retract_mode")
	.dwattr $C$DW$925, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$925, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$925, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$925, DW_AT_decl_column(0x17)

$C$DW$926	.dwtag  DW_TAG_member
	.dwattr $C$DW$926, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$926, DW_AT_name("scaling_active")
	.dwattr $C$DW$926, DW_AT_TI_symbol_name("scaling_active")
	.dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$926, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$926, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$926, DW_AT_decl_column(0x0a)

$C$DW$927	.dwtag  DW_TAG_member
	.dwattr $C$DW$927, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$927, DW_AT_name("canned_cycle_active")
	.dwattr $C$DW$927, DW_AT_TI_symbol_name("canned_cycle_active")
	.dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$927, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$927, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$927, DW_AT_decl_column(0x0a)

$C$DW$928	.dwtag  DW_TAG_member
	.dwattr $C$DW$928, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$928, DW_AT_name("spline_pq")
	.dwattr $C$DW$928, DW_AT_TI_symbol_name("spline_pq")
	.dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$928, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$928, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$928, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$51

$C$DW$T$62	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$62, DW_AT_name("gc_modal_t")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$62, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x03)


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x22)
$C$DW$929	.dwtag  DW_TAG_member
	.dwattr $C$DW$929, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$929, DW_AT_name("xyz")
	.dwattr $C$DW$929, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$929, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$929, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$929, DW_AT_decl_column(0x0b)

$C$DW$930	.dwtag  DW_TAG_member
	.dwattr $C$DW$930, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$930, DW_AT_name("delta")
	.dwattr $C$DW$930, DW_AT_TI_symbol_name("delta")
	.dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$930, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$930, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$930, DW_AT_decl_column(0x0b)

$C$DW$931	.dwtag  DW_TAG_member
	.dwattr $C$DW$931, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$931, DW_AT_name("dwell")
	.dwattr $C$DW$931, DW_AT_TI_symbol_name("dwell")
	.dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$931, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$931, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$931, DW_AT_decl_column(0x0b)

$C$DW$932	.dwtag  DW_TAG_member
	.dwattr $C$DW$932, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$932, DW_AT_name("prev_position")
	.dwattr $C$DW$932, DW_AT_TI_symbol_name("prev_position")
	.dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$932, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$932, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$932, DW_AT_decl_column(0x0b)

$C$DW$933	.dwtag  DW_TAG_member
	.dwattr $C$DW$933, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$933, DW_AT_name("retract_position")
	.dwattr $C$DW$933, DW_AT_TI_symbol_name("retract_position")
	.dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$933, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$933, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$933, DW_AT_decl_column(0x0b)

$C$DW$934	.dwtag  DW_TAG_member
	.dwattr $C$DW$934, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$934, DW_AT_name("rapid_retract")
	.dwattr $C$DW$934, DW_AT_TI_symbol_name("rapid_retract")
	.dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$934, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$934, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$934, DW_AT_decl_column(0x0a)

$C$DW$935	.dwtag  DW_TAG_member
	.dwattr $C$DW$935, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$935, DW_AT_name("spindle_off")
	.dwattr $C$DW$935, DW_AT_TI_symbol_name("spindle_off")
	.dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$935, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$935, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$935, DW_AT_decl_column(0x0a)

$C$DW$936	.dwtag  DW_TAG_member
	.dwattr $C$DW$936, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$936, DW_AT_name("retract_mode")
	.dwattr $C$DW$936, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$936, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$936, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$936, DW_AT_decl_column(0x17)

$C$DW$937	.dwtag  DW_TAG_member
	.dwattr $C$DW$937, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$937, DW_AT_name("change")
	.dwattr $C$DW$937, DW_AT_TI_symbol_name("change")
	.dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$937, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$937, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$937, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$52

$C$DW$T$63	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$63, DW_AT_name("gc_canned_t")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$63, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x03)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x14)
$C$DW$938	.dwtag  DW_TAG_member
	.dwattr $C$DW$938, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$938, DW_AT_name("surface_speed")
	.dwattr $C$DW$938, DW_AT_TI_symbol_name("surface_speed")
	.dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$938, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$938, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$938, DW_AT_decl_column(0x0b)

$C$DW$939	.dwtag  DW_TAG_member
	.dwattr $C$DW$939, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$939, DW_AT_name("target_rpm")
	.dwattr $C$DW$939, DW_AT_TI_symbol_name("target_rpm")
	.dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$939, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$939, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$939, DW_AT_decl_column(0x0b)

$C$DW$940	.dwtag  DW_TAG_member
	.dwattr $C$DW$940, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$940, DW_AT_name("max_rpm")
	.dwattr $C$DW$940, DW_AT_TI_symbol_name("max_rpm")
	.dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$940, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$940, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$940, DW_AT_decl_column(0x0b)

$C$DW$941	.dwtag  DW_TAG_member
	.dwattr $C$DW$941, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$941, DW_AT_name("tool_offset")
	.dwattr $C$DW$941, DW_AT_TI_symbol_name("tool_offset")
	.dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$941, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$941, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$941, DW_AT_decl_column(0x0b)

$C$DW$942	.dwtag  DW_TAG_member
	.dwattr $C$DW$942, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$942, DW_AT_name("axis")
	.dwattr $C$DW$942, DW_AT_TI_symbol_name("axis")
	.dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$942, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$942, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$942, DW_AT_decl_column(0x12)

$C$DW$943	.dwtag  DW_TAG_member
	.dwattr $C$DW$943, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$943, DW_AT_name("active")
	.dwattr $C$DW$943, DW_AT_TI_symbol_name("active")
	.dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$943, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$943, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$943, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$56, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$56

$C$DW$T$57	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$57, DW_AT_name("css_data_t")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$57, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x03)


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x18)
$C$DW$944	.dwtag  DW_TAG_member
	.dwattr $C$DW$944, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$944, DW_AT_name("rpm")
	.dwattr $C$DW$944, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$944, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$944, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$944, DW_AT_decl_column(0x0b)

$C$DW$945	.dwtag  DW_TAG_member
	.dwattr $C$DW$945, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$945, DW_AT_name("css")
	.dwattr $C$DW$945, DW_AT_TI_symbol_name("css")
	.dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$945, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$945, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$945, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$58

$C$DW$T$64	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$64, DW_AT_name("spindle_t")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$64, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x03)


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x14)
$C$DW$946	.dwtag  DW_TAG_member
	.dwattr $C$DW$946, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$946, DW_AT_name("offset")
	.dwattr $C$DW$946, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$946, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$946, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$946, DW_AT_decl_column(0x0b)

$C$DW$947	.dwtag  DW_TAG_member
	.dwattr $C$DW$947, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$947, DW_AT_name("radius")
	.dwattr $C$DW$947, DW_AT_TI_symbol_name("radius")
	.dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$947, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$947, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$947, DW_AT_decl_column(0x0b)

$C$DW$948	.dwtag  DW_TAG_member
	.dwattr $C$DW$948, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$948, DW_AT_name("tool")
	.dwattr $C$DW$948, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$948, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$948, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$948, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$61, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$61

$C$DW$T$69	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$69, DW_AT_name("tool_data_t")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x03)

$C$DW$T$70	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$70, DW_AT_address_class(0x14)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0xa8)
$C$DW$949	.dwtag  DW_TAG_member
	.dwattr $C$DW$949, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$949, DW_AT_name("modal")
	.dwattr $C$DW$949, DW_AT_TI_symbol_name("modal")
	.dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$949, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$949, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$949, DW_AT_decl_column(0x10)

$C$DW$950	.dwtag  DW_TAG_member
	.dwattr $C$DW$950, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$950, DW_AT_name("canned")
	.dwattr $C$DW$950, DW_AT_TI_symbol_name("canned")
	.dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$950, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$950, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$950, DW_AT_decl_column(0x11)

$C$DW$951	.dwtag  DW_TAG_member
	.dwattr $C$DW$951, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$951, DW_AT_name("spindle")
	.dwattr $C$DW$951, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$951, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$951, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$951, DW_AT_decl_column(0x0f)

$C$DW$952	.dwtag  DW_TAG_member
	.dwattr $C$DW$952, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$952, DW_AT_name("feed_rate")
	.dwattr $C$DW$952, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$952, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$952, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$952, DW_AT_decl_column(0x0b)

$C$DW$953	.dwtag  DW_TAG_member
	.dwattr $C$DW$953, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$953, DW_AT_name("distance_per_rev")
	.dwattr $C$DW$953, DW_AT_TI_symbol_name("distance_per_rev")
	.dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$953, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$953, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$953, DW_AT_decl_column(0x0b)

$C$DW$954	.dwtag  DW_TAG_member
	.dwattr $C$DW$954, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$954, DW_AT_name("position")
	.dwattr $C$DW$954, DW_AT_TI_symbol_name("position")
	.dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$954, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$954, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$954, DW_AT_decl_column(0x0b)

$C$DW$955	.dwtag  DW_TAG_member
	.dwattr $C$DW$955, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$955, DW_AT_name("line_number")
	.dwattr $C$DW$955, DW_AT_TI_symbol_name("line_number")
	.dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$955, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$955, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$955, DW_AT_decl_column(0x0d)

$C$DW$956	.dwtag  DW_TAG_member
	.dwattr $C$DW$956, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$956, DW_AT_name("tool_pending")
	.dwattr $C$DW$956, DW_AT_TI_symbol_name("tool_pending")
	.dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$956, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$956, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$956, DW_AT_decl_column(0x0e)

$C$DW$957	.dwtag  DW_TAG_member
	.dwattr $C$DW$957, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$957, DW_AT_name("file_run")
	.dwattr $C$DW$957, DW_AT_TI_symbol_name("file_run")
	.dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$957, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$957, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$957, DW_AT_decl_column(0x0a)

$C$DW$958	.dwtag  DW_TAG_member
	.dwattr $C$DW$958, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$958, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$958, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x85]
	.dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$958, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$958, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$958, DW_AT_decl_column(0x0a)

$C$DW$959	.dwtag  DW_TAG_member
	.dwattr $C$DW$959, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$959, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$959, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$959, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$959, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$959, DW_AT_decl_column(0x0a)

$C$DW$960	.dwtag  DW_TAG_member
	.dwattr $C$DW$960, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$960, DW_AT_name("tool_change")
	.dwattr $C$DW$960, DW_AT_TI_symbol_name("tool_change")
	.dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
	.dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$960, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$960, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$960, DW_AT_decl_column(0x0a)

$C$DW$961	.dwtag  DW_TAG_member
	.dwattr $C$DW$961, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$961, DW_AT_name("last_error")
	.dwattr $C$DW$961, DW_AT_TI_symbol_name("last_error")
	.dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$961, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$961, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$961, DW_AT_decl_column(0x13)

$C$DW$962	.dwtag  DW_TAG_member
	.dwattr $C$DW$962, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$962, DW_AT_name("g92_coord_offset_applied")
	.dwattr $C$DW$962, DW_AT_TI_symbol_name("g92_coord_offset_applied")
	.dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$962, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$962, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$962, DW_AT_decl_column(0x0a)

$C$DW$963	.dwtag  DW_TAG_member
	.dwattr $C$DW$963, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$963, DW_AT_name("g92_coord_offset")
	.dwattr $C$DW$963, DW_AT_TI_symbol_name("g92_coord_offset")
	.dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$963, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$963, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$963, DW_AT_decl_column(0x0b)

$C$DW$964	.dwtag  DW_TAG_member
	.dwattr $C$DW$964, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$964, DW_AT_name("tool_length_offset")
	.dwattr $C$DW$964, DW_AT_TI_symbol_name("tool_length_offset")
	.dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$964, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$964, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$964, DW_AT_decl_column(0x0b)

$C$DW$965	.dwtag  DW_TAG_member
	.dwattr $C$DW$965, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$965, DW_AT_name("tool")
	.dwattr $C$DW$965, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$965, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$965, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$965, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$71, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$71

$C$DW$T$385	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$385, DW_AT_name("parser_state_t")
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$385, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$385, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$T$385, DW_AT_decl_column(0x03)


$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x01)
$C$DW$966	.dwtag  DW_TAG_member
	.dwattr $C$DW$966, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$966, DW_AT_name("x")
	.dwattr $C$DW$966, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$966, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$966, DW_AT_bit_size(0x01)
	.dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$966, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$966, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$966, DW_AT_decl_column(0x11)

$C$DW$967	.dwtag  DW_TAG_member
	.dwattr $C$DW$967, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$967, DW_AT_name("y")
	.dwattr $C$DW$967, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$967, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$967, DW_AT_bit_size(0x01)
	.dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$967, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$967, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$967, DW_AT_decl_column(0x11)

$C$DW$968	.dwtag  DW_TAG_member
	.dwattr $C$DW$968, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$968, DW_AT_name("z")
	.dwattr $C$DW$968, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$968, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$968, DW_AT_bit_size(0x01)
	.dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$968, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$968, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$968, DW_AT_decl_column(0x11)

$C$DW$969	.dwtag  DW_TAG_member
	.dwattr $C$DW$969, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$969, DW_AT_name("a")
	.dwattr $C$DW$969, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$969, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$969, DW_AT_bit_size(0x01)
	.dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$969, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$969, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$969, DW_AT_decl_column(0x11)

$C$DW$970	.dwtag  DW_TAG_member
	.dwattr $C$DW$970, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$970, DW_AT_name("b")
	.dwattr $C$DW$970, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$970, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$970, DW_AT_bit_size(0x01)
	.dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$970, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$970, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$970, DW_AT_decl_column(0x11)

$C$DW$971	.dwtag  DW_TAG_member
	.dwattr $C$DW$971, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$971, DW_AT_name("c")
	.dwattr $C$DW$971, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$971, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$971, DW_AT_bit_size(0x01)
	.dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$971, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$971, DW_AT_decl_line(0x80)
	.dwattr $C$DW$971, DW_AT_decl_column(0x11)

$C$DW$972	.dwtag  DW_TAG_member
	.dwattr $C$DW$972, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$972, DW_AT_name("u")
	.dwattr $C$DW$972, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$972, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$972, DW_AT_bit_size(0x01)
	.dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$972, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$972, DW_AT_decl_line(0x81)
	.dwattr $C$DW$972, DW_AT_decl_column(0x11)

$C$DW$973	.dwtag  DW_TAG_member
	.dwattr $C$DW$973, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$973, DW_AT_name("v")
	.dwattr $C$DW$973, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$973, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$973, DW_AT_bit_size(0x01)
	.dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$973, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$973, DW_AT_decl_line(0x82)
	.dwattr $C$DW$973, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$72, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$72


$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
$C$DW$974	.dwtag  DW_TAG_member
	.dwattr $C$DW$974, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$974, DW_AT_name("mpg_mode")
	.dwattr $C$DW$974, DW_AT_TI_symbol_name("mpg_mode")
	.dwattr $C$DW$974, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$974, DW_AT_bit_size(0x01)
	.dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$974, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$974, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$974, DW_AT_decl_column(0x12)

$C$DW$975	.dwtag  DW_TAG_member
	.dwattr $C$DW$975, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$975, DW_AT_name("probe_succeeded")
	.dwattr $C$DW$975, DW_AT_TI_symbol_name("probe_succeeded")
	.dwattr $C$DW$975, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$975, DW_AT_bit_size(0x01)
	.dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$975, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$975, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$975, DW_AT_decl_column(0x12)

$C$DW$976	.dwtag  DW_TAG_member
	.dwattr $C$DW$976, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$976, DW_AT_name("soft_limit")
	.dwattr $C$DW$976, DW_AT_TI_symbol_name("soft_limit")
	.dwattr $C$DW$976, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$976, DW_AT_bit_size(0x01)
	.dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$976, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$976, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$976, DW_AT_decl_column(0x12)

$C$DW$977	.dwtag  DW_TAG_member
	.dwattr $C$DW$977, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$977, DW_AT_name("exit")
	.dwattr $C$DW$977, DW_AT_TI_symbol_name("exit")
	.dwattr $C$DW$977, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$977, DW_AT_bit_size(0x01)
	.dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$977, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$977, DW_AT_decl_line(0xce)
	.dwattr $C$DW$977, DW_AT_decl_column(0x12)

$C$DW$978	.dwtag  DW_TAG_member
	.dwattr $C$DW$978, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$978, DW_AT_name("block_delete_enabled")
	.dwattr $C$DW$978, DW_AT_TI_symbol_name("block_delete_enabled")
	.dwattr $C$DW$978, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$978, DW_AT_bit_size(0x01)
	.dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$978, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$978, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$978, DW_AT_decl_column(0x12)

$C$DW$979	.dwtag  DW_TAG_member
	.dwattr $C$DW$979, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$979, DW_AT_name("feed_hold_pending")
	.dwattr $C$DW$979, DW_AT_TI_symbol_name("feed_hold_pending")
	.dwattr $C$DW$979, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$979, DW_AT_bit_size(0x01)
	.dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$979, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$979, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$979, DW_AT_decl_column(0x12)

$C$DW$980	.dwtag  DW_TAG_member
	.dwattr $C$DW$980, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$980, DW_AT_name("delay_overrides")
	.dwattr $C$DW$980, DW_AT_TI_symbol_name("delay_overrides")
	.dwattr $C$DW$980, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$980, DW_AT_bit_size(0x01)
	.dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$980, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$980, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$980, DW_AT_decl_column(0x12)

$C$DW$981	.dwtag  DW_TAG_member
	.dwattr $C$DW$981, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$981, DW_AT_name("optional_stop_disable")
	.dwattr $C$DW$981, DW_AT_TI_symbol_name("optional_stop_disable")
	.dwattr $C$DW$981, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$981, DW_AT_bit_size(0x01)
	.dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$981, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$981, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$981, DW_AT_decl_column(0x12)

$C$DW$982	.dwtag  DW_TAG_member
	.dwattr $C$DW$982, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$982, DW_AT_name("single_block")
	.dwattr $C$DW$982, DW_AT_TI_symbol_name("single_block")
	.dwattr $C$DW$982, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$982, DW_AT_bit_size(0x01)
	.dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$982, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$982, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$982, DW_AT_decl_column(0x12)

$C$DW$983	.dwtag  DW_TAG_member
	.dwattr $C$DW$983, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$983, DW_AT_name("keep_input")
	.dwattr $C$DW$983, DW_AT_TI_symbol_name("keep_input")
	.dwattr $C$DW$983, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$983, DW_AT_bit_size(0x01)
	.dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$983, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$983, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$983, DW_AT_decl_column(0x12)

$C$DW$984	.dwtag  DW_TAG_member
	.dwattr $C$DW$984, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$984, DW_AT_name("unused")
	.dwattr $C$DW$984, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$984, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$984, DW_AT_bit_size(0x06)
	.dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$984, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$984, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$984, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$74, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$74


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x01)
$C$DW$985	.dwtag  DW_TAG_member
	.dwattr $C$DW$985, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$985, DW_AT_name("end_motion")
	.dwattr $C$DW$985, DW_AT_TI_symbol_name("end_motion")
	.dwattr $C$DW$985, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$985, DW_AT_bit_size(0x01)
	.dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$985, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$985, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$985, DW_AT_decl_column(0x11)

$C$DW$986	.dwtag  DW_TAG_member
	.dwattr $C$DW$986, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$986, DW_AT_name("execute_hold")
	.dwattr $C$DW$986, DW_AT_TI_symbol_name("execute_hold")
	.dwattr $C$DW$986, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$986, DW_AT_bit_size(0x01)
	.dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$986, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$986, DW_AT_decl_line(0x70)
	.dwattr $C$DW$986, DW_AT_decl_column(0x11)

$C$DW$987	.dwtag  DW_TAG_member
	.dwattr $C$DW$987, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$987, DW_AT_name("execute_sys_motion")
	.dwattr $C$DW$987, DW_AT_TI_symbol_name("execute_sys_motion")
	.dwattr $C$DW$987, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$987, DW_AT_bit_size(0x01)
	.dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$987, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$987, DW_AT_decl_line(0x71)
	.dwattr $C$DW$987, DW_AT_decl_column(0x11)

$C$DW$988	.dwtag  DW_TAG_member
	.dwattr $C$DW$988, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$988, DW_AT_name("update_spindle_rpm")
	.dwattr $C$DW$988, DW_AT_TI_symbol_name("update_spindle_rpm")
	.dwattr $C$DW$988, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$988, DW_AT_bit_size(0x01)
	.dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$988, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$988, DW_AT_decl_line(0x72)
	.dwattr $C$DW$988, DW_AT_decl_column(0x11)

$C$DW$989	.dwtag  DW_TAG_member
	.dwattr $C$DW$989, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$989, DW_AT_name("unassigned")
	.dwattr $C$DW$989, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$989, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$989, DW_AT_bit_size(0x04)
	.dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$989, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$989, DW_AT_decl_line(0x73)
	.dwattr $C$DW$989, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$75, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$75


$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
$C$DW$990	.dwtag  DW_TAG_member
	.dwattr $C$DW$990, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$990, DW_AT_name("enabled")
	.dwattr $C$DW$990, DW_AT_TI_symbol_name("enabled")
	.dwattr $C$DW$990, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$990, DW_AT_bit_size(0x01)
	.dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$990, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$990, DW_AT_decl_line(0x93)
	.dwattr $C$DW$990, DW_AT_decl_column(0x11)

$C$DW$991	.dwtag  DW_TAG_member
	.dwattr $C$DW$991, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$991, DW_AT_name("initiate")
	.dwattr $C$DW$991, DW_AT_TI_symbol_name("initiate")
	.dwattr $C$DW$991, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$991, DW_AT_bit_size(0x01)
	.dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$991, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$991, DW_AT_decl_line(0x94)
	.dwattr $C$DW$991, DW_AT_decl_column(0x11)

$C$DW$992	.dwtag  DW_TAG_member
	.dwattr $C$DW$992, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$992, DW_AT_name("restore")
	.dwattr $C$DW$992, DW_AT_TI_symbol_name("restore")
	.dwattr $C$DW$992, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$992, DW_AT_bit_size(0x01)
	.dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$992, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$992, DW_AT_decl_line(0x95)
	.dwattr $C$DW$992, DW_AT_decl_column(0x11)

$C$DW$993	.dwtag  DW_TAG_member
	.dwattr $C$DW$993, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$993, DW_AT_name("restore_cycle")
	.dwattr $C$DW$993, DW_AT_TI_symbol_name("restore_cycle")
	.dwattr $C$DW$993, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$993, DW_AT_bit_size(0x01)
	.dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$993, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$993, DW_AT_decl_line(0x96)
	.dwattr $C$DW$993, DW_AT_decl_column(0x11)

$C$DW$994	.dwtag  DW_TAG_member
	.dwattr $C$DW$994, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$994, DW_AT_name("unassigned")
	.dwattr $C$DW$994, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$994, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$994, DW_AT_bit_size(0x04)
	.dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$994, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$994, DW_AT_decl_line(0x97)
	.dwattr $C$DW$994, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$76, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$76


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x05)
$C$DW$995	.dwtag  DW_TAG_member
	.dwattr $C$DW$995, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$995, DW_AT_name("feed_rate")
	.dwattr $C$DW$995, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$995, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$995, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$995, DW_AT_decl_column(0x0d)

$C$DW$996	.dwtag  DW_TAG_member
	.dwattr $C$DW$996, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$996, DW_AT_name("rapid_rate")
	.dwattr $C$DW$996, DW_AT_TI_symbol_name("rapid_rate")
	.dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$996, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$996, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$996, DW_AT_decl_column(0x0d)

$C$DW$997	.dwtag  DW_TAG_member
	.dwattr $C$DW$997, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$997, DW_AT_name("spindle_rpm")
	.dwattr $C$DW$997, DW_AT_TI_symbol_name("spindle_rpm")
	.dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$997, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$997, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$997, DW_AT_decl_column(0x0d)

$C$DW$998	.dwtag  DW_TAG_member
	.dwattr $C$DW$998, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$998, DW_AT_name("spindle_stop")
	.dwattr $C$DW$998, DW_AT_TI_symbol_name("spindle_stop")
	.dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$998, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$998, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$998, DW_AT_decl_column(0x14)

$C$DW$999	.dwtag  DW_TAG_member
	.dwattr $C$DW$999, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$999, DW_AT_name("control")
	.dwattr $C$DW$999, DW_AT_TI_symbol_name("control")
	.dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$999, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$999, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$999, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$78, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$78

$C$DW$T$342	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$342, DW_AT_name("overrides_t")
	.dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$342, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x03)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x04)
$C$DW$1000	.dwtag  DW_TAG_member
	.dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1000, DW_AT_name("mpg_mode")
	.dwattr $C$DW$1000, DW_AT_TI_symbol_name("mpg_mode")
	.dwattr $C$DW$1000, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$1000, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1000, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1000, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1000, DW_AT_decl_column(0x12)

$C$DW$1001	.dwtag  DW_TAG_member
	.dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1001, DW_AT_name("scaling")
	.dwattr $C$DW$1001, DW_AT_TI_symbol_name("scaling")
	.dwattr $C$DW$1001, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$1001, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1001, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1001, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1001, DW_AT_decl_column(0x12)

$C$DW$1002	.dwtag  DW_TAG_member
	.dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1002, DW_AT_name("homed")
	.dwattr $C$DW$1002, DW_AT_TI_symbol_name("homed")
	.dwattr $C$DW$1002, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$1002, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1002, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1002, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1002, DW_AT_decl_column(0x12)

$C$DW$1003	.dwtag  DW_TAG_member
	.dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1003, DW_AT_name("xmode")
	.dwattr $C$DW$1003, DW_AT_TI_symbol_name("xmode")
	.dwattr $C$DW$1003, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$1003, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1003, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1003, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1003, DW_AT_decl_column(0x12)

$C$DW$1004	.dwtag  DW_TAG_member
	.dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1004, DW_AT_name("spindle")
	.dwattr $C$DW$1004, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1004, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$1004, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1004, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1004, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1004, DW_AT_decl_column(0x12)

$C$DW$1005	.dwtag  DW_TAG_member
	.dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1005, DW_AT_name("coolant")
	.dwattr $C$DW$1005, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1005, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$1005, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1005, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1005, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$1005, DW_AT_decl_column(0x12)

$C$DW$1006	.dwtag  DW_TAG_member
	.dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1006, DW_AT_name("overrides")
	.dwattr $C$DW$1006, DW_AT_TI_symbol_name("overrides")
	.dwattr $C$DW$1006, DW_AT_bit_offset(0x19)
	.dwattr $C$DW$1006, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1006, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1006, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1006, DW_AT_decl_column(0x12)

$C$DW$1007	.dwtag  DW_TAG_member
	.dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1007, DW_AT_name("tool")
	.dwattr $C$DW$1007, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$1007, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$1007, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1007, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1007, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$1007, DW_AT_decl_column(0x12)

$C$DW$1008	.dwtag  DW_TAG_member
	.dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1008, DW_AT_name("wco")
	.dwattr $C$DW$1008, DW_AT_TI_symbol_name("wco")
	.dwattr $C$DW$1008, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$1008, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1008, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1008, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1008, DW_AT_decl_column(0x12)

$C$DW$1009	.dwtag  DW_TAG_member
	.dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1009, DW_AT_name("gwco")
	.dwattr $C$DW$1009, DW_AT_TI_symbol_name("gwco")
	.dwattr $C$DW$1009, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$1009, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1009, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1009, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1009, DW_AT_decl_column(0x12)

$C$DW$1010	.dwtag  DW_TAG_member
	.dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1010, DW_AT_name("tool_offset")
	.dwattr $C$DW$1010, DW_AT_TI_symbol_name("tool_offset")
	.dwattr $C$DW$1010, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$1010, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1010, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1010, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1010, DW_AT_decl_column(0x12)

$C$DW$1011	.dwtag  DW_TAG_member
	.dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1011, DW_AT_name("m66result")
	.dwattr $C$DW$1011, DW_AT_TI_symbol_name("m66result")
	.dwattr $C$DW$1011, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$1011, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1011, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1011, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1011, DW_AT_decl_column(0x12)

$C$DW$1012	.dwtag  DW_TAG_member
	.dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1012, DW_AT_name("pwm")
	.dwattr $C$DW$1012, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$1012, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$1012, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1012, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1012, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1012, DW_AT_decl_column(0x12)

$C$DW$1013	.dwtag  DW_TAG_member
	.dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1013, DW_AT_name("motor")
	.dwattr $C$DW$1013, DW_AT_TI_symbol_name("motor")
	.dwattr $C$DW$1013, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$1013, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1013, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1013, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1013, DW_AT_decl_column(0x12)

$C$DW$1014	.dwtag  DW_TAG_member
	.dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1014, DW_AT_name("encoder")
	.dwattr $C$DW$1014, DW_AT_TI_symbol_name("encoder")
	.dwattr $C$DW$1014, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$1014, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1014, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1014, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$1014, DW_AT_decl_column(0x12)

$C$DW$1015	.dwtag  DW_TAG_member
	.dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1015, DW_AT_name("tlo_reference")
	.dwattr $C$DW$1015, DW_AT_TI_symbol_name("tlo_reference")
	.dwattr $C$DW$1015, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$1015, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1015, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1015, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1015, DW_AT_decl_column(0x12)

$C$DW$1016	.dwtag  DW_TAG_member
	.dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1016, DW_AT_name("fan")
	.dwattr $C$DW$1016, DW_AT_TI_symbol_name("fan")
	.dwattr $C$DW$1016, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1016, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1016, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1016, DW_AT_decl_line(0xba)
	.dwattr $C$DW$1016, DW_AT_decl_column(0x12)

$C$DW$1017	.dwtag  DW_TAG_member
	.dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1017, DW_AT_name("unassigned")
	.dwattr $C$DW$1017, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1017, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1017, DW_AT_bit_size(0x0e)
	.dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1017, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1017, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1017, DW_AT_decl_column(0x12)

$C$DW$1018	.dwtag  DW_TAG_member
	.dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1018, DW_AT_name("all")
	.dwattr $C$DW$1018, DW_AT_TI_symbol_name("all")
	.dwattr $C$DW$1018, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1018, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1018, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1018, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$1018, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$79, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$79


$C$DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x02)
$C$DW$1019	.dwtag  DW_TAG_member
	.dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1019, DW_AT_name("reset")
	.dwattr $C$DW$1019, DW_AT_TI_symbol_name("reset")
	.dwattr $C$DW$1019, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1019, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1019, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1019, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1019, DW_AT_decl_column(0x12)

$C$DW$1020	.dwtag  DW_TAG_member
	.dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1020, DW_AT_name("feed_hold")
	.dwattr $C$DW$1020, DW_AT_TI_symbol_name("feed_hold")
	.dwattr $C$DW$1020, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1020, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1020, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1020, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1020, DW_AT_decl_column(0x12)

$C$DW$1021	.dwtag  DW_TAG_member
	.dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1021, DW_AT_name("cycle_start")
	.dwattr $C$DW$1021, DW_AT_TI_symbol_name("cycle_start")
	.dwattr $C$DW$1021, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1021, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1021, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1021, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1021, DW_AT_decl_column(0x12)

$C$DW$1022	.dwtag  DW_TAG_member
	.dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1022, DW_AT_name("safety_door_ajar")
	.dwattr $C$DW$1022, DW_AT_TI_symbol_name("safety_door_ajar")
	.dwattr $C$DW$1022, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1022, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1022, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1022, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1022, DW_AT_decl_column(0x12)

$C$DW$1023	.dwtag  DW_TAG_member
	.dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1023, DW_AT_name("block_delete")
	.dwattr $C$DW$1023, DW_AT_TI_symbol_name("block_delete")
	.dwattr $C$DW$1023, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1023, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1023, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1023, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1023, DW_AT_decl_column(0x12)

$C$DW$1024	.dwtag  DW_TAG_member
	.dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1024, DW_AT_name("stop_disable")
	.dwattr $C$DW$1024, DW_AT_TI_symbol_name("stop_disable")
	.dwattr $C$DW$1024, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1024, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1024, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1024, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1024, DW_AT_decl_column(0x12)

$C$DW$1025	.dwtag  DW_TAG_member
	.dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1025, DW_AT_name("e_stop")
	.dwattr $C$DW$1025, DW_AT_TI_symbol_name("e_stop")
	.dwattr $C$DW$1025, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1025, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1025, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1025, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1025, DW_AT_decl_column(0x12)

$C$DW$1026	.dwtag  DW_TAG_member
	.dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1026, DW_AT_name("probe_disconnected")
	.dwattr $C$DW$1026, DW_AT_TI_symbol_name("probe_disconnected")
	.dwattr $C$DW$1026, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1026, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1026, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1026, DW_AT_decl_line(0x83)
	.dwattr $C$DW$1026, DW_AT_decl_column(0x12)

$C$DW$1027	.dwtag  DW_TAG_member
	.dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1027, DW_AT_name("motor_fault")
	.dwattr $C$DW$1027, DW_AT_TI_symbol_name("motor_fault")
	.dwattr $C$DW$1027, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1027, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1027, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1027, DW_AT_decl_line(0x84)
	.dwattr $C$DW$1027, DW_AT_decl_column(0x12)

$C$DW$1028	.dwtag  DW_TAG_member
	.dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1028, DW_AT_name("motor_warning")
	.dwattr $C$DW$1028, DW_AT_TI_symbol_name("motor_warning")
	.dwattr $C$DW$1028, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1028, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1028, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1028, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1028, DW_AT_decl_column(0x12)

$C$DW$1029	.dwtag  DW_TAG_member
	.dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1029, DW_AT_name("limits_override")
	.dwattr $C$DW$1029, DW_AT_TI_symbol_name("limits_override")
	.dwattr $C$DW$1029, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1029, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1029, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1029, DW_AT_decl_line(0x86)
	.dwattr $C$DW$1029, DW_AT_decl_column(0x12)

$C$DW$1030	.dwtag  DW_TAG_member
	.dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1030, DW_AT_name("single_block")
	.dwattr $C$DW$1030, DW_AT_TI_symbol_name("single_block")
	.dwattr $C$DW$1030, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1030, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1030, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1030, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1030, DW_AT_decl_column(0x12)

$C$DW$1031	.dwtag  DW_TAG_member
	.dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1031, DW_AT_name("unassigned")
	.dwattr $C$DW$1031, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1031, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1031, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1031, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1031, DW_AT_decl_line(0x88)
	.dwattr $C$DW$1031, DW_AT_decl_column(0x12)

$C$DW$1032	.dwtag  DW_TAG_member
	.dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1032, DW_AT_name("probe_triggered")
	.dwattr $C$DW$1032, DW_AT_TI_symbol_name("probe_triggered")
	.dwattr $C$DW$1032, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1032, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1032, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1032, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1032, DW_AT_decl_column(0x12)

$C$DW$1033	.dwtag  DW_TAG_member
	.dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1033, DW_AT_name("deasserted")
	.dwattr $C$DW$1033, DW_AT_TI_symbol_name("deasserted")
	.dwattr $C$DW$1033, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1033, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1033, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1033, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1033, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$80, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$80


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x04)
$C$DW$1034	.dwtag  DW_TAG_member
	.dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1034, DW_AT_name("min")
	.dwattr $C$DW$1034, DW_AT_TI_symbol_name("min")
	.dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1034, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1034, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1034, DW_AT_decl_column(0x14)

$C$DW$1035	.dwtag  DW_TAG_member
	.dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1035, DW_AT_name("max")
	.dwattr $C$DW$1035, DW_AT_TI_symbol_name("max")
	.dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1035, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1035, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1035, DW_AT_decl_column(0x14)

$C$DW$1036	.dwtag  DW_TAG_member
	.dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1036, DW_AT_name("min2")
	.dwattr $C$DW$1036, DW_AT_TI_symbol_name("min2")
	.dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1036, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1036, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$1036, DW_AT_decl_column(0x14)

$C$DW$1037	.dwtag  DW_TAG_member
	.dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1037, DW_AT_name("max2")
	.dwattr $C$DW$1037, DW_AT_TI_symbol_name("max2")
	.dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1037, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1037, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1037, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$82, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$82

$C$DW$T$84	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$84, DW_AT_name("limit_signals_t")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$84, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$84, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$84, DW_AT_decl_column(0x03)


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x06)
$C$DW$1038	.dwtag  DW_TAG_member
	.dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$1038, DW_AT_name("control")
	.dwattr $C$DW$1038, DW_AT_TI_symbol_name("control")
	.dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1038, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1038, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1038, DW_AT_decl_column(0x17)

$C$DW$1039	.dwtag  DW_TAG_member
	.dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$1039, DW_AT_name("limits")
	.dwattr $C$DW$1039, DW_AT_TI_symbol_name("limits")
	.dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1039, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1039, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$1039, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$85, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$85

$C$DW$T$353	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$353, DW_AT_name("signal_event_t")
	.dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$353, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$353, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$T$353, DW_AT_decl_column(0x03)


$C$DW$T$88	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$88, DW_AT_byte_size(0x12)
$C$DW$1040	.dwtag  DW_TAG_member
	.dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1040, DW_AT_name("feed_rate")
	.dwattr $C$DW$1040, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1040, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1040, DW_AT_decl_line(0x22e)
	.dwattr $C$DW$1040, DW_AT_decl_column(0x0b)

$C$DW$1041	.dwtag  DW_TAG_member
	.dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1041, DW_AT_name("seek_rate")
	.dwattr $C$DW$1041, DW_AT_TI_symbol_name("seek_rate")
	.dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1041, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1041, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$1041, DW_AT_decl_column(0x0b)

$C$DW$1042	.dwtag  DW_TAG_member
	.dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1042, DW_AT_name("pulloff_rate")
	.dwattr $C$DW$1042, DW_AT_TI_symbol_name("pulloff_rate")
	.dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1042, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1042, DW_AT_decl_line(0x230)
	.dwattr $C$DW$1042, DW_AT_decl_column(0x0b)

$C$DW$1043	.dwtag  DW_TAG_member
	.dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1043, DW_AT_name("probing_distance")
	.dwattr $C$DW$1043, DW_AT_TI_symbol_name("probing_distance")
	.dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1043, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1043, DW_AT_decl_line(0x231)
	.dwattr $C$DW$1043, DW_AT_decl_column(0x0b)

$C$DW$1044	.dwtag  DW_TAG_member
	.dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$1044, DW_AT_name("mode")
	.dwattr $C$DW$1044, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1044, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1044, DW_AT_decl_line(0x232)
	.dwattr $C$DW$1044, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$88, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0x22d)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$88

$C$DW$T$123	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$123, DW_AT_name("tool_change_settings_t")
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$123, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x03)


$C$DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x14)
$C$DW$1045	.dwtag  DW_TAG_member
	.dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1045, DW_AT_name("steps_per_mm")
	.dwattr $C$DW$1045, DW_AT_TI_symbol_name("steps_per_mm")
	.dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1045, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1045, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$1045, DW_AT_decl_column(0x0b)

$C$DW$1046	.dwtag  DW_TAG_member
	.dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1046, DW_AT_name("max_rate")
	.dwattr $C$DW$1046, DW_AT_TI_symbol_name("max_rate")
	.dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1046, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1046, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$1046, DW_AT_decl_column(0x0b)

$C$DW$1047	.dwtag  DW_TAG_member
	.dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1047, DW_AT_name("acceleration")
	.dwattr $C$DW$1047, DW_AT_TI_symbol_name("acceleration")
	.dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1047, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1047, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$1047, DW_AT_decl_column(0x0b)

$C$DW$1048	.dwtag  DW_TAG_member
	.dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1048, DW_AT_name("max_travel")
	.dwattr $C$DW$1048, DW_AT_TI_symbol_name("max_travel")
	.dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1048, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1048, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$1048, DW_AT_decl_column(0x0b)

$C$DW$1049	.dwtag  DW_TAG_member
	.dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1049, DW_AT_name("dual_axis_offset")
	.dwattr $C$DW$1049, DW_AT_TI_symbol_name("dual_axis_offset")
	.dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1049, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1049, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$1049, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$89

$C$DW$T$124	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$124, DW_AT_name("axis_settings_t")
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$124, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$124, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$T$124, DW_AT_decl_column(0x03)


$C$DW$T$125	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$125, DW_AT_byte_size(0x3c)
$C$DW$1050	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1050, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$125


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x0c)
$C$DW$1051	.dwtag  DW_TAG_member
	.dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1051, DW_AT_name("rpm")
	.dwattr $C$DW$1051, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1051, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1051, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$1051, DW_AT_decl_column(0x0b)

$C$DW$1052	.dwtag  DW_TAG_member
	.dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1052, DW_AT_name("start")
	.dwattr $C$DW$1052, DW_AT_TI_symbol_name("start")
	.dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1052, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1052, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1052, DW_AT_decl_column(0x0b)

$C$DW$1053	.dwtag  DW_TAG_member
	.dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1053, DW_AT_name("end")
	.dwattr $C$DW$1053, DW_AT_TI_symbol_name("end")
	.dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1053, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1053, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1053, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$90

$C$DW$T$93	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$93, DW_AT_name("pwm_piece_t")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$93, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$93, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$93, DW_AT_decl_column(0x03)


$C$DW$T$94	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$94, DW_AT_byte_size(0x30)
$C$DW$1054	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1054, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$94


$C$DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x20)
$C$DW$1055	.dwtag  DW_TAG_member
	.dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1055, DW_AT_name("p_gain")
	.dwattr $C$DW$1055, DW_AT_TI_symbol_name("p_gain")
	.dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1055, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1055, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1055, DW_AT_decl_column(0x0b)

$C$DW$1056	.dwtag  DW_TAG_member
	.dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1056, DW_AT_name("i_gain")
	.dwattr $C$DW$1056, DW_AT_TI_symbol_name("i_gain")
	.dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1056, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1056, DW_AT_decl_line(0x198)
	.dwattr $C$DW$1056, DW_AT_decl_column(0x0b)

$C$DW$1057	.dwtag  DW_TAG_member
	.dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1057, DW_AT_name("d_gain")
	.dwattr $C$DW$1057, DW_AT_TI_symbol_name("d_gain")
	.dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1057, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1057, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1057, DW_AT_decl_column(0x0b)

$C$DW$1058	.dwtag  DW_TAG_member
	.dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1058, DW_AT_name("p_max_error")
	.dwattr $C$DW$1058, DW_AT_TI_symbol_name("p_max_error")
	.dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1058, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1058, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$1058, DW_AT_decl_column(0x0b)

$C$DW$1059	.dwtag  DW_TAG_member
	.dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1059, DW_AT_name("i_max_error")
	.dwattr $C$DW$1059, DW_AT_TI_symbol_name("i_max_error")
	.dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1059, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1059, DW_AT_decl_line(0x19b)
