;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed May 31 19:52:35 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../grbl/protocol.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("gc_state")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("gc_state")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$385)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x202)
	.dwattr $C$DW$1, DW_AT_decl_column(0x17)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("sys")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("sys")
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$1041)

	.dwattr $C$DW$1087, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$1087, DW_AT_const_value(0x2d)
	.dwattr $C$DW$1087, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1087, DW_AT_decl_line(0x54)
	.dwattr $C$DW$1087, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$793, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$793, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$793, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$793

$C$DW$T$794	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$794, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$794, DW_AT_type(*$C$DW$T$793)
	.dwattr $C$DW$T$794, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$794, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$794, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$794, DW_AT_decl_column(0x03)


$C$DW$T$795	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$795, DW_AT_byte_size(0x02)
$C$DW$1088	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1088, DW_AT_name("Message_Plain")
	.dwattr $C$DW$1088, DW_AT_const_value(0x00)
	.dwattr $C$DW$1088, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1088, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1088, DW_AT_decl_column(0x05)

$C$DW$1089	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1089, DW_AT_name("Message_Info")
	.dwattr $C$DW$1089, DW_AT_const_value(0x01)
	.dwattr $C$DW$1089, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1089, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1089, DW_AT_decl_column(0x05)

$C$DW$1090	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1090, DW_AT_name("Message_Warning")
	.dwattr $C$DW$1090, DW_AT_const_value(0x02)
	.dwattr $C$DW$1090, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1090, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1090, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$795, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$795, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$795, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$795

$C$DW$T$796	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$796, DW_AT_name("message_type_t")
	.dwattr $C$DW$T$796, DW_AT_type(*$C$DW$T$795)
	.dwattr $C$DW$T$796, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$796, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$796, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$796, DW_AT_decl_column(0x03)


$C$DW$T$797	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$797, DW_AT_byte_size(0x02)
$C$DW$1091	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1091, DW_AT_name("SettingsFormat_MachineReadable")
	.dwattr $C$DW$1091, DW_AT_const_value(0x00)
	.dwattr $C$DW$1091, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1091, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1091, DW_AT_decl_column(0x05)

$C$DW$1092	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1092, DW_AT_name("SettingsFormat_HumanReadable")
	.dwattr $C$DW$1092, DW_AT_const_value(0x01)
	.dwattr $C$DW$1092, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1092, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1092, DW_AT_decl_column(0x05)

$C$DW$1093	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1093, DW_AT_name("SettingsFormat_Grbl")
	.dwattr $C$DW$1093, DW_AT_const_value(0x02)
	.dwattr $C$DW$1093, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1093, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1093, DW_AT_decl_column(0x05)

$C$DW$1094	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1094, DW_AT_name("SettingsFormat_grblHAL")
	.dwattr $C$DW$1094, DW_AT_const_value(0x03)
	.dwattr $C$DW$1094, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1094, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1094, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$797, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$797, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$797, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$797

$C$DW$T$798	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$798, DW_AT_name("settings_format_t")
	.dwattr $C$DW$T$798, DW_AT_type(*$C$DW$T$797)
	.dwattr $C$DW$T$798, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$798, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$798, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$798, DW_AT_decl_column(0x03)


$C$DW$T$799	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$799, DW_AT_byte_size(0x02)
$C$DW$1095	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1095, DW_AT_name("PullMode_None")
	.dwattr $C$DW$1095, DW_AT_const_value(0x00)
	.dwattr $C$DW$1095, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1095, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1095, DW_AT_decl_column(0x05)

$C$DW$1096	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1096, DW_AT_name("PullMode_Up")
	.dwattr $C$DW$1096, DW_AT_const_value(0x01)
	.dwattr $C$DW$1096, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1096, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1096, DW_AT_decl_column(0x05)

$C$DW$1097	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1097, DW_AT_name("PullMode_Down")
	.dwattr $C$DW$1097, DW_AT_const_value(0x02)
	.dwattr $C$DW$1097, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1097, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1097, DW_AT_decl_column(0x05)

$C$DW$1098	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1098, DW_AT_name("PullMode_UpDown")
	.dwattr $C$DW$1098, DW_AT_const_value(0x03)
	.dwattr $C$DW$1098, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1098, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1098, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$799, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$799, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$799, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$799

$C$DW$T$800	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$800, DW_AT_name("pull_mode_t")
	.dwattr $C$DW$T$800, DW_AT_type(*$C$DW$T$799)
	.dwattr $C$DW$T$800, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$800, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$800, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$800, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$1099	.dwtag  DW_TAG_member
	.dwattr $C$DW$1099, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1099, DW_AT_name("flood")
	.dwattr $C$DW$1099, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$1099, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1099, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1099, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1099, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1099, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$1099, DW_AT_decl_column(0x11)

$C$DW$1100	.dwtag  DW_TAG_member
	.dwattr $C$DW$1100, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1100, DW_AT_name("mist")
	.dwattr $C$DW$1100, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$1100, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1100, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1100, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1100, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$1100, DW_AT_decl_column(0x11)

$C$DW$1101	.dwtag  DW_TAG_member
	.dwattr $C$DW$1101, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1101, DW_AT_name("shower")
	.dwattr $C$DW$1101, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$1101, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1101, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1101, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1101, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1101, DW_AT_decl_column(0x11)

$C$DW$1102	.dwtag  DW_TAG_member
	.dwattr $C$DW$1102, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1102, DW_AT_name("trough_spindle")
	.dwattr $C$DW$1102, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$1102, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1102, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1102, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1102, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1102, DW_AT_decl_column(0x11)

$C$DW$1103	.dwtag  DW_TAG_member
	.dwattr $C$DW$1103, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1103, DW_AT_name("unused")
	.dwattr $C$DW$1103, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$1103, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1103, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1103, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1103, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1103, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
$C$DW$1104	.dwtag  DW_TAG_member
	.dwattr $C$DW$1104, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1104, DW_AT_name("x")
	.dwattr $C$DW$1104, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1104, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1104, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1104, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1104, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1104, DW_AT_decl_column(0x11)

$C$DW$1105	.dwtag  DW_TAG_member
	.dwattr $C$DW$1105, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1105, DW_AT_name("y")
	.dwattr $C$DW$1105, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1105, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1105, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1105, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1105, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1105, DW_AT_decl_column(0x11)

$C$DW$1106	.dwtag  DW_TAG_member
	.dwattr $C$DW$1106, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1106, DW_AT_name("z")
	.dwattr $C$DW$1106, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1106, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1106, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1106, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1106, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1106, DW_AT_decl_column(0x11)

$C$DW$1107	.dwtag  DW_TAG_member
	.dwattr $C$DW$1107, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1107, DW_AT_name("a")
	.dwattr $C$DW$1107, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1107, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1107, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1107, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1107, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1107, DW_AT_decl_column(0x11)

$C$DW$1108	.dwtag  DW_TAG_member
	.dwattr $C$DW$1108, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1108, DW_AT_name("b")
	.dwattr $C$DW$1108, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$1108, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1108, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1108, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1108, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1108, DW_AT_decl_column(0x11)

$C$DW$1109	.dwtag  DW_TAG_member
	.dwattr $C$DW$1109, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1109, DW_AT_name("c")
	.dwattr $C$DW$1109, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$1109, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1109, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1109, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1109, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1109, DW_AT_decl_column(0x11)

$C$DW$1110	.dwtag  DW_TAG_member
	.dwattr $C$DW$1110, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1110, DW_AT_name("u")
	.dwattr $C$DW$1110, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$1110, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1110, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1110, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1110, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1110, DW_AT_decl_column(0x11)

$C$DW$1111	.dwtag  DW_TAG_member
	.dwattr $C$DW$1111, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1111, DW_AT_name("v")
	.dwattr $C$DW$1111, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$1111, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1111, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1111, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1111, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1111, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$25


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
$C$DW$1112	.dwtag  DW_TAG_member
	.dwattr $C$DW$1112, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1112, DW_AT_name("on")
	.dwattr $C$DW$1112, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$1112, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1112, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1112, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1112, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1112, DW_AT_decl_column(0x11)

$C$DW$1113	.dwtag  DW_TAG_member
	.dwattr $C$DW$1113, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1113, DW_AT_name("ccw")
	.dwattr $C$DW$1113, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$1113, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1113, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1113, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1113, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1113, DW_AT_decl_column(0x11)

$C$DW$1114	.dwtag  DW_TAG_member
	.dwattr $C$DW$1114, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1114, DW_AT_name("pwm")
	.dwattr $C$DW$1114, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$1114, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1114, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1114, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1114, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1114, DW_AT_decl_column(0x11)

$C$DW$1115	.dwtag  DW_TAG_member
	.dwattr $C$DW$1115, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1115, DW_AT_name("reserved3")
	.dwattr $C$DW$1115, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$1115, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1115, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1115, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1115, DW_AT_decl_line(0x22)
	.dwattr $C$DW$1115, DW_AT_decl_column(0x11)

$C$DW$1116	.dwtag  DW_TAG_member
	.dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1116, DW_AT_name("reserved4")
	.dwattr $C$DW$1116, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$1116, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1116, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1116, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1116, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1116, DW_AT_decl_column(0x11)

$C$DW$1117	.dwtag  DW_TAG_member
	.dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1117, DW_AT_name("encoder_error")
	.dwattr $C$DW$1117, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$1117, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1117, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1117, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1117, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1117, DW_AT_decl_column(0x11)

$C$DW$1118	.dwtag  DW_TAG_member
	.dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1118, DW_AT_name("at_speed")
	.dwattr $C$DW$1118, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$1118, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1118, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1118, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1118, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1118, DW_AT_decl_column(0x11)

$C$DW$1119	.dwtag  DW_TAG_member
	.dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1119, DW_AT_name("synchronized")
	.dwattr $C$DW$1119, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$1119, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1119, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1119, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1119, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1119, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$26, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$26


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
$C$DW$1120	.dwtag  DW_TAG_member
	.dwattr $C$DW$1120, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1120, DW_AT_name("rapid_motion")
	.dwattr $C$DW$1120, DW_AT_TI_symbol_name("rapid_motion")
	.dwattr $C$DW$1120, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1120, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1120, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1120, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1120, DW_AT_decl_column(0x12)

$C$DW$1121	.dwtag  DW_TAG_member
	.dwattr $C$DW$1121, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1121, DW_AT_name("system_motion")
	.dwattr $C$DW$1121, DW_AT_TI_symbol_name("system_motion")
	.dwattr $C$DW$1121, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1121, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1121, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1121, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1121, DW_AT_decl_column(0x12)

$C$DW$1122	.dwtag  DW_TAG_member
	.dwattr $C$DW$1122, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1122, DW_AT_name("jog_motion")
	.dwattr $C$DW$1122, DW_AT_TI_symbol_name("jog_motion")
	.dwattr $C$DW$1122, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1122, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1122, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1122, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1122, DW_AT_decl_column(0x12)

$C$DW$1123	.dwtag  DW_TAG_member
	.dwattr $C$DW$1123, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1123, DW_AT_name("backlash_motion")
	.dwattr $C$DW$1123, DW_AT_TI_symbol_name("backlash_motion")
	.dwattr $C$DW$1123, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1123, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1123, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1123, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1123, DW_AT_decl_column(0x12)

$C$DW$1124	.dwtag  DW_TAG_member
	.dwattr $C$DW$1124, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1124, DW_AT_name("no_feed_override")
	.dwattr $C$DW$1124, DW_AT_TI_symbol_name("no_feed_override")
	.dwattr $C$DW$1124, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1124, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1124, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1124, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1124, DW_AT_decl_column(0x12)

$C$DW$1125	.dwtag  DW_TAG_member
	.dwattr $C$DW$1125, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1125, DW_AT_name("inverse_time")
	.dwattr $C$DW$1125, DW_AT_TI_symbol_name("inverse_time")
	.dwattr $C$DW$1125, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1125, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1125, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1125, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1125, DW_AT_decl_column(0x12)

$C$DW$1126	.dwtag  DW_TAG_member
	.dwattr $C$DW$1126, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1126, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1126, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1126, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1126, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1126, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1126, DW_AT_decl_line(0x29)
	.dwattr $C$DW$1126, DW_AT_decl_column(0x12)

$C$DW$1127	.dwtag  DW_TAG_member
	.dwattr $C$DW$1127, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1127, DW_AT_name("is_rpm_pos_adjusted")
	.dwattr $C$DW$1127, DW_AT_TI_symbol_name("is_rpm_pos_adjusted")
	.dwattr $C$DW$1127, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1127, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1127, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1127, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$1127, DW_AT_decl_column(0x12)

$C$DW$1128	.dwtag  DW_TAG_member
	.dwattr $C$DW$1128, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1128, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$1128, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$1128, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1128, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1128, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1128, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$1128, DW_AT_decl_column(0x12)

$C$DW$1129	.dwtag  DW_TAG_member
	.dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1129, DW_AT_name("unassigned")
	.dwattr $C$DW$1129, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1129, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1129, DW_AT_bit_size(0x07)
	.dwattr $C$DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1129, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1129, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1129, DW_AT_decl_column(0x12)

$C$DW$1130	.dwtag  DW_TAG_member
	.dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1130, DW_AT_name("spindle")
	.dwattr $C$DW$1130, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1130, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1130, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1130, DW_AT_decl_column(0x19)

$C$DW$1131	.dwtag  DW_TAG_member
	.dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1131, DW_AT_name("coolant")
	.dwattr $C$DW$1131, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1131, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$1131, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1131, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\grbl\planner.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$31


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
$C$DW$1132	.dwtag  DW_TAG_member
	.dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1132, DW_AT_name("feed_rate_disable")
	.dwattr $C$DW$1132, DW_AT_TI_symbol_name("feed_rate_disable")
	.dwattr $C$DW$1132, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1132, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1132, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1132, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1132, DW_AT_decl_column(0x11)

$C$DW$1133	.dwtag  DW_TAG_member
	.dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1133, DW_AT_name("feed_hold_disable")
	.dwattr $C$DW$1133, DW_AT_TI_symbol_name("feed_hold_disable")
	.dwattr $C$DW$1133, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1133, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1133, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1133, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1133, DW_AT_decl_column(0x11)

$C$DW$1134	.dwtag  DW_TAG_member
	.dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1134, DW_AT_name("spindle_rpm_disable")
	.dwattr $C$DW$1134, DW_AT_TI_symbol_name("spindle_rpm_disable")
	.dwattr $C$DW$1134, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1134, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1134, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1134, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1134, DW_AT_decl_column(0x11)

$C$DW$1135	.dwtag  DW_TAG_member
	.dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1135, DW_AT_name("parking_disable")
	.dwattr $C$DW$1135, DW_AT_TI_symbol_name("parking_disable")
	.dwattr $C$DW$1135, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1135, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1135, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1135, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1135, DW_AT_decl_column(0x11)

$C$DW$1136	.dwtag  DW_TAG_member
	.dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1136, DW_AT_name("reserved")
	.dwattr $C$DW$1136, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$1136, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1136, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1136, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1136, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1136, DW_AT_decl_column(0x11)

$C$DW$1137	.dwtag  DW_TAG_member
	.dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1137, DW_AT_name("sync")
	.dwattr $C$DW$1137, DW_AT_TI_symbol_name("sync")
	.dwattr $C$DW$1137, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1137, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1137, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1137, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1137, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$32


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
$C$DW$1138	.dwtag  DW_TAG_member
	.dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1138, DW_AT_name("surface_speed")
	.dwattr $C$DW$1138, DW_AT_TI_symbol_name("surface_speed")
	.dwattr $C$DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1138, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1138, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$1138, DW_AT_decl_column(0x0b)

$C$DW$1139	.dwtag  DW_TAG_member
	.dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1139, DW_AT_name("target_rpm")
	.dwattr $C$DW$1139, DW_AT_TI_symbol_name("target_rpm")
	.dwattr $C$DW$1139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1139, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1139, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$1139, DW_AT_decl_column(0x0b)

$C$DW$1140	.dwtag  DW_TAG_member
	.dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1140, DW_AT_name("max_rpm")
	.dwattr $C$DW$1140, DW_AT_TI_symbol_name("max_rpm")
	.dwattr $C$DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1140, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1140, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$1140, DW_AT_decl_column(0x0b)

$C$DW$1141	.dwtag  DW_TAG_member
	.dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1141, DW_AT_name("tool_offset")
	.dwattr $C$DW$1141, DW_AT_TI_symbol_name("tool_offset")
	.dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1141, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1141, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$1141, DW_AT_decl_column(0x0b)

$C$DW$1142	.dwtag  DW_TAG_member
	.dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$1142, DW_AT_name("axis")
	.dwattr $C$DW$1142, DW_AT_TI_symbol_name("axis")
	.dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1142, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1142, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$1142, DW_AT_decl_column(0x12)

$C$DW$1143	.dwtag  DW_TAG_member
	.dwattr $C$DW$1143, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1143, DW_AT_name("active")
	.dwattr $C$DW$1143, DW_AT_TI_symbol_name("active")
	.dwattr $C$DW$1143, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1143, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1143, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$1143, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$36, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$36

$C$DW$T$37	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$37, DW_AT_name("css_data_t")
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$37, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x03)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x18)
$C$DW$1144	.dwtag  DW_TAG_member
	.dwattr $C$DW$1144, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1144, DW_AT_name("rpm")
	.dwattr $C$DW$1144, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$1144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1144, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1144, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$1144, DW_AT_decl_column(0x0b)

$C$DW$1145	.dwtag  DW_TAG_member
	.dwattr $C$DW$1145, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$1145, DW_AT_name("css")
	.dwattr $C$DW$1145, DW_AT_TI_symbol_name("css")
	.dwattr $C$DW$1145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1145, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1145, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$1145, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$38, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$38

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("spindle_t")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$70, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x03)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
$C$DW$1146	.dwtag  DW_TAG_member
	.dwattr $C$DW$1146, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1146, DW_AT_name("min")
	.dwattr $C$DW$1146, DW_AT_TI_symbol_name("min")
	.dwattr $C$DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1146, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1146, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1146, DW_AT_decl_column(0x14)

$C$DW$1147	.dwtag  DW_TAG_member
	.dwattr $C$DW$1147, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1147, DW_AT_name("max")
	.dwattr $C$DW$1147, DW_AT_TI_symbol_name("max")
	.dwattr $C$DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1147, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1147, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1147, DW_AT_decl_column(0x14)

$C$DW$1148	.dwtag  DW_TAG_member
	.dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1148, DW_AT_name("min2")
	.dwattr $C$DW$1148, DW_AT_TI_symbol_name("min2")
	.dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1148, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1148, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$1148, DW_AT_decl_column(0x14)

$C$DW$1149	.dwtag  DW_TAG_member
	.dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1149, DW_AT_name("max2")
	.dwattr $C$DW$1149, DW_AT_TI_symbol_name("max2")
	.dwattr $C$DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1149, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1149, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1149, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$40

$C$DW$T$86	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$86, DW_AT_name("limit_signals_t")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x03)


$C$DW$T$265	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$265, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$265, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$265

$C$DW$T$266	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$265)
	.dwattr $C$DW$T$266, DW_AT_address_class(0x14)

$C$DW$T$267	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$267, DW_AT_name("limits_get_state_ptr")
	.dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$266)
	.dwattr $C$DW$T$267, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$267, DW_AT_decl_file("..\grbl\hal.h")
	.dwattr $C$DW$T$267, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$267, DW_AT_decl_column(0x1b)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$1150	.dwtag  DW_TAG_member
	.dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1150, DW_AT_name("overflow")
	.dwattr $C$DW$1150, DW_AT_TI_symbol_name("overflow")
	.dwattr $C$DW$1150, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1150, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1150, DW_AT_decl_file("../grbl/protocol.c")
	.dwattr $C$DW$1150, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1150, DW_AT_decl_column(0x11)

$C$DW$1151	.dwtag  DW_TAG_member
	.dwattr $C$DW$1151, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1151, DW_AT_name("comment_parentheses")
	.dwattr $C$DW$1151, DW_AT_TI_symbol_name("comment_parentheses")
	.dwattr $C$DW$1151, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1151, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1151, DW_AT_decl_file("../grbl/protocol.c")
	.dwattr $C$DW$1151, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1151, DW_AT_decl_column(0x11)

$C$DW$1152	.dwtag  DW_TAG_member
	.dwattr $C$DW$1152, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1152, DW_AT_name("comment_semicolon")
	.dwattr $C$DW$1152, DW_AT_TI_symbol_name("comment_semicolon")
	.dwattr $C$DW$1152, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1152, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1152, DW_AT_decl_file("../grbl/protocol.c")
	.dwattr $C$DW$1152, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$1152, DW_AT_decl_column(0x11)

$C$DW$1153	.dwtag  DW_TAG_member
	.dwattr $C$DW$1153, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1153, DW_AT_name("unassigned")
	.dwattr $C$DW$1153, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1153, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1153, DW_AT_bit_size(0x05)
	.dwattr $C$DW$1153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1153, DW_AT_decl_file("../grbl/protocol.c")
	.dwattr $C$DW$1153, DW_AT_decl_line(0x30)
	.dwattr $C$DW$1153, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$41, DW_AT_decl_file("../grbl/protocol.c")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$41


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
$C$DW$1154	.dwtag  DW_TAG_member
	.dwattr $C$DW$1154, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1154, DW_AT_name("xyz")
	.dwattr $C$DW$1154, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1154, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1154, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1154, DW_AT_decl_column(0x0b)

$C$DW$1155	.dwtag  DW_TAG_member
	.dwattr $C$DW$1155, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1155, DW_AT_name("id")
	.dwattr $C$DW$1155, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$1155, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1155, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1155, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1155, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$45, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$45

$C$DW$T$54	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$54, DW_AT_name("coord_system_t")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$54, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x2e)
$C$DW$1156	.dwtag  DW_TAG_member
	.dwattr $C$DW$1156, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$1156, DW_AT_name("motion")
	.dwattr $C$DW$1156, DW_AT_TI_symbol_name("motion")
	.dwattr $C$DW$1156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1156, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1156, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1156, DW_AT_decl_column(0x13)

$C$DW$1157	.dwtag  DW_TAG_member
	.dwattr $C$DW$1157, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1157, DW_AT_name("feed_mode")
	.dwattr $C$DW$1157, DW_AT_TI_symbol_name("feed_mode")
	.dwattr $C$DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1157, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1157, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1157, DW_AT_decl_column(0x11)

$C$DW$1158	.dwtag  DW_TAG_member
	.dwattr $C$DW$1158, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1158, DW_AT_name("units_imperial")
	.dwattr $C$DW$1158, DW_AT_TI_symbol_name("units_imperial")
	.dwattr $C$DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1158, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1158, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1158, DW_AT_decl_column(0x0a)

$C$DW$1159	.dwtag  DW_TAG_member
	.dwattr $C$DW$1159, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1159, DW_AT_name("distance_incremental")
	.dwattr $C$DW$1159, DW_AT_TI_symbol_name("distance_incremental")
	.dwattr $C$DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1159, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1159, DW_AT_decl_line(0x194)
	.dwattr $C$DW$1159, DW_AT_decl_column(0x0a)

$C$DW$1160	.dwtag  DW_TAG_member
	.dwattr $C$DW$1160, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1160, DW_AT_name("diameter_mode")
	.dwattr $C$DW$1160, DW_AT_TI_symbol_name("diameter_mode")
	.dwattr $C$DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1160, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1160, DW_AT_decl_line(0x195)
	.dwattr $C$DW$1160, DW_AT_decl_column(0x0a)

$C$DW$1161	.dwtag  DW_TAG_member
	.dwattr $C$DW$1161, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1161, DW_AT_name("plane_select")
	.dwattr $C$DW$1161, DW_AT_TI_symbol_name("plane_select")
	.dwattr $C$DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1161, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1161, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1161, DW_AT_decl_column(0x14)

$C$DW$1162	.dwtag  DW_TAG_member
	.dwattr $C$DW$1162, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$1162, DW_AT_name("tool_offset_mode")
	.dwattr $C$DW$1162, DW_AT_TI_symbol_name("tool_offset_mode")
	.dwattr $C$DW$1162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1162, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1162, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1162, DW_AT_decl_column(0x18)

$C$DW$1163	.dwtag  DW_TAG_member
	.dwattr $C$DW$1163, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1163, DW_AT_name("coord_system")
	.dwattr $C$DW$1163, DW_AT_TI_symbol_name("coord_system")
	.dwattr $C$DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1163, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1163, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$1163, DW_AT_decl_column(0x14)

$C$DW$1164	.dwtag  DW_TAG_member
	.dwattr $C$DW$1164, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$1164, DW_AT_name("program_flow")
	.dwattr $C$DW$1164, DW_AT_TI_symbol_name("program_flow")
	.dwattr $C$DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1164, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1164, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1164, DW_AT_decl_column(0x14)

$C$DW$1165	.dwtag  DW_TAG_member
	.dwattr $C$DW$1165, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1165, DW_AT_name("coolant")
	.dwattr $C$DW$1165, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1165, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1165, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1165, DW_AT_decl_column(0x15)

$C$DW$1166	.dwtag  DW_TAG_member
	.dwattr $C$DW$1166, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1166, DW_AT_name("spindle")
	.dwattr $C$DW$1166, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1166, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1166, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1166, DW_AT_decl_column(0x15)

$C$DW$1167	.dwtag  DW_TAG_member
	.dwattr $C$DW$1167, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1167, DW_AT_name("override_ctrl")
	.dwattr $C$DW$1167, DW_AT_TI_symbol_name("override_ctrl")
	.dwattr $C$DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1167, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1167, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1167, DW_AT_decl_column(0x19)

$C$DW$1168	.dwtag  DW_TAG_member
	.dwattr $C$DW$1168, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$1168, DW_AT_name("spindle_rpm_mode")
	.dwattr $C$DW$1168, DW_AT_TI_symbol_name("spindle_rpm_mode")
	.dwattr $C$DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1168, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1168, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$1168, DW_AT_decl_column(0x18)

$C$DW$1169	.dwtag  DW_TAG_member
	.dwattr $C$DW$1169, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$1169, DW_AT_name("retract_mode")
	.dwattr $C$DW$1169, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$1169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1169, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1169, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$1169, DW_AT_decl_column(0x17)

$C$DW$1170	.dwtag  DW_TAG_member
	.dwattr $C$DW$1170, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1170, DW_AT_name("scaling_active")
	.dwattr $C$DW$1170, DW_AT_TI_symbol_name("scaling_active")
	.dwattr $C$DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1170, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1170, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$1170, DW_AT_decl_column(0x0a)

$C$DW$1171	.dwtag  DW_TAG_member
	.dwattr $C$DW$1171, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1171, DW_AT_name("canned_cycle_active")
	.dwattr $C$DW$1171, DW_AT_TI_symbol_name("canned_cycle_active")
	.dwattr $C$DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$1171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1171, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1171, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$1171, DW_AT_decl_column(0x0a)

$C$DW$1172	.dwtag  DW_TAG_member
	.dwattr $C$DW$1172, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$1172, DW_AT_name("spline_pq")
	.dwattr $C$DW$1172, DW_AT_TI_symbol_name("spline_pq")
	.dwattr $C$DW$1172, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1172, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1172, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$1172, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$63

$C$DW$T$68	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$68, DW_AT_name("gc_modal_t")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$68, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x22)
$C$DW$1173	.dwtag  DW_TAG_member
	.dwattr $C$DW$1173, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1173, DW_AT_name("xyz")
	.dwattr $C$DW$1173, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1173, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1173, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$1173, DW_AT_decl_column(0x0b)

$C$DW$1174	.dwtag  DW_TAG_member
	.dwattr $C$DW$1174, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1174, DW_AT_name("delta")
	.dwattr $C$DW$1174, DW_AT_TI_symbol_name("delta")
	.dwattr $C$DW$1174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1174, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x0b)

$C$DW$1175	.dwtag  DW_TAG_member
	.dwattr $C$DW$1175, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1175, DW_AT_name("dwell")
	.dwattr $C$DW$1175, DW_AT_TI_symbol_name("dwell")
	.dwattr $C$DW$1175, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1175, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1175, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$1175, DW_AT_decl_column(0x0b)

$C$DW$1176	.dwtag  DW_TAG_member
	.dwattr $C$DW$1176, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1176, DW_AT_name("prev_position")
	.dwattr $C$DW$1176, DW_AT_TI_symbol_name("prev_position")
	.dwattr $C$DW$1176, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1176, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1176, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x0b)

$C$DW$1177	.dwtag  DW_TAG_member
	.dwattr $C$DW$1177, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1177, DW_AT_name("retract_position")
	.dwattr $C$DW$1177, DW_AT_TI_symbol_name("retract_position")
	.dwattr $C$DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1177, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1177, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x0b)

$C$DW$1178	.dwtag  DW_TAG_member
	.dwattr $C$DW$1178, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1178, DW_AT_name("rapid_retract")
	.dwattr $C$DW$1178, DW_AT_TI_symbol_name("rapid_retract")
	.dwattr $C$DW$1178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1178, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1178, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x0a)

$C$DW$1179	.dwtag  DW_TAG_member
	.dwattr $C$DW$1179, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1179, DW_AT_name("spindle_off")
	.dwattr $C$DW$1179, DW_AT_TI_symbol_name("spindle_off")
	.dwattr $C$DW$1179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1179, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1179, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x0a)

$C$DW$1180	.dwtag  DW_TAG_member
	.dwattr $C$DW$1180, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$1180, DW_AT_name("retract_mode")
	.dwattr $C$DW$1180, DW_AT_TI_symbol_name("retract_mode")
	.dwattr $C$DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1180, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1180, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x17)

$C$DW$1181	.dwtag  DW_TAG_member
	.dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1181, DW_AT_name("change")
	.dwattr $C$DW$1181, DW_AT_TI_symbol_name("change")
	.dwattr $C$DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1181, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1181, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$64

$C$DW$T$69	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$69, DW_AT_name("gc_canned_t")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x03)


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x14)
$C$DW$1182	.dwtag  DW_TAG_member
	.dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1182, DW_AT_name("offset")
	.dwattr $C$DW$1182, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1182, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x0b)

$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1183, DW_AT_name("radius")
	.dwattr $C$DW$1183, DW_AT_TI_symbol_name("radius")
	.dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x0b)

$C$DW$1184	.dwtag  DW_TAG_member
	.dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1184, DW_AT_name("tool")
	.dwattr $C$DW$1184, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1184, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1184, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$1184, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$67, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$67

$C$DW$T$75	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$75, DW_AT_name("tool_data_t")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x03)

$C$DW$T$76	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$76, DW_AT_address_class(0x14)


$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_byte_size(0xa8)
$C$DW$1185	.dwtag  DW_TAG_member
	.dwattr $C$DW$1185, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$1185, DW_AT_name("modal")
	.dwattr $C$DW$1185, DW_AT_TI_symbol_name("modal")
	.dwattr $C$DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1185, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1185, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1185, DW_AT_decl_column(0x10)

$C$DW$1186	.dwtag  DW_TAG_member
	.dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1186, DW_AT_name("canned")
	.dwattr $C$DW$1186, DW_AT_TI_symbol_name("canned")
	.dwattr $C$DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1186, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x11)

$C$DW$1187	.dwtag  DW_TAG_member
	.dwattr $C$DW$1187, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$1187, DW_AT_name("spindle")
	.dwattr $C$DW$1187, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1187, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x0f)

$C$DW$1188	.dwtag  DW_TAG_member
	.dwattr $C$DW$1188, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1188, DW_AT_name("feed_rate")
	.dwattr $C$DW$1188, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1188, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x0b)

$C$DW$1189	.dwtag  DW_TAG_member
	.dwattr $C$DW$1189, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1189, DW_AT_name("distance_per_rev")
	.dwattr $C$DW$1189, DW_AT_TI_symbol_name("distance_per_rev")
	.dwattr $C$DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1189, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x0b)

$C$DW$1190	.dwtag  DW_TAG_member
	.dwattr $C$DW$1190, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1190, DW_AT_name("position")
	.dwattr $C$DW$1190, DW_AT_TI_symbol_name("position")
	.dwattr $C$DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1190, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x0b)

$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$1191, DW_AT_name("line_number")
	.dwattr $C$DW$1191, DW_AT_TI_symbol_name("line_number")
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x0d)

$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1192, DW_AT_name("tool_pending")
	.dwattr $C$DW$1192, DW_AT_TI_symbol_name("tool_pending")
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x0e)

$C$DW$1193	.dwtag  DW_TAG_member
	.dwattr $C$DW$1193, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1193, DW_AT_name("file_run")
	.dwattr $C$DW$1193, DW_AT_TI_symbol_name("file_run")
	.dwattr $C$DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$1193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1193, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x0a)

$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1194, DW_AT_name("is_laser_ppi_mode")
	.dwattr $C$DW$1194, DW_AT_TI_symbol_name("is_laser_ppi_mode")
	.dwattr $C$DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x85]
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x0a)

$C$DW$1195	.dwtag  DW_TAG_member
	.dwattr $C$DW$1195, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1195, DW_AT_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1195, DW_AT_TI_symbol_name("is_rpm_rate_adjusted")
	.dwattr $C$DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$1195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1195, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x0a)

$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1196, DW_AT_name("tool_change")
	.dwattr $C$DW$1196, DW_AT_TI_symbol_name("tool_change")
	.dwattr $C$DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x0a)

$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$1197, DW_AT_name("last_error")
	.dwattr $C$DW$1197, DW_AT_TI_symbol_name("last_error")
	.dwattr $C$DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x13)

$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1198, DW_AT_name("g92_coord_offset_applied")
	.dwattr $C$DW$1198, DW_AT_TI_symbol_name("g92_coord_offset_applied")
	.dwattr $C$DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x0a)

$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1199, DW_AT_name("g92_coord_offset")
	.dwattr $C$DW$1199, DW_AT_TI_symbol_name("g92_coord_offset")
	.dwattr $C$DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x0b)

$C$DW$1200	.dwtag  DW_TAG_member
	.dwattr $C$DW$1200, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1200, DW_AT_name("tool_length_offset")
	.dwattr $C$DW$1200, DW_AT_TI_symbol_name("tool_length_offset")
	.dwattr $C$DW$1200, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$1200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1200, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x0b)

$C$DW$1201	.dwtag  DW_TAG_member
	.dwattr $C$DW$1201, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$1201, DW_AT_name("tool")
	.dwattr $C$DW$1201, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$1201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1201, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$77, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$77

$C$DW$T$385	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$385, DW_AT_name("parser_state_t")
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$385, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$385, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$T$385, DW_AT_decl_column(0x03)

$C$DW$T$386	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$385)
	.dwattr $C$DW$T$386, DW_AT_address_class(0x14)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x02)
$C$DW$1202	.dwtag  DW_TAG_member
	.dwattr $C$DW$1202, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1202, DW_AT_name("mpg_mode")
	.dwattr $C$DW$1202, DW_AT_TI_symbol_name("mpg_mode")
	.dwattr $C$DW$1202, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1202, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1202, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x12)

$C$DW$1203	.dwtag  DW_TAG_member
	.dwattr $C$DW$1203, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1203, DW_AT_name("probe_succeeded")
	.dwattr $C$DW$1203, DW_AT_TI_symbol_name("probe_succeeded")
	.dwattr $C$DW$1203, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1203, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1203, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x12)

$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1204, DW_AT_name("soft_limit")
	.dwattr $C$DW$1204, DW_AT_TI_symbol_name("soft_limit")
	.dwattr $C$DW$1204, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1204, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x12)

$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1205, DW_AT_name("exit")
	.dwattr $C$DW$1205, DW_AT_TI_symbol_name("exit")
	.dwattr $C$DW$1205, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1205, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0xce)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x12)

$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1206, DW_AT_name("block_delete_enabled")
	.dwattr $C$DW$1206, DW_AT_TI_symbol_name("block_delete_enabled")
	.dwattr $C$DW$1206, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1206, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x12)

$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1207, DW_AT_name("feed_hold_pending")
	.dwattr $C$DW$1207, DW_AT_TI_symbol_name("feed_hold_pending")
	.dwattr $C$DW$1207, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1207, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x12)

$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1208, DW_AT_name("delay_overrides")
	.dwattr $C$DW$1208, DW_AT_TI_symbol_name("delay_overrides")
	.dwattr $C$DW$1208, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1208, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x12)

$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1209, DW_AT_name("optional_stop_disable")
	.dwattr $C$DW$1209, DW_AT_TI_symbol_name("optional_stop_disable")
	.dwattr $C$DW$1209, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1209, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x12)

$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1210, DW_AT_name("single_block")
	.dwattr $C$DW$1210, DW_AT_TI_symbol_name("single_block")
	.dwattr $C$DW$1210, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1210, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x12)

$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1211, DW_AT_name("keep_input")
	.dwattr $C$DW$1211, DW_AT_TI_symbol_name("keep_input")
	.dwattr $C$DW$1211, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1211, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x12)

$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1212, DW_AT_name("unused")
	.dwattr $C$DW$1212, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$1212, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1212, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$78, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$78


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x01)
$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1213, DW_AT_name("end_motion")
	.dwattr $C$DW$1213, DW_AT_TI_symbol_name("end_motion")
	.dwattr $C$DW$1213, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1213, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x11)

$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1214, DW_AT_name("execute_hold")
	.dwattr $C$DW$1214, DW_AT_TI_symbol_name("execute_hold")
	.dwattr $C$DW$1214, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1214, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0x70)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x11)

$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1215, DW_AT_name("execute_sys_motion")
	.dwattr $C$DW$1215, DW_AT_TI_symbol_name("execute_sys_motion")
	.dwattr $C$DW$1215, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1215, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0x71)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x11)

$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1216, DW_AT_name("update_spindle_rpm")
	.dwattr $C$DW$1216, DW_AT_TI_symbol_name("update_spindle_rpm")
	.dwattr $C$DW$1216, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1216, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1216, DW_AT_decl_line(0x72)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x11)

$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1217, DW_AT_name("unassigned")
	.dwattr $C$DW$1217, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1217, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1217, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1217, DW_AT_decl_line(0x73)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$79, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$79


$C$DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1218, DW_AT_name("enabled")
	.dwattr $C$DW$1218, DW_AT_TI_symbol_name("enabled")
	.dwattr $C$DW$1218, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1218, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x11)

$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1219, DW_AT_name("initiate")
	.dwattr $C$DW$1219, DW_AT_TI_symbol_name("initiate")
	.dwattr $C$DW$1219, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1219, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0x94)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x11)

$C$DW$1220	.dwtag  DW_TAG_member
	.dwattr $C$DW$1220, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1220, DW_AT_name("restore")
	.dwattr $C$DW$1220, DW_AT_TI_symbol_name("restore")
	.dwattr $C$DW$1220, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1220, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1220, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x11)

$C$DW$1221	.dwtag  DW_TAG_member
	.dwattr $C$DW$1221, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1221, DW_AT_name("restore_cycle")
	.dwattr $C$DW$1221, DW_AT_TI_symbol_name("restore_cycle")
	.dwattr $C$DW$1221, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1221, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1221, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0x96)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x11)

$C$DW$1222	.dwtag  DW_TAG_member
	.dwattr $C$DW$1222, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1222, DW_AT_name("unassigned")
	.dwattr $C$DW$1222, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1222, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1222, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1222, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$80, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$80


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x05)
$C$DW$1223	.dwtag  DW_TAG_member
	.dwattr $C$DW$1223, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1223, DW_AT_name("feed_rate")
	.dwattr $C$DW$1223, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1223, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x0d)

$C$DW$1224	.dwtag  DW_TAG_member
	.dwattr $C$DW$1224, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1224, DW_AT_name("rapid_rate")
	.dwattr $C$DW$1224, DW_AT_TI_symbol_name("rapid_rate")
	.dwattr $C$DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1224, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x0d)

$C$DW$1225	.dwtag  DW_TAG_member
	.dwattr $C$DW$1225, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1225, DW_AT_name("spindle_rpm")
	.dwattr $C$DW$1225, DW_AT_TI_symbol_name("spindle_rpm")
	.dwattr $C$DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1225, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x0d)

$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1226, DW_AT_name("spindle_stop")
	.dwattr $C$DW$1226, DW_AT_TI_symbol_name("spindle_stop")
	.dwattr $C$DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x14)

$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1227, DW_AT_name("control")
	.dwattr $C$DW$1227, DW_AT_TI_symbol_name("control")
	.dwattr $C$DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$82, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$82

$C$DW$T$752	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$752, DW_AT_name("overrides_t")
	.dwattr $C$DW$T$752, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$752, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$752, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$752, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$T$752, DW_AT_decl_column(0x03)


$C$DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x04)
$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1228, DW_AT_name("mpg_mode")
	.dwattr $C$DW$1228, DW_AT_TI_symbol_name("mpg_mode")
	.dwattr $C$DW$1228, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$1228, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x12)

$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1229, DW_AT_name("scaling")
	.dwattr $C$DW$1229, DW_AT_TI_symbol_name("scaling")
	.dwattr $C$DW$1229, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$1229, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x12)

$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1230, DW_AT_name("homed")
	.dwattr $C$DW$1230, DW_AT_TI_symbol_name("homed")
	.dwattr $C$DW$1230, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$1230, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x12)

$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1231, DW_AT_name("xmode")
	.dwattr $C$DW$1231, DW_AT_TI_symbol_name("xmode")
	.dwattr $C$DW$1231, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$1231, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x12)

$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1232, DW_AT_name("spindle")
	.dwattr $C$DW$1232, DW_AT_TI_symbol_name("spindle")
	.dwattr $C$DW$1232, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$1232, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x12)

$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1233, DW_AT_name("coolant")
	.dwattr $C$DW$1233, DW_AT_TI_symbol_name("coolant")
	.dwattr $C$DW$1233, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$1233, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x12)

$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1234, DW_AT_name("overrides")
	.dwattr $C$DW$1234, DW_AT_TI_symbol_name("overrides")
	.dwattr $C$DW$1234, DW_AT_bit_offset(0x19)
	.dwattr $C$DW$1234, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x12)

$C$DW$1235	.dwtag  DW_TAG_member
	.dwattr $C$DW$1235, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1235, DW_AT_name("tool")
	.dwattr $C$DW$1235, DW_AT_TI_symbol_name("tool")
	.dwattr $C$DW$1235, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$1235, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1235, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x12)

$C$DW$1236	.dwtag  DW_TAG_member
	.dwattr $C$DW$1236, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1236, DW_AT_name("wco")
	.dwattr $C$DW$1236, DW_AT_TI_symbol_name("wco")
	.dwattr $C$DW$1236, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$1236, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1236, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x12)

$C$DW$1237	.dwtag  DW_TAG_member
	.dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1237, DW_AT_name("gwco")
	.dwattr $C$DW$1237, DW_AT_TI_symbol_name("gwco")
	.dwattr $C$DW$1237, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$1237, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1237, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x12)

$C$DW$1238	.dwtag  DW_TAG_member
	.dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1238, DW_AT_name("tool_offset")
	.dwattr $C$DW$1238, DW_AT_TI_symbol_name("tool_offset")
	.dwattr $C$DW$1238, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$1238, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1238, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x12)

$C$DW$1239	.dwtag  DW_TAG_member
	.dwattr $C$DW$1239, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1239, DW_AT_name("m66result")
	.dwattr $C$DW$1239, DW_AT_TI_symbol_name("m66result")
	.dwattr $C$DW$1239, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$1239, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1239, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x12)

$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1240, DW_AT_name("pwm")
	.dwattr $C$DW$1240, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$1240, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$1240, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x12)

$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1241, DW_AT_name("motor")
	.dwattr $C$DW$1241, DW_AT_TI_symbol_name("motor")
	.dwattr $C$DW$1241, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$1241, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x12)

$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1242, DW_AT_name("encoder")
	.dwattr $C$DW$1242, DW_AT_TI_symbol_name("encoder")
	.dwattr $C$DW$1242, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$1242, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x12)

$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1243, DW_AT_name("tlo_reference")
	.dwattr $C$DW$1243, DW_AT_TI_symbol_name("tlo_reference")
	.dwattr $C$DW$1243, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$1243, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x12)

$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1244, DW_AT_name("fan")
	.dwattr $C$DW$1244, DW_AT_TI_symbol_name("fan")
	.dwattr $C$DW$1244, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1244, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0xba)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x12)

$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1245, DW_AT_name("unassigned")
	.dwattr $C$DW$1245, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1245, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1245, DW_AT_bit_size(0x0e)
	.dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x12)

$C$DW$1246	.dwtag  DW_TAG_member
	.dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1246, DW_AT_name("all")
	.dwattr $C$DW$1246, DW_AT_TI_symbol_name("all")
	.dwattr $C$DW$1246, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1246, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1246, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$83, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$83


$C$DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1247, DW_AT_name("reset")
	.dwattr $C$DW$1247, DW_AT_TI_symbol_name("reset")
	.dwattr $C$DW$1247, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1247, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x12)

$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1248, DW_AT_name("feed_hold")
	.dwattr $C$DW$1248, DW_AT_TI_symbol_name("feed_hold")
	.dwattr $C$DW$1248, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1248, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x12)

$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1249, DW_AT_name("cycle_start")
	.dwattr $C$DW$1249, DW_AT_TI_symbol_name("cycle_start")
	.dwattr $C$DW$1249, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1249, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x12)

$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1250, DW_AT_name("safety_door_ajar")
	.dwattr $C$DW$1250, DW_AT_TI_symbol_name("safety_door_ajar")
	.dwattr $C$DW$1250, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1250, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x12)

$C$DW$1251	.dwtag  DW_TAG_member
	.dwattr $C$DW$1251, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1251, DW_AT_name("block_delete")
	.dwattr $C$DW$1251, DW_AT_TI_symbol_name("block_delete")
	.dwattr $C$DW$1251, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1251, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1251, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1251, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x12)

$C$DW$1252	.dwtag  DW_TAG_member
	.dwattr $C$DW$1252, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1252, DW_AT_name("stop_disable")
	.dwattr $C$DW$1252, DW_AT_TI_symbol_name("stop_disable")
	.dwattr $C$DW$1252, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1252, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1252, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1252, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x12)

$C$DW$1253	.dwtag  DW_TAG_member
	.dwattr $C$DW$1253, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1253, DW_AT_name("e_stop")
	.dwattr $C$DW$1253, DW_AT_TI_symbol_name("e_stop")
	.dwattr $C$DW$1253, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1253, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1253, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1253, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x12)

$C$DW$1254	.dwtag  DW_TAG_member
	.dwattr $C$DW$1254, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1254, DW_AT_name("probe_disconnected")
	.dwattr $C$DW$1254, DW_AT_TI_symbol_name("probe_disconnected")
	.dwattr $C$DW$1254, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1254, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1254, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0x83)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x12)

$C$DW$1255	.dwtag  DW_TAG_member
	.dwattr $C$DW$1255, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1255, DW_AT_name("motor_fault")
	.dwattr $C$DW$1255, DW_AT_TI_symbol_name("motor_fault")
	.dwattr $C$DW$1255, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1255, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1255, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0x84)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x12)

$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1256, DW_AT_name("motor_warning")
	.dwattr $C$DW$1256, DW_AT_TI_symbol_name("motor_warning")
	.dwattr $C$DW$1256, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1256, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x12)

$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1257, DW_AT_name("limits_override")
	.dwattr $C$DW$1257, DW_AT_TI_symbol_name("limits_override")
	.dwattr $C$DW$1257, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1257, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0x86)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x12)

$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1258, DW_AT_name("single_block")
	.dwattr $C$DW$1258, DW_AT_TI_symbol_name("single_block")
	.dwattr $C$DW$1258, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1258, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x12)

$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1259, DW_AT_name("unassigned")
	.dwattr $C$DW$1259, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1259, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1259, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0x88)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x12)

$C$DW$1260	.dwtag  DW_TAG_member
	.dwattr $C$DW$1260, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1260, DW_AT_name("probe_triggered")
	.dwattr $C$DW$1260, DW_AT_TI_symbol_name("probe_triggered")
	.dwattr $C$DW$1260, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1260, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1260, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x12)

$C$DW$1261	.dwtag  DW_TAG_member
	.dwattr $C$DW$1261, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1261, DW_AT_name("deasserted")
	.dwattr $C$DW$1261, DW_AT_TI_symbol_name("deasserted")
	.dwattr $C$DW$1261, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1261, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1261, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$84, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$84, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$84, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$84


$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
$C$DW$1262	.dwtag  DW_TAG_member
	.dwattr $C$DW$1262, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$1262, DW_AT_name("control")
	.dwattr $C$DW$1262, DW_AT_TI_symbol_name("control")
	.dwattr $C$DW$1262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1262, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x17)

$C$DW$1263	.dwtag  DW_TAG_member
	.dwattr $C$DW$1263, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$1263, DW_AT_name("limits")
	.dwattr $C$DW$1263, DW_AT_TI_symbol_name("limits")
	.dwattr $C$DW$1263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1263, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$87, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$87

$C$DW$T$762	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$762, DW_AT_name("signal_event_t")
