;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed May 31 19:52:36 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../grbl/report.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("axis_letter")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("axis_letter")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$1226)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x75)
	.dwattr $C$DW$1, DW_AT_decl_column(0x1a)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("gc_state")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("gc_state")

	.dwattr $C$DW$2057, DW_AT_decl_column(0x05)

$C$DW$2058	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2058, DW_AT_name("NGCParam_z")
	.dwattr $C$DW$2058, DW_AT_const_value(0x22)
	.dwattr $C$DW$2058, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2058, DW_AT_decl_line(0x49)
	.dwattr $C$DW$2058, DW_AT_decl_column(0x05)

$C$DW$2059	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2059, DW_AT_name("NGCParam_a")
	.dwattr $C$DW$2059, DW_AT_const_value(0x23)
	.dwattr $C$DW$2059, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2059, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$2059, DW_AT_decl_column(0x05)

$C$DW$2060	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2060, DW_AT_name("NGCParam_b")
	.dwattr $C$DW$2060, DW_AT_const_value(0x24)
	.dwattr $C$DW$2060, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2060, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$2060, DW_AT_decl_column(0x05)

$C$DW$2061	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2061, DW_AT_name("NGCParam_c")
	.dwattr $C$DW$2061, DW_AT_const_value(0x25)
	.dwattr $C$DW$2061, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2061, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$2061, DW_AT_decl_column(0x05)

$C$DW$2062	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2062, DW_AT_name("NGCParam_u")
	.dwattr $C$DW$2062, DW_AT_const_value(0x26)
	.dwattr $C$DW$2062, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2062, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$2062, DW_AT_decl_column(0x05)

$C$DW$2063	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2063, DW_AT_name("NGCParam_v")
	.dwattr $C$DW$2063, DW_AT_const_value(0x27)
	.dwattr $C$DW$2063, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2063, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$2063, DW_AT_decl_column(0x05)

$C$DW$2064	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2064, DW_AT_name("NGCParam_w")
	.dwattr $C$DW$2064, DW_AT_const_value(0x28)
	.dwattr $C$DW$2064, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2064, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$2064, DW_AT_decl_column(0x05)

$C$DW$2065	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2065, DW_AT_name("NGCParam_current_tool")
	.dwattr $C$DW$2065, DW_AT_const_value(0x29)
	.dwattr $C$DW$2065, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2065, DW_AT_decl_line(0x50)
	.dwattr $C$DW$2065, DW_AT_decl_column(0x05)

$C$DW$2066	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2066, DW_AT_name("NGCParam_current_pocket")
	.dwattr $C$DW$2066, DW_AT_const_value(0x2a)
	.dwattr $C$DW$2066, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2066, DW_AT_decl_line(0x51)
	.dwattr $C$DW$2066, DW_AT_decl_column(0x05)

$C$DW$2067	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2067, DW_AT_name("NGCParam_selected_tool")
	.dwattr $C$DW$2067, DW_AT_const_value(0x2b)
	.dwattr $C$DW$2067, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2067, DW_AT_decl_line(0x52)
	.dwattr $C$DW$2067, DW_AT_decl_column(0x05)

$C$DW$2068	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2068, DW_AT_name("NGCParam_selected_pocket")
	.dwattr $C$DW$2068, DW_AT_const_value(0x2c)
	.dwattr $C$DW$2068, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2068, DW_AT_decl_line(0x53)
	.dwattr $C$DW$2068, DW_AT_decl_column(0x05)

$C$DW$2069	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2069, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$2069, DW_AT_const_value(0x2d)
	.dwattr $C$DW$2069, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$2069, DW_AT_decl_line(0x54)
	.dwattr $C$DW$2069, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$834, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$834, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$834, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$834

$C$DW$T$835	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$835, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$835, DW_AT_type(*$C$DW$T$834)
	.dwattr $C$DW$T$835, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$835, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$835, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$835, DW_AT_decl_column(0x03)


$C$DW$T$836	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$836, DW_AT_byte_size(0x02)
$C$DW$2070	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2070, DW_AT_name("PullMode_None")
	.dwattr $C$DW$2070, DW_AT_const_value(0x00)
	.dwattr $C$DW$2070, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$2070, DW_AT_decl_line(0x143)
	.dwattr $C$DW$2070, DW_AT_decl_column(0x05)

$C$DW$2071	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2071, DW_AT_name("PullMode_Up")
	.dwattr $C$DW$2071, DW_AT_const_value(0x01)
	.dwattr $C$DW$2071, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$2071, DW_AT_decl_line(0x144)
	.dwattr $C$DW$2071, DW_AT_decl_column(0x05)

$C$DW$2072	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2072, DW_AT_name("PullMode_Down")
	.dwattr $C$DW$2072, DW_AT_const_value(0x02)
	.dwattr $C$DW$2072, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$2072, DW_AT_decl_line(0x145)
	.dwattr $C$DW$2072, DW_AT_decl_column(0x05)

$C$DW$2073	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$2073, DW_AT_name("PullMode_UpDown")
	.dwattr $C$DW$2073, DW_AT_const_value(0x03)
	.dwattr $C$DW$2073, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$2073, DW_AT_decl_line(0x146)
	.dwattr $C$DW$2073, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$836, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$836, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$836, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$836

$C$DW$T$837	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$837, DW_AT_name("pull_mode_t")
	.dwattr $C$DW$T$837, DW_AT_type(*$C$DW$T$836)
	.dwattr $C$DW$T$837, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$837, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$837, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$837, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$2074	.dwtag  DW_TAG_member
	.dwattr $C$DW$2074, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2074, DW_AT_name("x")
	.dwattr $C$DW$2074, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$2074, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2074, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2074, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2074, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2074, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2074, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$2074, DW_AT_decl_column(0x11)

$C$DW$2075	.dwtag  DW_TAG_member
	.dwattr $C$DW$2075, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2075, DW_AT_name("y")
	.dwattr $C$DW$2075, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$2075, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2075, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2075, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2075, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2075, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2075, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$2075, DW_AT_decl_column(0x11)

$C$DW$2076	.dwtag  DW_TAG_member
	.dwattr $C$DW$2076, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2076, DW_AT_name("z")
	.dwattr $C$DW$2076, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$2076, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2076, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2076, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2076, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2076, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2076, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$2076, DW_AT_decl_column(0x11)

$C$DW$2077	.dwtag  DW_TAG_member
	.dwattr $C$DW$2077, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2077, DW_AT_name("a")
	.dwattr $C$DW$2077, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$2077, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2077, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2077, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2077, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2077, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2077, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$2077, DW_AT_decl_column(0x11)

$C$DW$2078	.dwtag  DW_TAG_member
	.dwattr $C$DW$2078, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2078, DW_AT_name("b")
	.dwattr $C$DW$2078, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$2078, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$2078, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2078, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2078, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2078, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2078, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$2078, DW_AT_decl_column(0x11)

$C$DW$2079	.dwtag  DW_TAG_member
	.dwattr $C$DW$2079, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2079, DW_AT_name("c")
	.dwattr $C$DW$2079, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$2079, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$2079, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2079, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2079, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2079, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2079, DW_AT_decl_line(0x80)
	.dwattr $C$DW$2079, DW_AT_decl_column(0x11)

$C$DW$2080	.dwtag  DW_TAG_member
	.dwattr $C$DW$2080, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2080, DW_AT_name("u")
	.dwattr $C$DW$2080, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$2080, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$2080, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2080, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2080, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2080, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2080, DW_AT_decl_line(0x81)
	.dwattr $C$DW$2080, DW_AT_decl_column(0x11)

$C$DW$2081	.dwtag  DW_TAG_member
	.dwattr $C$DW$2081, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2081, DW_AT_name("v")
	.dwattr $C$DW$2081, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$2081, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2081, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2081, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2081, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2081, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$2081, DW_AT_decl_line(0x82)
	.dwattr $C$DW$2081, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
$C$DW$2082	.dwtag  DW_TAG_member
	.dwattr $C$DW$2082, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2082, DW_AT_name("axis_0")
	.dwattr $C$DW$2082, DW_AT_TI_symbol_name("axis_0")
	.dwattr $C$DW$2082, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2082, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2082, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$2082, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$2082, DW_AT_decl_column(0x0d)

$C$DW$2083	.dwtag  DW_TAG_member
	.dwattr $C$DW$2083, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2083, DW_AT_name("axis_1")
	.dwattr $C$DW$2083, DW_AT_TI_symbol_name("axis_1")
	.dwattr $C$DW$2083, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2083, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2083, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$2083, DW_AT_decl_line(0x150)
	.dwattr $C$DW$2083, DW_AT_decl_column(0x0d)

$C$DW$2084	.dwtag  DW_TAG_member
	.dwattr $C$DW$2084, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2084, DW_AT_name("axis_linear")
	.dwattr $C$DW$2084, DW_AT_TI_symbol_name("axis_linear")
	.dwattr $C$DW$2084, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2084, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2084, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$2084, DW_AT_decl_line(0x151)
	.dwattr $C$DW$2084, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$25

$C$DW$T$839	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$839, DW_AT_name("plane_t")
	.dwattr $C$DW$T$839, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$839, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$839, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$839, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$839, DW_AT_decl_column(0x03)

$C$DW$T$840	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$840, DW_AT_type(*$C$DW$T$839)
	.dwattr $C$DW$T$840, DW_AT_address_class(0x14)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
$C$DW$2085	.dwtag  DW_TAG_member
	.dwattr $C$DW$2085, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$2085, DW_AT_name("parent")
	.dwattr $C$DW$2085, DW_AT_TI_symbol_name("parent")
	.dwattr $C$DW$2085, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2085, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2085, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2085, DW_AT_decl_line(0x296)
	.dwattr $C$DW$2085, DW_AT_decl_column(0x15)

$C$DW$2086	.dwtag  DW_TAG_member
	.dwattr $C$DW$2086, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$2086, DW_AT_name("id")
	.dwattr $C$DW$2086, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$2086, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2086, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2086, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2086, DW_AT_decl_line(0x297)
	.dwattr $C$DW$2086, DW_AT_decl_column(0x15)

$C$DW$2087	.dwtag  DW_TAG_member
	.dwattr $C$DW$2087, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$2087, DW_AT_name("name")
	.dwattr $C$DW$2087, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$2087, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2087, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2087, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2087, DW_AT_decl_line(0x298)
	.dwattr $C$DW$2087, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x295)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

$C$DW$T$742	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$742, DW_AT_name("setting_group_detail_t")
	.dwattr $C$DW$T$742, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$742, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$742, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$742, DW_AT_decl_line(0x299)
	.dwattr $C$DW$T$742, DW_AT_decl_column(0x03)

$C$DW$T$848	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$848, DW_AT_type(*$C$DW$T$742)
	.dwattr $C$DW$T$848, DW_AT_address_class(0x14)

$C$DW$T$849	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$849, DW_AT_type(*$C$DW$T$848)
	.dwattr $C$DW$T$849, DW_AT_address_class(0x14)

$C$DW$2088	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2088, DW_AT_type(*$C$DW$T$742)

$C$DW$T$743	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$743, DW_AT_type(*$C$DW$2088)

$C$DW$T$744	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$744, DW_AT_type(*$C$DW$T$743)
	.dwattr $C$DW$T$744, DW_AT_address_class(0x14)


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x12)
$C$DW$2089	.dwtag  DW_TAG_member
	.dwattr $C$DW$2089, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2089, DW_AT_name("feed_rate")
	.dwattr $C$DW$2089, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$2089, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2089, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2089, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2089, DW_AT_decl_line(0x22e)
	.dwattr $C$DW$2089, DW_AT_decl_column(0x0b)

$C$DW$2090	.dwtag  DW_TAG_member
	.dwattr $C$DW$2090, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2090, DW_AT_name("seek_rate")
	.dwattr $C$DW$2090, DW_AT_TI_symbol_name("seek_rate")
	.dwattr $C$DW$2090, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2090, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2090, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2090, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$2090, DW_AT_decl_column(0x0b)

$C$DW$2091	.dwtag  DW_TAG_member
	.dwattr $C$DW$2091, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2091, DW_AT_name("pulloff_rate")
	.dwattr $C$DW$2091, DW_AT_TI_symbol_name("pulloff_rate")
	.dwattr $C$DW$2091, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2091, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2091, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2091, DW_AT_decl_line(0x230)
	.dwattr $C$DW$2091, DW_AT_decl_column(0x0b)

$C$DW$2092	.dwtag  DW_TAG_member
	.dwattr $C$DW$2092, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2092, DW_AT_name("probing_distance")
	.dwattr $C$DW$2092, DW_AT_TI_symbol_name("probing_distance")
	.dwattr $C$DW$2092, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2092, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2092, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2092, DW_AT_decl_line(0x231)
	.dwattr $C$DW$2092, DW_AT_decl_column(0x0b)

$C$DW$2093	.dwtag  DW_TAG_member
	.dwattr $C$DW$2093, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$2093, DW_AT_name("mode")
	.dwattr $C$DW$2093, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$2093, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2093, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2093, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2093, DW_AT_decl_line(0x232)
	.dwattr $C$DW$2093, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$34, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x22d)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$34

$C$DW$T$78	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$78, DW_AT_name("tool_change_settings_t")
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$78, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x03)


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
$C$DW$2094	.dwtag  DW_TAG_member
	.dwattr $C$DW$2094, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2094, DW_AT_name("steps_per_mm")
	.dwattr $C$DW$2094, DW_AT_TI_symbol_name("steps_per_mm")
	.dwattr $C$DW$2094, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2094, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2094, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2094, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$2094, DW_AT_decl_column(0x0b)

$C$DW$2095	.dwtag  DW_TAG_member
	.dwattr $C$DW$2095, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2095, DW_AT_name("max_rate")
	.dwattr $C$DW$2095, DW_AT_TI_symbol_name("max_rate")
	.dwattr $C$DW$2095, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2095, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2095, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2095, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$2095, DW_AT_decl_column(0x0b)

$C$DW$2096	.dwtag  DW_TAG_member
	.dwattr $C$DW$2096, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2096, DW_AT_name("acceleration")
	.dwattr $C$DW$2096, DW_AT_TI_symbol_name("acceleration")
	.dwattr $C$DW$2096, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2096, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2096, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2096, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$2096, DW_AT_decl_column(0x0b)

$C$DW$2097	.dwtag  DW_TAG_member
	.dwattr $C$DW$2097, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2097, DW_AT_name("max_travel")
	.dwattr $C$DW$2097, DW_AT_TI_symbol_name("max_travel")
	.dwattr $C$DW$2097, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2097, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2097, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2097, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$2097, DW_AT_decl_column(0x0b)

$C$DW$2098	.dwtag  DW_TAG_member
	.dwattr $C$DW$2098, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2098, DW_AT_name("dual_axis_offset")
	.dwattr $C$DW$2098, DW_AT_TI_symbol_name("dual_axis_offset")
	.dwattr $C$DW$2098, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2098, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2098, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2098, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$2098, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$35, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$35

$C$DW$T$79	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$79, DW_AT_name("axis_settings_t")
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$79, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x03)


$C$DW$T$80	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x3c)
$C$DW$2099	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$2099, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$80


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
$C$DW$2100	.dwtag  DW_TAG_member
	.dwattr $C$DW$2100, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2100, DW_AT_name("reset")
	.dwattr $C$DW$2100, DW_AT_TI_symbol_name("reset")
	.dwattr $C$DW$2100, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$2100, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2100, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2100, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$2100, DW_AT_decl_column(0x12)

$C$DW$2101	.dwtag  DW_TAG_member
	.dwattr $C$DW$2101, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2101, DW_AT_name("feed_hold")
	.dwattr $C$DW$2101, DW_AT_TI_symbol_name("feed_hold")
	.dwattr $C$DW$2101, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$2101, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2101, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2101, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$2101, DW_AT_decl_column(0x12)

$C$DW$2102	.dwtag  DW_TAG_member
	.dwattr $C$DW$2102, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2102, DW_AT_name("cycle_start")
	.dwattr $C$DW$2102, DW_AT_TI_symbol_name("cycle_start")
	.dwattr $C$DW$2102, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$2102, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2102, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2102, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$2102, DW_AT_decl_column(0x12)

$C$DW$2103	.dwtag  DW_TAG_member
	.dwattr $C$DW$2103, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2103, DW_AT_name("safety_door_ajar")
	.dwattr $C$DW$2103, DW_AT_TI_symbol_name("safety_door_ajar")
	.dwattr $C$DW$2103, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$2103, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2103, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2103, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$2103, DW_AT_decl_column(0x12)

$C$DW$2104	.dwtag  DW_TAG_member
	.dwattr $C$DW$2104, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2104, DW_AT_name("block_delete")
	.dwattr $C$DW$2104, DW_AT_TI_symbol_name("block_delete")
	.dwattr $C$DW$2104, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$2104, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2104, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2104, DW_AT_decl_line(0x80)
	.dwattr $C$DW$2104, DW_AT_decl_column(0x12)

$C$DW$2105	.dwtag  DW_TAG_member
	.dwattr $C$DW$2105, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2105, DW_AT_name("stop_disable")
	.dwattr $C$DW$2105, DW_AT_TI_symbol_name("stop_disable")
	.dwattr $C$DW$2105, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$2105, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2105, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2105, DW_AT_decl_line(0x81)
	.dwattr $C$DW$2105, DW_AT_decl_column(0x12)

$C$DW$2106	.dwtag  DW_TAG_member
	.dwattr $C$DW$2106, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2106, DW_AT_name("e_stop")
	.dwattr $C$DW$2106, DW_AT_TI_symbol_name("e_stop")
	.dwattr $C$DW$2106, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$2106, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2106, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2106, DW_AT_decl_line(0x82)
	.dwattr $C$DW$2106, DW_AT_decl_column(0x12)

$C$DW$2107	.dwtag  DW_TAG_member
	.dwattr $C$DW$2107, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2107, DW_AT_name("probe_disconnected")
	.dwattr $C$DW$2107, DW_AT_TI_symbol_name("probe_disconnected")
	.dwattr $C$DW$2107, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$2107, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2107, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2107, DW_AT_decl_line(0x83)
	.dwattr $C$DW$2107, DW_AT_decl_column(0x12)

$C$DW$2108	.dwtag  DW_TAG_member
	.dwattr $C$DW$2108, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2108, DW_AT_name("motor_fault")
	.dwattr $C$DW$2108, DW_AT_TI_symbol_name("motor_fault")
	.dwattr $C$DW$2108, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2108, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2108, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2108, DW_AT_decl_line(0x84)
	.dwattr $C$DW$2108, DW_AT_decl_column(0x12)

$C$DW$2109	.dwtag  DW_TAG_member
	.dwattr $C$DW$2109, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2109, DW_AT_name("motor_warning")
	.dwattr $C$DW$2109, DW_AT_TI_symbol_name("motor_warning")
	.dwattr $C$DW$2109, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2109, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2109, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2109, DW_AT_decl_line(0x85)
	.dwattr $C$DW$2109, DW_AT_decl_column(0x12)

$C$DW$2110	.dwtag  DW_TAG_member
	.dwattr $C$DW$2110, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2110, DW_AT_name("limits_override")
	.dwattr $C$DW$2110, DW_AT_TI_symbol_name("limits_override")
	.dwattr $C$DW$2110, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2110, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2110, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2110, DW_AT_decl_line(0x86)
	.dwattr $C$DW$2110, DW_AT_decl_column(0x12)

$C$DW$2111	.dwtag  DW_TAG_member
	.dwattr $C$DW$2111, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2111, DW_AT_name("single_block")
	.dwattr $C$DW$2111, DW_AT_TI_symbol_name("single_block")
	.dwattr $C$DW$2111, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2111, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2111, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2111, DW_AT_decl_line(0x87)
	.dwattr $C$DW$2111, DW_AT_decl_column(0x12)

$C$DW$2112	.dwtag  DW_TAG_member
	.dwattr $C$DW$2112, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2112, DW_AT_name("unassigned")
	.dwattr $C$DW$2112, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2112, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$2112, DW_AT_bit_size(0x02)
	.dwattr $C$DW$2112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2112, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2112, DW_AT_decl_line(0x88)
	.dwattr $C$DW$2112, DW_AT_decl_column(0x12)

$C$DW$2113	.dwtag  DW_TAG_member
	.dwattr $C$DW$2113, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2113, DW_AT_name("probe_triggered")
	.dwattr $C$DW$2113, DW_AT_TI_symbol_name("probe_triggered")
	.dwattr $C$DW$2113, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$2113, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2113, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2113, DW_AT_decl_line(0x89)
	.dwattr $C$DW$2113, DW_AT_decl_column(0x12)

$C$DW$2114	.dwtag  DW_TAG_member
	.dwattr $C$DW$2114, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2114, DW_AT_name("deasserted")
	.dwattr $C$DW$2114, DW_AT_TI_symbol_name("deasserted")
	.dwattr $C$DW$2114, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2114, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2114, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$2114, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$2114, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$38, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$38


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$2115	.dwtag  DW_TAG_member
	.dwattr $C$DW$2115, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2115, DW_AT_name("flood")
	.dwattr $C$DW$2115, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$2115, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2115, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2115, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$2115, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$2115, DW_AT_decl_column(0x11)

$C$DW$2116	.dwtag  DW_TAG_member
	.dwattr $C$DW$2116, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2116, DW_AT_name("mist")
	.dwattr $C$DW$2116, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$2116, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2116, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2116, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$2116, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$2116, DW_AT_decl_column(0x11)

$C$DW$2117	.dwtag  DW_TAG_member
	.dwattr $C$DW$2117, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2117, DW_AT_name("shower")
	.dwattr $C$DW$2117, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$2117, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2117, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2117, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$2117, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$2117, DW_AT_decl_column(0x11)

$C$DW$2118	.dwtag  DW_TAG_member
	.dwattr $C$DW$2118, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2118, DW_AT_name("trough_spindle")
	.dwattr $C$DW$2118, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$2118, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2118, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2118, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$2118, DW_AT_decl_line(0x20)
	.dwattr $C$DW$2118, DW_AT_decl_column(0x11)

$C$DW$2119	.dwtag  DW_TAG_member
	.dwattr $C$DW$2119, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2119, DW_AT_name("unused")
	.dwattr $C$DW$2119, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$2119, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2119, DW_AT_bit_size(0x04)
	.dwattr $C$DW$2119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2119, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$2119, DW_AT_decl_line(0x21)
	.dwattr $C$DW$2119, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$39


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
$C$DW$2120	.dwtag  DW_TAG_member
	.dwattr $C$DW$2120, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2120, DW_AT_name("rpm")
	.dwattr $C$DW$2120, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$2120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2120, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2120, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$2120, DW_AT_decl_column(0x0b)

$C$DW$2121	.dwtag  DW_TAG_member
	.dwattr $C$DW$2121, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2121, DW_AT_name("start")
	.dwattr $C$DW$2121, DW_AT_TI_symbol_name("start")
	.dwattr $C$DW$2121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2121, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2121, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$2121, DW_AT_decl_column(0x0b)

$C$DW$2122	.dwtag  DW_TAG_member
	.dwattr $C$DW$2122, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2122, DW_AT_name("end")
	.dwattr $C$DW$2122, DW_AT_TI_symbol_name("end")
	.dwattr $C$DW$2122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2122, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2122, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$2122, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$40

$C$DW$T$44	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$44, DW_AT_name("pwm_piece_t")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x03)


$C$DW$T$45	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x30)
$C$DW$2123	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$2123, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$45


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x20)
$C$DW$2124	.dwtag  DW_TAG_member
	.dwattr $C$DW$2124, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2124, DW_AT_name("p_gain")
	.dwattr $C$DW$2124, DW_AT_TI_symbol_name("p_gain")
	.dwattr $C$DW$2124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2124, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2124, DW_AT_decl_line(0x197)
	.dwattr $C$DW$2124, DW_AT_decl_column(0x0b)

$C$DW$2125	.dwtag  DW_TAG_member
	.dwattr $C$DW$2125, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2125, DW_AT_name("i_gain")
	.dwattr $C$DW$2125, DW_AT_TI_symbol_name("i_gain")
	.dwattr $C$DW$2125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2125, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2125, DW_AT_decl_line(0x198)
	.dwattr $C$DW$2125, DW_AT_decl_column(0x0b)

$C$DW$2126	.dwtag  DW_TAG_member
	.dwattr $C$DW$2126, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2126, DW_AT_name("d_gain")
	.dwattr $C$DW$2126, DW_AT_TI_symbol_name("d_gain")
	.dwattr $C$DW$2126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2126, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2126, DW_AT_decl_line(0x199)
	.dwattr $C$DW$2126, DW_AT_decl_column(0x0b)

$C$DW$2127	.dwtag  DW_TAG_member
	.dwattr $C$DW$2127, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2127, DW_AT_name("p_max_error")
	.dwattr $C$DW$2127, DW_AT_TI_symbol_name("p_max_error")
	.dwattr $C$DW$2127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2127, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2127, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$2127, DW_AT_decl_column(0x0b)

$C$DW$2128	.dwtag  DW_TAG_member
	.dwattr $C$DW$2128, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2128, DW_AT_name("i_max_error")
	.dwattr $C$DW$2128, DW_AT_TI_symbol_name("i_max_error")
	.dwattr $C$DW$2128, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2128, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2128, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$2128, DW_AT_decl_column(0x0b)

$C$DW$2129	.dwtag  DW_TAG_member
	.dwattr $C$DW$2129, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2129, DW_AT_name("d_max_error")
	.dwattr $C$DW$2129, DW_AT_TI_symbol_name("d_max_error")
	.dwattr $C$DW$2129, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$2129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2129, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2129, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$2129, DW_AT_decl_column(0x0b)

$C$DW$2130	.dwtag  DW_TAG_member
	.dwattr $C$DW$2130, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2130, DW_AT_name("deadband")
	.dwattr $C$DW$2130, DW_AT_TI_symbol_name("deadband")
	.dwattr $C$DW$2130, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$2130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2130, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2130, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$2130, DW_AT_decl_column(0x0b)

$C$DW$2131	.dwtag  DW_TAG_member
	.dwattr $C$DW$2131, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2131, DW_AT_name("max_error")
	.dwattr $C$DW$2131, DW_AT_TI_symbol_name("max_error")
	.dwattr $C$DW$2131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$2131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2131, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2131, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$2131, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$41

$C$DW$T$46	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$46, DW_AT_name("pid_values_t")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$46, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x03)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$2132	.dwtag  DW_TAG_member
	.dwattr $C$DW$2132, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2132, DW_AT_name("on")
	.dwattr $C$DW$2132, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$2132, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2132, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2132, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2132, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$2132, DW_AT_decl_column(0x11)

$C$DW$2133	.dwtag  DW_TAG_member
	.dwattr $C$DW$2133, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2133, DW_AT_name("ccw")
	.dwattr $C$DW$2133, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$2133, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2133, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2133, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2133, DW_AT_decl_line(0x20)
	.dwattr $C$DW$2133, DW_AT_decl_column(0x11)

$C$DW$2134	.dwtag  DW_TAG_member
	.dwattr $C$DW$2134, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2134, DW_AT_name("pwm")
	.dwattr $C$DW$2134, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$2134, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2134, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2134, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2134, DW_AT_decl_line(0x21)
	.dwattr $C$DW$2134, DW_AT_decl_column(0x11)

$C$DW$2135	.dwtag  DW_TAG_member
	.dwattr $C$DW$2135, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2135, DW_AT_name("reserved3")
	.dwattr $C$DW$2135, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$2135, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2135, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2135, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2135, DW_AT_decl_line(0x22)
	.dwattr $C$DW$2135, DW_AT_decl_column(0x11)

$C$DW$2136	.dwtag  DW_TAG_member
	.dwattr $C$DW$2136, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2136, DW_AT_name("reserved4")
	.dwattr $C$DW$2136, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$2136, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$2136, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2136, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2136, DW_AT_decl_line(0x23)
	.dwattr $C$DW$2136, DW_AT_decl_column(0x11)

$C$DW$2137	.dwtag  DW_TAG_member
	.dwattr $C$DW$2137, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2137, DW_AT_name("encoder_error")
	.dwattr $C$DW$2137, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$2137, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$2137, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2137, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2137, DW_AT_decl_line(0x24)
	.dwattr $C$DW$2137, DW_AT_decl_column(0x11)

$C$DW$2138	.dwtag  DW_TAG_member
	.dwattr $C$DW$2138, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2138, DW_AT_name("at_speed")
	.dwattr $C$DW$2138, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$2138, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$2138, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2138, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2138, DW_AT_decl_line(0x25)
	.dwattr $C$DW$2138, DW_AT_decl_column(0x11)

$C$DW$2139	.dwtag  DW_TAG_member
	.dwattr $C$DW$2139, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2139, DW_AT_name("synchronized")
	.dwattr $C$DW$2139, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$2139, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2139, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2139, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$2139, DW_AT_decl_line(0x26)
	.dwattr $C$DW$2139, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$42


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$2140	.dwtag  DW_TAG_member
	.dwattr $C$DW$2140, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2140, DW_AT_name("pwm_action")
	.dwattr $C$DW$2140, DW_AT_TI_symbol_name("pwm_action")
	.dwattr $C$DW$2140, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2140, DW_AT_bit_size(0x02)
	.dwattr $C$DW$2140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2140, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2140, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$2140, DW_AT_decl_column(0x11)

$C$DW$2141	.dwtag  DW_TAG_member
	.dwattr $C$DW$2141, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2141, DW_AT_name("unassigned")
	.dwattr $C$DW$2141, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2141, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2141, DW_AT_bit_size(0x06)
	.dwattr $C$DW$2141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2141, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2141, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$2141, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$43


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x74)
$C$DW$2142	.dwtag  DW_TAG_member
	.dwattr $C$DW$2142, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2142, DW_AT_name("rpm_max")
	.dwattr $C$DW$2142, DW_AT_TI_symbol_name("rpm_max")
	.dwattr $C$DW$2142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2142, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2142, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$2142, DW_AT_decl_column(0x0b)

$C$DW$2143	.dwtag  DW_TAG_member
	.dwattr $C$DW$2143, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2143, DW_AT_name("rpm_min")
	.dwattr $C$DW$2143, DW_AT_TI_symbol_name("rpm_min")
	.dwattr $C$DW$2143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2143, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2143, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$2143, DW_AT_decl_column(0x0b)

$C$DW$2144	.dwtag  DW_TAG_member
	.dwattr $C$DW$2144, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2144, DW_AT_name("pwm_freq")
	.dwattr $C$DW$2144, DW_AT_TI_symbol_name("pwm_freq")
	.dwattr $C$DW$2144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2144, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2144, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$2144, DW_AT_decl_column(0x0b)

$C$DW$2145	.dwtag  DW_TAG_member
	.dwattr $C$DW$2145, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2145, DW_AT_name("pwm_period")
	.dwattr $C$DW$2145, DW_AT_TI_symbol_name("pwm_period")
	.dwattr $C$DW$2145, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2145, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2145, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$2145, DW_AT_decl_column(0x0b)

$C$DW$2146	.dwtag  DW_TAG_member
	.dwattr $C$DW$2146, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2146, DW_AT_name("pwm_off_value")
	.dwattr $C$DW$2146, DW_AT_TI_symbol_name("pwm_off_value")
	.dwattr $C$DW$2146, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2146, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2146, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$2146, DW_AT_decl_column(0x0b)

$C$DW$2147	.dwtag  DW_TAG_member
	.dwattr $C$DW$2147, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2147, DW_AT_name("pwm_min_value")
	.dwattr $C$DW$2147, DW_AT_TI_symbol_name("pwm_min_value")
	.dwattr $C$DW$2147, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$2147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2147, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2147, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$2147, DW_AT_decl_column(0x0b)

$C$DW$2148	.dwtag  DW_TAG_member
	.dwattr $C$DW$2148, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2148, DW_AT_name("pwm_max_value")
	.dwattr $C$DW$2148, DW_AT_TI_symbol_name("pwm_max_value")
	.dwattr $C$DW$2148, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$2148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2148, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2148, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$2148, DW_AT_decl_column(0x0b)

$C$DW$2149	.dwtag  DW_TAG_member
	.dwattr $C$DW$2149, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2149, DW_AT_name("at_speed_tolerance")
	.dwattr $C$DW$2149, DW_AT_TI_symbol_name("at_speed_tolerance")
	.dwattr $C$DW$2149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$2149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2149, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2149, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$2149, DW_AT_decl_column(0x0b)

$C$DW$2150	.dwtag  DW_TAG_member
	.dwattr $C$DW$2150, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$2150, DW_AT_name("pwm_piece")
	.dwattr $C$DW$2150, DW_AT_TI_symbol_name("pwm_piece")
	.dwattr $C$DW$2150, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$2150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2150, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2150, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$2150, DW_AT_decl_column(0x11)

$C$DW$2151	.dwtag  DW_TAG_member
	.dwattr $C$DW$2151, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$2151, DW_AT_name("pid")
	.dwattr $C$DW$2151, DW_AT_TI_symbol_name("pid")
	.dwattr $C$DW$2151, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$2151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2151, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2151, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$2151, DW_AT_decl_column(0x12)

$C$DW$2152	.dwtag  DW_TAG_member
	.dwattr $C$DW$2152, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2152, DW_AT_name("ppr")
	.dwattr $C$DW$2152, DW_AT_TI_symbol_name("ppr")
	.dwattr $C$DW$2152, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$2152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2152, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2152, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$2152, DW_AT_decl_column(0x0e)

$C$DW$2153	.dwtag  DW_TAG_member
	.dwattr $C$DW$2153, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$2153, DW_AT_name("invert")
	.dwattr $C$DW$2153, DW_AT_TI_symbol_name("invert")
	.dwattr $C$DW$2153, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$2153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2153, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2153, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$2153, DW_AT_decl_column(0x15)

$C$DW$2154	.dwtag  DW_TAG_member
	.dwattr $C$DW$2154, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$2154, DW_AT_name("flags")
	.dwattr $C$DW$2154, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$2154, DW_AT_data_member_location[DW_OP_plus_uconst 0x73]
	.dwattr $C$DW$2154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2154, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2154, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$2154, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$49, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$49

$C$DW$T$83	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$83, DW_AT_name("spindle_settings_t")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$83, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x03)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
$C$DW$2155	.dwtag  DW_TAG_member
	.dwattr $C$DW$2155, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2155, DW_AT_name("step_invert")
	.dwattr $C$DW$2155, DW_AT_TI_symbol_name("step_invert")
	.dwattr $C$DW$2155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2155, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2155, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$2155, DW_AT_decl_column(0x14)

$C$DW$2156	.dwtag  DW_TAG_member
	.dwattr $C$DW$2156, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2156, DW_AT_name("dir_invert")
	.dwattr $C$DW$2156, DW_AT_TI_symbol_name("dir_invert")
	.dwattr $C$DW$2156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2156, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2156, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$2156, DW_AT_decl_column(0x14)

$C$DW$2157	.dwtag  DW_TAG_member
	.dwattr $C$DW$2157, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2157, DW_AT_name("ganged_dir_invert")
	.dwattr $C$DW$2157, DW_AT_TI_symbol_name("ganged_dir_invert")
	.dwattr $C$DW$2157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2157, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2157, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$2157, DW_AT_decl_column(0x14)

$C$DW$2158	.dwtag  DW_TAG_member
	.dwattr $C$DW$2158, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2158, DW_AT_name("enable_invert")
	.dwattr $C$DW$2158, DW_AT_TI_symbol_name("enable_invert")
	.dwattr $C$DW$2158, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$2158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2158, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2158, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$2158, DW_AT_decl_column(0x14)

$C$DW$2159	.dwtag  DW_TAG_member
	.dwattr $C$DW$2159, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2159, DW_AT_name("deenergize")
	.dwattr $C$DW$2159, DW_AT_TI_symbol_name("deenergize")
	.dwattr $C$DW$2159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2159, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2159, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$2159, DW_AT_decl_column(0x14)

$C$DW$2160	.dwtag  DW_TAG_member
	.dwattr $C$DW$2160, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2160, DW_AT_name("pulse_microseconds")
	.dwattr $C$DW$2160, DW_AT_TI_symbol_name("pulse_microseconds")
	.dwattr $C$DW$2160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$2160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2160, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2160, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$2160, DW_AT_decl_column(0x0b)

$C$DW$2161	.dwtag  DW_TAG_member
	.dwattr $C$DW$2161, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2161, DW_AT_name("pulse_delay_microseconds")
	.dwattr $C$DW$2161, DW_AT_TI_symbol_name("pulse_delay_microseconds")
	.dwattr $C$DW$2161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$2161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2161, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2161, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$2161, DW_AT_decl_column(0x0b)

$C$DW$2162	.dwtag  DW_TAG_member
	.dwattr $C$DW$2162, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2162, DW_AT_name("idle_lock_time")
	.dwattr $C$DW$2162, DW_AT_TI_symbol_name("idle_lock_time")
	.dwattr $C$DW$2162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$2162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2162, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2162, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$2162, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$51

$C$DW$T$84	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$84, DW_AT_name("stepper_settings_t")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$84, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$84, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$T$84, DW_AT_decl_column(0x03)


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
$C$DW$2163	.dwtag  DW_TAG_member
	.dwattr $C$DW$2163, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2163, DW_AT_name("machine_position")
	.dwattr $C$DW$2163, DW_AT_TI_symbol_name("machine_position")
	.dwattr $C$DW$2163, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$2163, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2163, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2163, DW_AT_decl_line(0x164)
	.dwattr $C$DW$2163, DW_AT_decl_column(0x12)

$C$DW$2164	.dwtag  DW_TAG_member
	.dwattr $C$DW$2164, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2164, DW_AT_name("buffer_state")
	.dwattr $C$DW$2164, DW_AT_TI_symbol_name("buffer_state")
	.dwattr $C$DW$2164, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$2164, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2164, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2164, DW_AT_decl_line(0x165)
	.dwattr $C$DW$2164, DW_AT_decl_column(0x12)

$C$DW$2165	.dwtag  DW_TAG_member
	.dwattr $C$DW$2165, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2165, DW_AT_name("line_numbers")
	.dwattr $C$DW$2165, DW_AT_TI_symbol_name("line_numbers")
	.dwattr $C$DW$2165, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$2165, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2165, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2165, DW_AT_decl_line(0x166)
	.dwattr $C$DW$2165, DW_AT_decl_column(0x12)

$C$DW$2166	.dwtag  DW_TAG_member
	.dwattr $C$DW$2166, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2166, DW_AT_name("feed_speed")
	.dwattr $C$DW$2166, DW_AT_TI_symbol_name("feed_speed")
	.dwattr $C$DW$2166, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$2166, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2166, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2166, DW_AT_decl_line(0x167)
	.dwattr $C$DW$2166, DW_AT_decl_column(0x12)

$C$DW$2167	.dwtag  DW_TAG_member
	.dwattr $C$DW$2167, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2167, DW_AT_name("pin_state")
	.dwattr $C$DW$2167, DW_AT_TI_symbol_name("pin_state")
	.dwattr $C$DW$2167, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$2167, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2167, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2167, DW_AT_decl_line(0x168)
	.dwattr $C$DW$2167, DW_AT_decl_column(0x12)

$C$DW$2168	.dwtag  DW_TAG_member
	.dwattr $C$DW$2168, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2168, DW_AT_name("work_coord_offset")
	.dwattr $C$DW$2168, DW_AT_TI_symbol_name("work_coord_offset")
	.dwattr $C$DW$2168, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$2168, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2168, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2168, DW_AT_decl_line(0x169)
	.dwattr $C$DW$2168, DW_AT_decl_column(0x12)

$C$DW$2169	.dwtag  DW_TAG_member
	.dwattr $C$DW$2169, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2169, DW_AT_name("overrides")
	.dwattr $C$DW$2169, DW_AT_TI_symbol_name("overrides")
	.dwattr $C$DW$2169, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$2169, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2169, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2169, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$2169, DW_AT_decl_column(0x12)

$C$DW$2170	.dwtag  DW_TAG_member
	.dwattr $C$DW$2170, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2170, DW_AT_name("probe_coordinates")
	.dwattr $C$DW$2170, DW_AT_TI_symbol_name("probe_coordinates")
	.dwattr $C$DW$2170, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$2170, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2170, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2170, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$2170, DW_AT_decl_column(0x12)

$C$DW$2171	.dwtag  DW_TAG_member
	.dwattr $C$DW$2171, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2171, DW_AT_name("sync_on_wco_change")
	.dwattr $C$DW$2171, DW_AT_TI_symbol_name("sync_on_wco_change")
	.dwattr $C$DW$2171, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2171, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2171, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2171, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$2171, DW_AT_decl_column(0x12)

$C$DW$2172	.dwtag  DW_TAG_member
	.dwattr $C$DW$2172, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2172, DW_AT_name("parser_state")
	.dwattr $C$DW$2172, DW_AT_TI_symbol_name("parser_state")
	.dwattr $C$DW$2172, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2172, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2172, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2172, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$2172, DW_AT_decl_column(0x12)

$C$DW$2173	.dwtag  DW_TAG_member
	.dwattr $C$DW$2173, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2173, DW_AT_name("alarm_substate")
	.dwattr $C$DW$2173, DW_AT_TI_symbol_name("alarm_substate")
	.dwattr $C$DW$2173, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2173, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2173, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2173, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$2173, DW_AT_decl_column(0x12)

$C$DW$2174	.dwtag  DW_TAG_member
	.dwattr $C$DW$2174, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2174, DW_AT_name("run_substate")
	.dwattr $C$DW$2174, DW_AT_TI_symbol_name("run_substate")
	.dwattr $C$DW$2174, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2174, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2174, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2174, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$2174, DW_AT_decl_column(0x12)

$C$DW$2175	.dwtag  DW_TAG_member
	.dwattr $C$DW$2175, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2175, DW_AT_name("unassigned")
	.dwattr $C$DW$2175, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2175, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2175, DW_AT_bit_size(0x04)
	.dwattr $C$DW$2175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2175, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2175, DW_AT_decl_line(0x170)
	.dwattr $C$DW$2175, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x163)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$52


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
$C$DW$2176	.dwtag  DW_TAG_member
	.dwattr $C$DW$2176, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2176, DW_AT_name("report_inches")
	.dwattr $C$DW$2176, DW_AT_TI_symbol_name("report_inches")
	.dwattr $C$DW$2176, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$2176, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2176, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2176, DW_AT_decl_line(0x146)
	.dwattr $C$DW$2176, DW_AT_decl_column(0x12)

$C$DW$2177	.dwtag  DW_TAG_member
	.dwattr $C$DW$2177, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2177, DW_AT_name("restore_overrides")
	.dwattr $C$DW$2177, DW_AT_TI_symbol_name("restore_overrides")
	.dwattr $C$DW$2177, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$2177, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2177, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2177, DW_AT_decl_line(0x147)
	.dwattr $C$DW$2177, DW_AT_decl_column(0x12)

$C$DW$2178	.dwtag  DW_TAG_member
	.dwattr $C$DW$2178, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2178, DW_AT_name("unused0")
	.dwattr $C$DW$2178, DW_AT_TI_symbol_name("unused0")
	.dwattr $C$DW$2178, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$2178, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2178, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2178, DW_AT_decl_line(0x148)
	.dwattr $C$DW$2178, DW_AT_decl_column(0x12)

$C$DW$2179	.dwtag  DW_TAG_member
	.dwattr $C$DW$2179, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2179, DW_AT_name("sleep_enable")
	.dwattr $C$DW$2179, DW_AT_TI_symbol_name("sleep_enable")
	.dwattr $C$DW$2179, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$2179, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2179, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2179, DW_AT_decl_line(0x149)
	.dwattr $C$DW$2179, DW_AT_decl_column(0x12)

$C$DW$2180	.dwtag  DW_TAG_member
	.dwattr $C$DW$2180, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2180, DW_AT_name("disable_laser_during_hold")
	.dwattr $C$DW$2180, DW_AT_TI_symbol_name("disable_laser_during_hold")
	.dwattr $C$DW$2180, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$2180, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2180, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2180, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$2180, DW_AT_decl_column(0x12)

$C$DW$2181	.dwtag  DW_TAG_member
	.dwattr $C$DW$2181, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2181, DW_AT_name("force_initialization_alarm")
	.dwattr $C$DW$2181, DW_AT_TI_symbol_name("force_initialization_alarm")
	.dwattr $C$DW$2181, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$2181, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2181, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2181, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$2181, DW_AT_decl_column(0x12)

$C$DW$2182	.dwtag  DW_TAG_member
	.dwattr $C$DW$2182, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2182, DW_AT_name("legacy_rt_commands")
	.dwattr $C$DW$2182, DW_AT_TI_symbol_name("legacy_rt_commands")
	.dwattr $C$DW$2182, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$2182, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2182, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2182, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$2182, DW_AT_decl_column(0x12)

$C$DW$2183	.dwtag  DW_TAG_member
	.dwattr $C$DW$2183, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2183, DW_AT_name("restore_after_feed_hold")
	.dwattr $C$DW$2183, DW_AT_TI_symbol_name("restore_after_feed_hold")
	.dwattr $C$DW$2183, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$2183, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2183, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2183, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$2183, DW_AT_decl_column(0x12)

$C$DW$2184	.dwtag  DW_TAG_member
	.dwattr $C$DW$2184, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2184, DW_AT_name("unused1")
	.dwattr $C$DW$2184, DW_AT_TI_symbol_name("unused1")
	.dwattr $C$DW$2184, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2184, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2184, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2184, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$2184, DW_AT_decl_column(0x12)

$C$DW$2185	.dwtag  DW_TAG_member
	.dwattr $C$DW$2185, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2185, DW_AT_name("g92_is_volatile")
	.dwattr $C$DW$2185, DW_AT_TI_symbol_name("g92_is_volatile")
	.dwattr $C$DW$2185, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2185, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2185, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2185, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$2185, DW_AT_decl_column(0x12)

$C$DW$2186	.dwtag  DW_TAG_member
	.dwattr $C$DW$2186, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2186, DW_AT_name("unassigned")
	.dwattr $C$DW$2186, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2186, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2186, DW_AT_bit_size(0x06)
	.dwattr $C$DW$2186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2186, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2186, DW_AT_decl_line(0x150)
	.dwattr $C$DW$2186, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x145)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$53


$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$2187	.dwtag  DW_TAG_member
	.dwattr $C$DW$2187, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2187, DW_AT_name("invert_probe_pin")
	.dwattr $C$DW$2187, DW_AT_TI_symbol_name("invert_probe_pin")
	.dwattr $C$DW$2187, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2187, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2187, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2187, DW_AT_decl_line(0x157)
	.dwattr $C$DW$2187, DW_AT_decl_column(0x11)

$C$DW$2188	.dwtag  DW_TAG_member
	.dwattr $C$DW$2188, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2188, DW_AT_name("disable_probe_pullup")
	.dwattr $C$DW$2188, DW_AT_TI_symbol_name("disable_probe_pullup")
	.dwattr $C$DW$2188, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2188, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2188, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2188, DW_AT_decl_line(0x158)
	.dwattr $C$DW$2188, DW_AT_decl_column(0x11)

$C$DW$2189	.dwtag  DW_TAG_member
	.dwattr $C$DW$2189, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2189, DW_AT_name("invert_connected_pin")
	.dwattr $C$DW$2189, DW_AT_TI_symbol_name("invert_connected_pin")
	.dwattr $C$DW$2189, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2189, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2189, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2189, DW_AT_decl_line(0x159)
	.dwattr $C$DW$2189, DW_AT_decl_column(0x11)

$C$DW$2190	.dwtag  DW_TAG_member
	.dwattr $C$DW$2190, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2190, DW_AT_name("disable_connected_pullup")
	.dwattr $C$DW$2190, DW_AT_TI_symbol_name("disable_connected_pullup")
	.dwattr $C$DW$2190, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2190, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2190, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2190, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$2190, DW_AT_decl_column(0x11)

$C$DW$2191	.dwtag  DW_TAG_member
	.dwattr $C$DW$2191, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2191, DW_AT_name("allow_feed_override")
	.dwattr $C$DW$2191, DW_AT_TI_symbol_name("allow_feed_override")
	.dwattr $C$DW$2191, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$2191, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2191, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2191, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$2191, DW_AT_decl_column(0x11)

$C$DW$2192	.dwtag  DW_TAG_member
	.dwattr $C$DW$2192, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2192, DW_AT_name("enable_protection")
	.dwattr $C$DW$2192, DW_AT_TI_symbol_name("enable_protection")
	.dwattr $C$DW$2192, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$2192, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2192, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2192, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$2192, DW_AT_decl_column(0x11)

$C$DW$2193	.dwtag  DW_TAG_member
	.dwattr $C$DW$2193, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2193, DW_AT_name("unassigned")
	.dwattr $C$DW$2193, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2193, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2193, DW_AT_bit_size(0x02)
	.dwattr $C$DW$2193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2193, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2193, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$2193, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$54, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$54


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
$C$DW$2194	.dwtag  DW_TAG_member
	.dwattr $C$DW$2194, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2194, DW_AT_name("enabled")
	.dwattr $C$DW$2194, DW_AT_TI_symbol_name("enabled")
	.dwattr $C$DW$2194, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2194, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2194, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2194, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$2194, DW_AT_decl_column(0x11)

$C$DW$2195	.dwtag  DW_TAG_member
	.dwattr $C$DW$2195, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2195, DW_AT_name("single_axis_commands")
	.dwattr $C$DW$2195, DW_AT_TI_symbol_name("single_axis_commands")
	.dwattr $C$DW$2195, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2195, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2195, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2195, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$2195, DW_AT_decl_column(0x11)

$C$DW$2196	.dwtag  DW_TAG_member
	.dwattr $C$DW$2196, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2196, DW_AT_name("init_lock")
	.dwattr $C$DW$2196, DW_AT_TI_symbol_name("init_lock")
	.dwattr $C$DW$2196, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2196, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2196, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2196, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$2196, DW_AT_decl_column(0x11)

$C$DW$2197	.dwtag  DW_TAG_member
	.dwattr $C$DW$2197, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2197, DW_AT_name("force_set_origin")
	.dwattr $C$DW$2197, DW_AT_TI_symbol_name("force_set_origin")
	.dwattr $C$DW$2197, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2197, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2197, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2197, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$2197, DW_AT_decl_column(0x11)

$C$DW$2198	.dwtag  DW_TAG_member
	.dwattr $C$DW$2198, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2198, DW_AT_name("manual")
	.dwattr $C$DW$2198, DW_AT_TI_symbol_name("manual")
	.dwattr $C$DW$2198, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$2198, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2198, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2198, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$2198, DW_AT_decl_column(0x11)

$C$DW$2199	.dwtag  DW_TAG_member
	.dwattr $C$DW$2199, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2199, DW_AT_name("override_locks")
	.dwattr $C$DW$2199, DW_AT_TI_symbol_name("override_locks")
	.dwattr $C$DW$2199, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$2199, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2199, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2199, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$2199, DW_AT_decl_column(0x11)

$C$DW$2200	.dwtag  DW_TAG_member
	.dwattr $C$DW$2200, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2200, DW_AT_name("keep_on_reset")
	.dwattr $C$DW$2200, DW_AT_TI_symbol_name("keep_on_reset")
	.dwattr $C$DW$2200, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$2200, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2200, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2200, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$2200, DW_AT_decl_column(0x11)

$C$DW$2201	.dwtag  DW_TAG_member
	.dwattr $C$DW$2201, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2201, DW_AT_name("unassigned")
	.dwattr $C$DW$2201, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2201, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2201, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2201, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2201, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$2201, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$55


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x0c)
$C$DW$2202	.dwtag  DW_TAG_member
	.dwattr $C$DW$2202, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2202, DW_AT_name("fail_length_percent")
	.dwattr $C$DW$2202, DW_AT_TI_symbol_name("fail_length_percent")
	.dwattr $C$DW$2202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2202, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2202, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$2202, DW_AT_decl_column(0x0b)

$C$DW$2203	.dwtag  DW_TAG_member
	.dwattr $C$DW$2203, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2203, DW_AT_name("fail_distance_max")
	.dwattr $C$DW$2203, DW_AT_TI_symbol_name("fail_distance_max")
	.dwattr $C$DW$2203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2203, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2203, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$2203, DW_AT_decl_column(0x0b)

$C$DW$2204	.dwtag  DW_TAG_member
	.dwattr $C$DW$2204, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2204, DW_AT_name("fail_distance_min")
	.dwattr $C$DW$2204, DW_AT_TI_symbol_name("fail_distance_min")
	.dwattr $C$DW$2204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2204, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2204, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$2204, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$56, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$56

$C$DW$T$59	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$59, DW_AT_name("homing_dual_axis_t")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$59, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x03)


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x20)
$C$DW$2205	.dwtag  DW_TAG_member
	.dwattr $C$DW$2205, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2205, DW_AT_name("feed_rate")
	.dwattr $C$DW$2205, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$2205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2205, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2205, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$2205, DW_AT_decl_column(0x0b)

$C$DW$2206	.dwtag  DW_TAG_member
	.dwattr $C$DW$2206, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2206, DW_AT_name("seek_rate")
	.dwattr $C$DW$2206, DW_AT_TI_symbol_name("seek_rate")
	.dwattr $C$DW$2206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2206, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2206, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$2206, DW_AT_decl_column(0x0b)

$C$DW$2207	.dwtag  DW_TAG_member
	.dwattr $C$DW$2207, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2207, DW_AT_name("pulloff")
	.dwattr $C$DW$2207, DW_AT_TI_symbol_name("pulloff")
	.dwattr $C$DW$2207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2207, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2207, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$2207, DW_AT_decl_column(0x0b)

$C$DW$2208	.dwtag  DW_TAG_member
	.dwattr $C$DW$2208, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2208, DW_AT_name("dir_mask")
	.dwattr $C$DW$2208, DW_AT_TI_symbol_name("dir_mask")
	.dwattr $C$DW$2208, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2208, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2208, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$2208, DW_AT_decl_column(0x14)

$C$DW$2209	.dwtag  DW_TAG_member
	.dwattr $C$DW$2209, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2209, DW_AT_name("locate_cycles")
	.dwattr $C$DW$2209, DW_AT_TI_symbol_name("locate_cycles")
	.dwattr $C$DW$2209, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$2209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2209, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2209, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$2209, DW_AT_decl_column(0x0d)

$C$DW$2210	.dwtag  DW_TAG_member
	.dwattr $C$DW$2210, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2210, DW_AT_name("debounce_delay")
	.dwattr $C$DW$2210, DW_AT_TI_symbol_name("debounce_delay")
	.dwattr $C$DW$2210, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$2210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2210, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2210, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$2210, DW_AT_decl_column(0x0e)

$C$DW$2211	.dwtag  DW_TAG_member
	.dwattr $C$DW$2211, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$2211, DW_AT_name("flags")
	.dwattr $C$DW$2211, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$2211, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2211, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2211, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$2211, DW_AT_decl_column(0x1d)

$C$DW$2212	.dwtag  DW_TAG_member
	.dwattr $C$DW$2212, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$2212, DW_AT_name("cycle")
	.dwattr $C$DW$2212, DW_AT_TI_symbol_name("cycle")
	.dwattr $C$DW$2212, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$2212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2212, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2212, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$2212, DW_AT_decl_column(0x14)

$C$DW$2213	.dwtag  DW_TAG_member
	.dwattr $C$DW$2213, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$2213, DW_AT_name("dual_axis")
	.dwattr $C$DW$2213, DW_AT_TI_symbol_name("dual_axis")
	.dwattr $C$DW$2213, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$2213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2213, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2213, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$2213, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$60

$C$DW$T$88	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$88, DW_AT_name("homing_settings_t")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$88, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x03)


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
$C$DW$2214	.dwtag  DW_TAG_member
	.dwattr $C$DW$2214, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2214, DW_AT_name("hard_enabled")
	.dwattr $C$DW$2214, DW_AT_TI_symbol_name("hard_enabled")
	.dwattr $C$DW$2214, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2214, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2214, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2214, DW_AT_decl_line(0x200)
	.dwattr $C$DW$2214, DW_AT_decl_column(0x11)

$C$DW$2215	.dwtag  DW_TAG_member
	.dwattr $C$DW$2215, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2215, DW_AT_name("soft_enabled")
	.dwattr $C$DW$2215, DW_AT_TI_symbol_name("soft_enabled")
	.dwattr $C$DW$2215, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2215, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2215, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2215, DW_AT_decl_line(0x201)
	.dwattr $C$DW$2215, DW_AT_decl_column(0x11)

$C$DW$2216	.dwtag  DW_TAG_member
	.dwattr $C$DW$2216, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2216, DW_AT_name("check_at_init")
	.dwattr $C$DW$2216, DW_AT_TI_symbol_name("check_at_init")
	.dwattr $C$DW$2216, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2216, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2216, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2216, DW_AT_decl_line(0x202)
	.dwattr $C$DW$2216, DW_AT_decl_column(0x11)

$C$DW$2217	.dwtag  DW_TAG_member
	.dwattr $C$DW$2217, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2217, DW_AT_name("jog_soft_limited")
	.dwattr $C$DW$2217, DW_AT_TI_symbol_name("jog_soft_limited")
	.dwattr $C$DW$2217, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$2217, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2217, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2217, DW_AT_decl_line(0x203)
	.dwattr $C$DW$2217, DW_AT_decl_column(0x11)

$C$DW$2218	.dwtag  DW_TAG_member
	.dwattr $C$DW$2218, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2218, DW_AT_name("two_switches")
	.dwattr $C$DW$2218, DW_AT_TI_symbol_name("two_switches")
	.dwattr $C$DW$2218, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$2218, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2218, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2218, DW_AT_decl_line(0x204)
	.dwattr $C$DW$2218, DW_AT_decl_column(0x11)

$C$DW$2219	.dwtag  DW_TAG_member
	.dwattr $C$DW$2219, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2219, DW_AT_name("unassigned")
	.dwattr $C$DW$2219, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2219, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2219, DW_AT_bit_size(0x03)
	.dwattr $C$DW$2219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2219, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2219, DW_AT_decl_line(0x205)
	.dwattr $C$DW$2219, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$61, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$61


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x03)
$C$DW$2220	.dwtag  DW_TAG_member
	.dwattr $C$DW$2220, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$2220, DW_AT_name("flags")
	.dwattr $C$DW$2220, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$2220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2220, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2220, DW_AT_decl_line(0x20a)
	.dwattr $C$DW$2220, DW_AT_decl_column(0x1c)

$C$DW$2221	.dwtag  DW_TAG_member
	.dwattr $C$DW$2221, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2221, DW_AT_name("invert")
	.dwattr $C$DW$2221, DW_AT_TI_symbol_name("invert")
	.dwattr $C$DW$2221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2221, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2221, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$2221, DW_AT_decl_column(0x14)

$C$DW$2222	.dwtag  DW_TAG_member
	.dwattr $C$DW$2222, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2222, DW_AT_name("disable_pullup")
	.dwattr $C$DW$2222, DW_AT_TI_symbol_name("disable_pullup")
	.dwattr $C$DW$2222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2222, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2222, DW_AT_decl_line(0x20c)
	.dwattr $C$DW$2222, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x209)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$63

$C$DW$T$89	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$89, DW_AT_name("limit_settings_t")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x20d)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
$C$DW$2223	.dwtag  DW_TAG_member
	.dwattr $C$DW$2223, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2223, DW_AT_name("enabled")
	.dwattr $C$DW$2223, DW_AT_TI_symbol_name("enabled")
	.dwattr $C$DW$2223, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2223, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2223, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2223, DW_AT_decl_line(0x186)
	.dwattr $C$DW$2223, DW_AT_decl_column(0x11)

$C$DW$2224	.dwtag  DW_TAG_member
	.dwattr $C$DW$2224, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2224, DW_AT_name("deactivate_upon_init")
	.dwattr $C$DW$2224, DW_AT_TI_symbol_name("deactivate_upon_init")
	.dwattr $C$DW$2224, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2224, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2224, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2224, DW_AT_decl_line(0x187)
	.dwattr $C$DW$2224, DW_AT_decl_column(0x11)

$C$DW$2225	.dwtag  DW_TAG_member
	.dwattr $C$DW$2225, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2225, DW_AT_name("enable_override_control")
	.dwattr $C$DW$2225, DW_AT_TI_symbol_name("enable_override_control")
	.dwattr $C$DW$2225, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$2225, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2225, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2225, DW_AT_decl_line(0x188)
	.dwattr $C$DW$2225, DW_AT_decl_column(0x11)

$C$DW$2226	.dwtag  DW_TAG_member
	.dwattr $C$DW$2226, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2226, DW_AT_name("unassigned")
	.dwattr $C$DW$2226, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2226, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2226, DW_AT_bit_size(0x05)
	.dwattr $C$DW$2226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2226, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2226, DW_AT_decl_line(0x189)
	.dwattr $C$DW$2226, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$64


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x12)
$C$DW$2227	.dwtag  DW_TAG_member
	.dwattr $C$DW$2227, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$2227, DW_AT_name("flags")
	.dwattr $C$DW$2227, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$2227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2227, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2227, DW_AT_decl_line(0x18e)
	.dwattr $C$DW$2227, DW_AT_decl_column(0x1d)

$C$DW$2228	.dwtag  DW_TAG_member
	.dwattr $C$DW$2228, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2228, DW_AT_name("axis")
	.dwattr $C$DW$2228, DW_AT_TI_symbol_name("axis")
	.dwattr $C$DW$2228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2228, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2228, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$2228, DW_AT_decl_column(0x0d)

$C$DW$2229	.dwtag  DW_TAG_member
	.dwattr $C$DW$2229, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2229, DW_AT_name("target")
	.dwattr $C$DW$2229, DW_AT_TI_symbol_name("target")
	.dwattr $C$DW$2229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2229, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2229, DW_AT_decl_line(0x190)
	.dwattr $C$DW$2229, DW_AT_decl_column(0x0b)

$C$DW$2230	.dwtag  DW_TAG_member
	.dwattr $C$DW$2230, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2230, DW_AT_name("rate")
	.dwattr $C$DW$2230, DW_AT_TI_symbol_name("rate")
	.dwattr $C$DW$2230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$2230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2230, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2230, DW_AT_decl_line(0x191)
	.dwattr $C$DW$2230, DW_AT_decl_column(0x0b)

$C$DW$2231	.dwtag  DW_TAG_member
	.dwattr $C$DW$2231, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2231, DW_AT_name("pullout_rate")
	.dwattr $C$DW$2231, DW_AT_TI_symbol_name("pullout_rate")
	.dwattr $C$DW$2231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$2231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2231, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2231, DW_AT_decl_line(0x192)
	.dwattr $C$DW$2231, DW_AT_decl_column(0x0b)

$C$DW$2232	.dwtag  DW_TAG_member
	.dwattr $C$DW$2232, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2232, DW_AT_name("pullout_increment")
	.dwattr $C$DW$2232, DW_AT_TI_symbol_name("pullout_increment")
	.dwattr $C$DW$2232, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$2232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2232, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2232, DW_AT_decl_line(0x193)
	.dwattr $C$DW$2232, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$66, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$66

$C$DW$T$90	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$90, DW_AT_name("parking_settings_t")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x03)


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
$C$DW$2233	.dwtag  DW_TAG_member
	.dwattr $C$DW$2233, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2233, DW_AT_name("ignore_when_idle")
	.dwattr $C$DW$2233, DW_AT_TI_symbol_name("ignore_when_idle")
	.dwattr $C$DW$2233, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$2233, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2233, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2233, DW_AT_decl_line(0x177)
	.dwattr $C$DW$2233, DW_AT_decl_column(0x11)

$C$DW$2234	.dwtag  DW_TAG_member
	.dwattr $C$DW$2234, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2234, DW_AT_name("keep_coolant_on")
	.dwattr $C$DW$2234, DW_AT_TI_symbol_name("keep_coolant_on")
	.dwattr $C$DW$2234, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$2234, DW_AT_bit_size(0x01)
	.dwattr $C$DW$2234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2234, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2234, DW_AT_decl_line(0x178)
	.dwattr $C$DW$2234, DW_AT_decl_column(0x11)

$C$DW$2235	.dwtag  DW_TAG_member
	.dwattr $C$DW$2235, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2235, DW_AT_name("unassigned")
	.dwattr $C$DW$2235, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$2235, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$2235, DW_AT_bit_size(0x06)
	.dwattr $C$DW$2235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2235, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2235, DW_AT_decl_line(0x179)
	.dwattr $C$DW$2235, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$67, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x176)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$67


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x0a)
$C$DW$2236	.dwtag  DW_TAG_member
	.dwattr $C$DW$2236, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$2236, DW_AT_name("flags")
	.dwattr $C$DW$2236, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$2236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$2236, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$2236, DW_AT_decl_line(0x17e)
