;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed Jun  7 18:51:47 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../serial.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
;	Interrupt vector table mappings
	.intvec	".int46",	USCI1RX_ISR
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("PDIN_H")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("PDIN_H")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$814)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:\ti\ccs1230\ccs\ccs_base\msp430\include\msp430f5529.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x681)
	.dwattr $C$DW$1, DW_AT_decl_column(0x01)

$C$DW$2	.dwtag  DW_TAG_variable

	.dwattr $C$DW$862, DW_AT_decl_column(0x05)

$C$DW$863	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$863, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$863, DW_AT_const_value(0x2d)
	.dwattr $C$DW$863, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$863, DW_AT_decl_line(0x54)
	.dwattr $C$DW$863, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$765, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$765, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$765, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$765

$C$DW$T$766	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$766, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$766, DW_AT_type(*$C$DW$T$765)
	.dwattr $C$DW$T$766, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$766, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$766, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$766, DW_AT_decl_column(0x03)


$C$DW$T$767	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$767, DW_AT_byte_size(0x02)
$C$DW$864	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$864, DW_AT_name("Message_Plain")
	.dwattr $C$DW$864, DW_AT_const_value(0x00)
	.dwattr $C$DW$864, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$864, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$864, DW_AT_decl_column(0x05)

$C$DW$865	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$865, DW_AT_name("Message_Info")
	.dwattr $C$DW$865, DW_AT_const_value(0x01)
	.dwattr $C$DW$865, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$865, DW_AT_decl_line(0x20)
	.dwattr $C$DW$865, DW_AT_decl_column(0x05)

$C$DW$866	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$866, DW_AT_name("Message_Warning")
	.dwattr $C$DW$866, DW_AT_const_value(0x02)
	.dwattr $C$DW$866, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$866, DW_AT_decl_line(0x21)
	.dwattr $C$DW$866, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$767, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$767, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$767, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$767

$C$DW$T$768	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$768, DW_AT_name("message_type_t")
	.dwattr $C$DW$T$768, DW_AT_type(*$C$DW$T$767)
	.dwattr $C$DW$T$768, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$768, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$768, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$768, DW_AT_decl_column(0x03)


$C$DW$T$769	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$769, DW_AT_byte_size(0x02)
$C$DW$867	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$867, DW_AT_name("SettingsFormat_MachineReadable")
	.dwattr $C$DW$867, DW_AT_const_value(0x00)
	.dwattr $C$DW$867, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$867, DW_AT_decl_line(0x25)
	.dwattr $C$DW$867, DW_AT_decl_column(0x05)

$C$DW$868	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$868, DW_AT_name("SettingsFormat_HumanReadable")
	.dwattr $C$DW$868, DW_AT_const_value(0x01)
	.dwattr $C$DW$868, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$868, DW_AT_decl_line(0x26)
	.dwattr $C$DW$868, DW_AT_decl_column(0x05)

$C$DW$869	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$869, DW_AT_name("SettingsFormat_Grbl")
	.dwattr $C$DW$869, DW_AT_const_value(0x02)
	.dwattr $C$DW$869, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$869, DW_AT_decl_line(0x27)
	.dwattr $C$DW$869, DW_AT_decl_column(0x05)

$C$DW$870	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$870, DW_AT_name("SettingsFormat_grblHAL")
	.dwattr $C$DW$870, DW_AT_const_value(0x03)
	.dwattr $C$DW$870, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$870, DW_AT_decl_line(0x28)
	.dwattr $C$DW$870, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$769, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$769, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$769, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$769

$C$DW$T$770	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$770, DW_AT_name("settings_format_t")
	.dwattr $C$DW$T$770, DW_AT_type(*$C$DW$T$769)
	.dwattr $C$DW$T$770, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$770, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$770, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$770, DW_AT_decl_column(0x03)


$C$DW$T$771	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$771, DW_AT_byte_size(0x02)
$C$DW$871	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$871, DW_AT_name("PullMode_None")
	.dwattr $C$DW$871, DW_AT_const_value(0x00)
	.dwattr $C$DW$871, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$871, DW_AT_decl_line(0x143)
	.dwattr $C$DW$871, DW_AT_decl_column(0x05)

$C$DW$872	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$872, DW_AT_name("PullMode_Up")
	.dwattr $C$DW$872, DW_AT_const_value(0x01)
	.dwattr $C$DW$872, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$872, DW_AT_decl_line(0x144)
	.dwattr $C$DW$872, DW_AT_decl_column(0x05)

$C$DW$873	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$873, DW_AT_name("PullMode_Down")
	.dwattr $C$DW$873, DW_AT_const_value(0x02)
	.dwattr $C$DW$873, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$873, DW_AT_decl_line(0x145)
	.dwattr $C$DW$873, DW_AT_decl_column(0x05)

$C$DW$874	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$874, DW_AT_name("PullMode_UpDown")
	.dwattr $C$DW$874, DW_AT_const_value(0x03)
	.dwattr $C$DW$874, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$874, DW_AT_decl_line(0x146)
	.dwattr $C$DW$874, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$771, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$771, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$771, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$771

$C$DW$T$772	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$772, DW_AT_name("pull_mode_t")
	.dwattr $C$DW$T$772, DW_AT_type(*$C$DW$T$771)
	.dwattr $C$DW$T$772, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$772, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$772, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$772, DW_AT_decl_column(0x03)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
$C$DW$875	.dwtag  DW_TAG_member
	.dwattr $C$DW$875, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$875, DW_AT_name("connected")
	.dwattr $C$DW$875, DW_AT_TI_symbol_name("connected")
	.dwattr $C$DW$875, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$875, DW_AT_bit_size(0x01)
	.dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$875, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$875, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$875, DW_AT_decl_column(0x11)

$C$DW$876	.dwtag  DW_TAG_member
	.dwattr $C$DW$876, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$876, DW_AT_name("webui_connected")
	.dwattr $C$DW$876, DW_AT_TI_symbol_name("webui_connected")
	.dwattr $C$DW$876, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$876, DW_AT_bit_size(0x01)
	.dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$876, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$876, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$876, DW_AT_decl_column(0x11)

$C$DW$877	.dwtag  DW_TAG_member
	.dwattr $C$DW$877, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$877, DW_AT_name("is_usb")
	.dwattr $C$DW$877, DW_AT_TI_symbol_name("is_usb")
	.dwattr $C$DW$877, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$877, DW_AT_bit_size(0x01)
	.dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$877, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$877, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$877, DW_AT_decl_column(0x11)

$C$DW$878	.dwtag  DW_TAG_member
	.dwattr $C$DW$878, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$878, DW_AT_name("unused")
	.dwattr $C$DW$878, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$878, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$878, DW_AT_bit_size(0x05)
	.dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$878, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$878, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$878, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$23


$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x44)
$C$DW$879	.dwtag  DW_TAG_member
	.dwattr $C$DW$879, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$879, DW_AT_name("type")
	.dwattr $C$DW$879, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$879, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$879, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$879, DW_AT_decl_column(0x13)

$C$DW$880	.dwtag  DW_TAG_member
	.dwattr $C$DW$880, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$880, DW_AT_name("instance")
	.dwattr $C$DW$880, DW_AT_TI_symbol_name("instance")
	.dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$880, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$880, DW_AT_decl_line(0xde)
	.dwattr $C$DW$880, DW_AT_decl_column(0x0d)

$C$DW$881	.dwtag  DW_TAG_member
	.dwattr $C$DW$881, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$881, DW_AT_name("state")
	.dwattr $C$DW$881, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$881, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$881, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$881, DW_AT_decl_column(0x17)

$C$DW$882	.dwtag  DW_TAG_member
	.dwattr $C$DW$882, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$882, DW_AT_name("get_rx_buffer_free")
	.dwattr $C$DW$882, DW_AT_TI_symbol_name("get_rx_buffer_free")
	.dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$882, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$882, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$882, DW_AT_decl_column(0x21)

$C$DW$883	.dwtag  DW_TAG_member
	.dwattr $C$DW$883, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$883, DW_AT_name("write")
	.dwattr $C$DW$883, DW_AT_TI_symbol_name("write")
	.dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$883, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$883, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$883, DW_AT_decl_column(0x16)

$C$DW$884	.dwtag  DW_TAG_member
	.dwattr $C$DW$884, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$884, DW_AT_name("write_all")
	.dwattr $C$DW$884, DW_AT_TI_symbol_name("write_all")
	.dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$884, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$884, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$884, DW_AT_decl_column(0x16)

$C$DW$885	.dwtag  DW_TAG_member
	.dwattr $C$DW$885, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$885, DW_AT_name("write_char")
	.dwattr $C$DW$885, DW_AT_TI_symbol_name("write_char")
	.dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$885, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$885, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$885, DW_AT_decl_column(0x1b)

$C$DW$886	.dwtag  DW_TAG_member
	.dwattr $C$DW$886, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$886, DW_AT_name("enqueue_rt_command")
	.dwattr $C$DW$886, DW_AT_TI_symbol_name("enqueue_rt_command")
	.dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$886, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$886, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$886, DW_AT_decl_column(0x23)

$C$DW$887	.dwtag  DW_TAG_member
	.dwattr $C$DW$887, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$887, DW_AT_name("read")
	.dwattr $C$DW$887, DW_AT_TI_symbol_name("read")
	.dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$887, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$887, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$887, DW_AT_decl_column(0x15)

$C$DW$888	.dwtag  DW_TAG_member
	.dwattr $C$DW$888, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$888, DW_AT_name("reset_read_buffer")
	.dwattr $C$DW$888, DW_AT_TI_symbol_name("reset_read_buffer")
	.dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$888, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$888, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$888, DW_AT_decl_column(0x1d)

$C$DW$889	.dwtag  DW_TAG_member
	.dwattr $C$DW$889, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$889, DW_AT_name("cancel_read_buffer")
	.dwattr $C$DW$889, DW_AT_TI_symbol_name("cancel_read_buffer")
	.dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$889, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$889, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$889, DW_AT_decl_column(0x1c)

$C$DW$890	.dwtag  DW_TAG_member
	.dwattr $C$DW$890, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$890, DW_AT_name("set_enqueue_rt_handler")
	.dwattr $C$DW$890, DW_AT_TI_symbol_name("set_enqueue_rt_handler")
	.dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$890, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$890, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$890, DW_AT_decl_column(0x20)

$C$DW$891	.dwtag  DW_TAG_member
	.dwattr $C$DW$891, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$891, DW_AT_name("suspend_read")
	.dwattr $C$DW$891, DW_AT_TI_symbol_name("suspend_read")
	.dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$891, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$891, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$891, DW_AT_decl_column(0x16)

$C$DW$892	.dwtag  DW_TAG_member
	.dwattr $C$DW$892, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$892, DW_AT_name("write_n")
	.dwattr $C$DW$892, DW_AT_TI_symbol_name("write_n")
	.dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$892, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$892, DW_AT_decl_line(0xea)
	.dwattr $C$DW$892, DW_AT_decl_column(0x18)

$C$DW$893	.dwtag  DW_TAG_member
	.dwattr $C$DW$893, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$893, DW_AT_name("disable_rx")
	.dwattr $C$DW$893, DW_AT_TI_symbol_name("disable_rx")
	.dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$893, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$893, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$893, DW_AT_decl_column(0x1b)

$C$DW$894	.dwtag  DW_TAG_member
	.dwattr $C$DW$894, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$894, DW_AT_name("get_rx_buffer_count")
	.dwattr $C$DW$894, DW_AT_TI_symbol_name("get_rx_buffer_count")
	.dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$894, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$894, DW_AT_decl_line(0xec)
	.dwattr $C$DW$894, DW_AT_decl_column(0x21)

$C$DW$895	.dwtag  DW_TAG_member
	.dwattr $C$DW$895, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$895, DW_AT_name("get_tx_buffer_count")
	.dwattr $C$DW$895, DW_AT_TI_symbol_name("get_tx_buffer_count")
	.dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$895, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$895, DW_AT_decl_line(0xed)
	.dwattr $C$DW$895, DW_AT_decl_column(0x21)

$C$DW$896	.dwtag  DW_TAG_member
	.dwattr $C$DW$896, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$896, DW_AT_name("reset_write_buffer")
	.dwattr $C$DW$896, DW_AT_TI_symbol_name("reset_write_buffer")
	.dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$896, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$896, DW_AT_decl_line(0xee)
	.dwattr $C$DW$896, DW_AT_decl_column(0x1d)

$C$DW$897	.dwtag  DW_TAG_member
	.dwattr $C$DW$897, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$897, DW_AT_name("set_baud_rate")
	.dwattr $C$DW$897, DW_AT_TI_symbol_name("set_baud_rate")
	.dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$897, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$897, DW_AT_decl_line(0xef)
	.dwattr $C$DW$897, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$70, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$70

$C$DW$T$74	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$74, DW_AT_name("io_stream_t")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x03)

$C$DW$898	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$898, DW_AT_type(*$C$DW$T$74)

$C$DW$T$75	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$898)

$C$DW$T$76	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$76, DW_AT_address_class(0x14)


$C$DW$T$77	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
$C$DW$899	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$899, DW_AT_type(*$C$DW$T$66)

	.dwendtag $C$DW$T$77

$C$DW$T$78	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$78, DW_AT_address_class(0x14)

$C$DW$T$79	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$79, DW_AT_name("stream_claim_ptr")
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$79, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x1e)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x10)
$C$DW$900	.dwtag  DW_TAG_member
	.dwattr $C$DW$900, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$900, DW_AT_name("__max_align1")
	.dwattr $C$DW$900, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$900, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$900, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$900, DW_AT_decl_column(0x0c)

$C$DW$901	.dwtag  DW_TAG_member
	.dwattr $C$DW$901, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$901, DW_AT_name("__max_align2")
	.dwattr $C$DW$901, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$901, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$901, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$901, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$71

$C$DW$T$777	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$777, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$777, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$777, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$777, DW_AT_decl_file("C:/ti/ccs1230/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$777, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$777, DW_AT_decl_column(0x03)


$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x01)
$C$DW$902	.dwtag  DW_TAG_member
	.dwattr $C$DW$902, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$902, DW_AT_name("connected")
	.dwattr $C$DW$902, DW_AT_TI_symbol_name("connected")
	.dwattr $C$DW$902, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$902, DW_AT_bit_size(0x01)
	.dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$902, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$902, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$902, DW_AT_decl_column(0x11)

$C$DW$903	.dwtag  DW_TAG_member
	.dwattr $C$DW$903, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$903, DW_AT_name("claimable")
	.dwattr $C$DW$903, DW_AT_TI_symbol_name("claimable")
	.dwattr $C$DW$903, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$903, DW_AT_bit_size(0x01)
	.dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$903, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$903, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$903, DW_AT_decl_column(0x11)

$C$DW$904	.dwtag  DW_TAG_member
	.dwattr $C$DW$904, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$904, DW_AT_name("claimed")
	.dwattr $C$DW$904, DW_AT_TI_symbol_name("claimed")
	.dwattr $C$DW$904, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$904, DW_AT_bit_size(0x01)
	.dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$904, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$904, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$904, DW_AT_decl_column(0x11)

$C$DW$905	.dwtag  DW_TAG_member
	.dwattr $C$DW$905, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$905, DW_AT_name("can_set_baud")
	.dwattr $C$DW$905, DW_AT_TI_symbol_name("can_set_baud")
	.dwattr $C$DW$905, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$905, DW_AT_bit_size(0x01)
	.dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$905, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$905, DW_AT_decl_line(0xca)
	.dwattr $C$DW$905, DW_AT_decl_column(0x11)

$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$906, DW_AT_name("rx_only")
	.dwattr $C$DW$906, DW_AT_TI_symbol_name("rx_only")
	.dwattr $C$DW$906, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$906, DW_AT_bit_size(0x01)
	.dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$906, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$906, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$906, DW_AT_decl_column(0x11)

$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$907, DW_AT_name("modbus_ready")
	.dwattr $C$DW$907, DW_AT_TI_symbol_name("modbus_ready")
	.dwattr $C$DW$907, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$907, DW_AT_bit_size(0x01)
	.dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$907, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$907, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$907, DW_AT_decl_column(0x11)

$C$DW$908	.dwtag  DW_TAG_member
	.dwattr $C$DW$908, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$908, DW_AT_name("unused")
	.dwattr $C$DW$908, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$908, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$908, DW_AT_bit_size(0x02)
	.dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$908, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$908, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$908, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$72, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$72


$C$DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
$C$DW$909	.dwtag  DW_TAG_member
	.dwattr $C$DW$909, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$909, DW_AT_name("type")
	.dwattr $C$DW$909, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$909, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$909, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$909, DW_AT_decl_column(0x13)

$C$DW$910	.dwtag  DW_TAG_member
	.dwattr $C$DW$910, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$910, DW_AT_name("instance")
	.dwattr $C$DW$910, DW_AT_TI_symbol_name("instance")
	.dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$910, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$910, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$910, DW_AT_decl_column(0x0d)

$C$DW$911	.dwtag  DW_TAG_member
	.dwattr $C$DW$911, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$911, DW_AT_name("flags")
	.dwattr $C$DW$911, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$911, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$911, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$911, DW_AT_decl_column(0x17)

$C$DW$912	.dwtag  DW_TAG_member
	.dwattr $C$DW$912, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$912, DW_AT_name("claim")
	.dwattr $C$DW$912, DW_AT_TI_symbol_name("claim")
	.dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$912, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$912, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$912, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$80, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$80

$C$DW$T$682	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$682, DW_AT_name("io_stream_properties_t")
	.dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$682, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$682, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$682, DW_AT_decl_column(0x03)

$C$DW$T$683	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$682)
	.dwattr $C$DW$T$683, DW_AT_address_class(0x14)

$C$DW$913	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$913, DW_AT_type(*$C$DW$T$682)

$C$DW$T$778	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$778, DW_AT_type(*$C$DW$913)

$C$DW$T$779	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$779, DW_AT_type(*$C$DW$T$778)
	.dwattr $C$DW$T$779, DW_AT_address_class(0x14)


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x106)
$C$DW$914	.dwtag  DW_TAG_member
	.dwattr $C$DW$914, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$914, DW_AT_name("head")
	.dwattr $C$DW$914, DW_AT_TI_symbol_name("head")
	.dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$914, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$914, DW_AT_decl_line(0x106)
	.dwattr $C$DW$914, DW_AT_decl_column(0x1c)

$C$DW$915	.dwtag  DW_TAG_member
	.dwattr $C$DW$915, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$915, DW_AT_name("tail")
	.dwattr $C$DW$915, DW_AT_TI_symbol_name("tail")
	.dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$915, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$915, DW_AT_decl_line(0x107)
	.dwattr $C$DW$915, DW_AT_decl_column(0x1c)

$C$DW$916	.dwtag  DW_TAG_member
	.dwattr $C$DW$916, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$916, DW_AT_name("overflow")
	.dwattr $C$DW$916, DW_AT_TI_symbol_name("overflow")
	.dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$916, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$916, DW_AT_decl_line(0x108)
	.dwattr $C$DW$916, DW_AT_decl_column(0x0a)

$C$DW$917	.dwtag  DW_TAG_member
	.dwattr $C$DW$917, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$917, DW_AT_name("backup")
	.dwattr $C$DW$917, DW_AT_TI_symbol_name("backup")
	.dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$917, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$917, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$917, DW_AT_decl_column(0x0a)

$C$DW$918	.dwtag  DW_TAG_member
	.dwattr $C$DW$918, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$918, DW_AT_name("data")
	.dwattr $C$DW$918, DW_AT_TI_symbol_name("data")
	.dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$918, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$918, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$918, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$85, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$85

$C$DW$T$780	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$780, DW_AT_name("stream_rx_buffer_t")
	.dwattr $C$DW$T$780, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$780, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$780, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$780, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$T$780, DW_AT_decl_column(0x03)


$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x84)
$C$DW$919	.dwtag  DW_TAG_member
	.dwattr $C$DW$919, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$919, DW_AT_name("head")
	.dwattr $C$DW$919, DW_AT_TI_symbol_name("head")
	.dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$919, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$919, DW_AT_decl_line(0x111)
	.dwattr $C$DW$919, DW_AT_decl_column(0x1c)

$C$DW$920	.dwtag  DW_TAG_member
	.dwattr $C$DW$920, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$920, DW_AT_name("tail")
	.dwattr $C$DW$920, DW_AT_TI_symbol_name("tail")
	.dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$920, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$920, DW_AT_decl_line(0x112)
	.dwattr $C$DW$920, DW_AT_decl_column(0x1c)

$C$DW$921	.dwtag  DW_TAG_member
	.dwattr $C$DW$921, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$921, DW_AT_name("data")
	.dwattr $C$DW$921, DW_AT_TI_symbol_name("data")
	.dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$921, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$921, DW_AT_decl_line(0x113)
	.dwattr $C$DW$921, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$87, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$87

$C$DW$T$781	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$781, DW_AT_name("stream_tx_buffer_t")
	.dwattr $C$DW$T$781, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$781, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$781, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$781, DW_AT_decl_line(0x114)
	.dwattr $C$DW$T$781, DW_AT_decl_column(0x03)


$C$DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x108)
$C$DW$922	.dwtag  DW_TAG_member
	.dwattr $C$DW$922, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$922, DW_AT_name("length")
	.dwattr $C$DW$922, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$922, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$922, DW_AT_decl_line(0x117)
	.dwattr $C$DW$922, DW_AT_decl_column(0x13)

$C$DW$923	.dwtag  DW_TAG_member
	.dwattr $C$DW$923, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$923, DW_AT_name("max_length")
	.dwattr $C$DW$923, DW_AT_TI_symbol_name("max_length")
	.dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$923, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$923, DW_AT_decl_line(0x118)
	.dwattr $C$DW$923, DW_AT_decl_column(0x13)

$C$DW$924	.dwtag  DW_TAG_member
	.dwattr $C$DW$924, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$924, DW_AT_name("s")
	.dwattr $C$DW$924, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$924, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$924, DW_AT_decl_line(0x119)
	.dwattr $C$DW$924, DW_AT_decl_column(0x0b)

$C$DW$925	.dwtag  DW_TAG_member
	.dwattr $C$DW$925, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$925, DW_AT_name("data")
	.dwattr $C$DW$925, DW_AT_TI_symbol_name("data")
	.dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$925, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$925, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$925, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$89

$C$DW$T$782	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$782, DW_AT_name("stream_block_tx_buffer_t")
	.dwattr $C$DW$T$782, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$782, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$782, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$782, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$T$782, DW_AT_decl_column(0x03)


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x20a)
$C$DW$926	.dwtag  DW_TAG_member
	.dwattr $C$DW$926, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$926, DW_AT_name("length")
	.dwattr $C$DW$926, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$926, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$926, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$926, DW_AT_decl_column(0x13)

$C$DW$927	.dwtag  DW_TAG_member
	.dwattr $C$DW$927, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$927, DW_AT_name("max_length")
	.dwattr $C$DW$927, DW_AT_TI_symbol_name("max_length")
	.dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$927, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$927, DW_AT_decl_line(0x120)
	.dwattr $C$DW$927, DW_AT_decl_column(0x13)

$C$DW$928	.dwtag  DW_TAG_member
	.dwattr $C$DW$928, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$928, DW_AT_name("s")
	.dwattr $C$DW$928, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$928, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$928, DW_AT_decl_line(0x121)
	.dwattr $C$DW$928, DW_AT_decl_column(0x0b)

$C$DW$929	.dwtag  DW_TAG_member
	.dwattr $C$DW$929, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$929, DW_AT_name("use_tx2data")
	.dwattr $C$DW$929, DW_AT_TI_symbol_name("use_tx2data")
	.dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$929, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$929, DW_AT_decl_line(0x122)
	.dwattr $C$DW$929, DW_AT_decl_column(0x0a)

$C$DW$930	.dwtag  DW_TAG_member
	.dwattr $C$DW$930, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$930, DW_AT_name("data")
	.dwattr $C$DW$930, DW_AT_TI_symbol_name("data")
	.dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$930, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$930, DW_AT_decl_line(0x123)
	.dwattr $C$DW$930, DW_AT_decl_column(0x0a)

$C$DW$931	.dwtag  DW_TAG_member
	.dwattr $C$DW$931, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$931, DW_AT_name("data2")
	.dwattr $C$DW$931, DW_AT_TI_symbol_name("data2")
	.dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x109]
	.dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$931, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$931, DW_AT_decl_line(0x124)
	.dwattr $C$DW$931, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$90

$C$DW$T$783	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$783, DW_AT_name("stream_block_tx_buffer2_t")
	.dwattr $C$DW$T$783, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$783, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$783, DW_AT_decl_file("..\grbl/stream.h")
	.dwattr $C$DW$T$783, DW_AT_decl_line(0x125)
	.dwattr $C$DW$T$783, DW_AT_decl_column(0x03)


$C$DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
$C$DW$932	.dwtag  DW_TAG_member
	.dwattr $C$DW$932, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$932, DW_AT_name("x")
	.dwattr $C$DW$932, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$932, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$932, DW_AT_bit_size(0x01)
	.dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$932, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$932, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$932, DW_AT_decl_column(0x11)

$C$DW$933	.dwtag  DW_TAG_member
	.dwattr $C$DW$933, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$933, DW_AT_name("y")
	.dwattr $C$DW$933, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$933, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$933, DW_AT_bit_size(0x01)
	.dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$933, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$933, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$933, DW_AT_decl_column(0x11)

$C$DW$934	.dwtag  DW_TAG_member
	.dwattr $C$DW$934, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$934, DW_AT_name("z")
	.dwattr $C$DW$934, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$934, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$934, DW_AT_bit_size(0x01)
	.dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$934, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$934, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$934, DW_AT_decl_column(0x11)

$C$DW$935	.dwtag  DW_TAG_member
	.dwattr $C$DW$935, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$935, DW_AT_name("a")
	.dwattr $C$DW$935, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$935, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$935, DW_AT_bit_size(0x01)
	.dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$935, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$935, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$935, DW_AT_decl_column(0x11)

$C$DW$936	.dwtag  DW_TAG_member
	.dwattr $C$DW$936, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$936, DW_AT_name("b")
	.dwattr $C$DW$936, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$936, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$936, DW_AT_bit_size(0x01)
	.dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$936, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$936, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$936, DW_AT_decl_column(0x11)

$C$DW$937	.dwtag  DW_TAG_member
	.dwattr $C$DW$937, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$937, DW_AT_name("c")
	.dwattr $C$DW$937, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$937, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$937, DW_AT_bit_size(0x01)
	.dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$937, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$937, DW_AT_decl_line(0x80)
	.dwattr $C$DW$937, DW_AT_decl_column(0x11)

$C$DW$938	.dwtag  DW_TAG_member
	.dwattr $C$DW$938, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$938, DW_AT_name("u")
	.dwattr $C$DW$938, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$938, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$938, DW_AT_bit_size(0x01)
	.dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$938, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$938, DW_AT_decl_line(0x81)
	.dwattr $C$DW$938, DW_AT_decl_column(0x11)

$C$DW$939	.dwtag  DW_TAG_member
	.dwattr $C$DW$939, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$939, DW_AT_name("v")
	.dwattr $C$DW$939, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$939, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$939, DW_AT_bit_size(0x01)
	.dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$939, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$939, DW_AT_decl_line(0x82)
	.dwattr $C$DW$939, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$91, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$91, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$91, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$91


$C$DW$T$93	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$93, DW_AT_byte_size(0x04)
$C$DW$940	.dwtag  DW_TAG_member
	.dwattr $C$DW$940, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$940, DW_AT_name("min")
	.dwattr $C$DW$940, DW_AT_TI_symbol_name("min")
	.dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$940, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$940, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$940, DW_AT_decl_column(0x14)

$C$DW$941	.dwtag  DW_TAG_member
	.dwattr $C$DW$941, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$941, DW_AT_name("max")
	.dwattr $C$DW$941, DW_AT_TI_symbol_name("max")
	.dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$941, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$941, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$941, DW_AT_decl_column(0x14)

$C$DW$942	.dwtag  DW_TAG_member
	.dwattr $C$DW$942, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$942, DW_AT_name("min2")
	.dwattr $C$DW$942, DW_AT_TI_symbol_name("min2")
	.dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$942, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$942, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$942, DW_AT_decl_column(0x14)

$C$DW$943	.dwtag  DW_TAG_member
	.dwattr $C$DW$943, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$943, DW_AT_name("max2")
	.dwattr $C$DW$943, DW_AT_TI_symbol_name("max2")
	.dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$943, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$943, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$943, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$93, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$93, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$93, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$93

$C$DW$T$180	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$180, DW_AT_name("limit_signals_t")
	.dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$180, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$180, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$180, DW_AT_decl_column(0x03)


$C$DW$T$490	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$490, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$T$490, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$490

$C$DW$T$491	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$491, DW_AT_type(*$C$DW$T$490)
	.dwattr $C$DW$T$491, DW_AT_address_class(0x14)

$C$DW$T$492	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$492, DW_AT_name("limits_get_state_ptr")
	.dwattr $C$DW$T$492, DW_AT_type(*$C$DW$T$491)
	.dwattr $C$DW$T$492, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$492, DW_AT_decl_file("..\grbl/hal.h")
	.dwattr $C$DW$T$492, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$492, DW_AT_decl_column(0x1b)


$C$DW$T$94	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$94, DW_AT_byte_size(0x01)
$C$DW$944	.dwtag  DW_TAG_member
	.dwattr $C$DW$944, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$944, DW_AT_name("flood")
	.dwattr $C$DW$944, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$944, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$944, DW_AT_bit_size(0x01)
	.dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$944, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$944, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$944, DW_AT_decl_column(0x11)

$C$DW$945	.dwtag  DW_TAG_member
	.dwattr $C$DW$945, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$945, DW_AT_name("mist")
	.dwattr $C$DW$945, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$945, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$945, DW_AT_bit_size(0x01)
	.dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$945, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$945, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$945, DW_AT_decl_column(0x11)

$C$DW$946	.dwtag  DW_TAG_member
	.dwattr $C$DW$946, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$946, DW_AT_name("shower")
	.dwattr $C$DW$946, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$946, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$946, DW_AT_bit_size(0x01)
	.dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$946, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$946, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$946, DW_AT_decl_column(0x11)

$C$DW$947	.dwtag  DW_TAG_member
	.dwattr $C$DW$947, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$947, DW_AT_name("trough_spindle")
	.dwattr $C$DW$947, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$947, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$947, DW_AT_bit_size(0x01)
	.dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$947, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$947, DW_AT_decl_line(0x20)
	.dwattr $C$DW$947, DW_AT_decl_column(0x11)

$C$DW$948	.dwtag  DW_TAG_member
	.dwattr $C$DW$948, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$948, DW_AT_name("unused")
	.dwattr $C$DW$948, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$948, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$948, DW_AT_bit_size(0x04)
	.dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$948, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$948, DW_AT_decl_line(0x21)
	.dwattr $C$DW$948, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$94, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$94, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$94, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$94


$C$DW$T$95	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
$C$DW$949	.dwtag  DW_TAG_member
	.dwattr $C$DW$949, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$949, DW_AT_name("on")
	.dwattr $C$DW$949, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$949, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$949, DW_AT_bit_size(0x01)
	.dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$949, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$949, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$949, DW_AT_decl_column(0x11)

$C$DW$950	.dwtag  DW_TAG_member
	.dwattr $C$DW$950, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$950, DW_AT_name("ccw")
	.dwattr $C$DW$950, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$950, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$950, DW_AT_bit_size(0x01)
	.dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$950, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$950, DW_AT_decl_line(0x20)
	.dwattr $C$DW$950, DW_AT_decl_column(0x11)

$C$DW$951	.dwtag  DW_TAG_member
	.dwattr $C$DW$951, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$951, DW_AT_name("pwm")
	.dwattr $C$DW$951, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$951, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$951, DW_AT_bit_size(0x01)
	.dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$951, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$951, DW_AT_decl_line(0x21)
	.dwattr $C$DW$951, DW_AT_decl_column(0x11)

$C$DW$952	.dwtag  DW_TAG_member
	.dwattr $C$DW$952, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$952, DW_AT_name("reserved3")
	.dwattr $C$DW$952, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$952, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$952, DW_AT_bit_size(0x01)
	.dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$952, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$952, DW_AT_decl_line(0x22)
	.dwattr $C$DW$952, DW_AT_decl_column(0x11)

$C$DW$953	.dwtag  DW_TAG_member
	.dwattr $C$DW$953, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$953, DW_AT_name("reserved4")
	.dwattr $C$DW$953, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$953, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$953, DW_AT_bit_size(0x01)
	.dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$953, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$953, DW_AT_decl_line(0x23)
	.dwattr $C$DW$953, DW_AT_decl_column(0x11)

$C$DW$954	.dwtag  DW_TAG_member
	.dwattr $C$DW$954, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$954, DW_AT_name("encoder_error")
	.dwattr $C$DW$954, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$954, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$954, DW_AT_bit_size(0x01)
	.dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$954, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$954, DW_AT_decl_line(0x24)
	.dwattr $C$DW$954, DW_AT_decl_column(0x11)

$C$DW$955	.dwtag  DW_TAG_member
	.dwattr $C$DW$955, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$955, DW_AT_name("at_speed")
	.dwattr $C$DW$955, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$955, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$955, DW_AT_bit_size(0x01)
	.dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$955, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$955, DW_AT_decl_line(0x25)
	.dwattr $C$DW$955, DW_AT_decl_column(0x11)

$C$DW$956	.dwtag  DW_TAG_member
	.dwattr $C$DW$956, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$956, DW_AT_name("synchronized")
	.dwattr $C$DW$956, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$956, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$956, DW_AT_bit_size(0x01)
	.dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$956, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$956, DW_AT_decl_line(0x26)
	.dwattr $C$DW$956, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$95, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$95, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$95, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$95


$C$DW$T$96	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x0c)
$C$DW$957	.dwtag  DW_TAG_member
	.dwattr $C$DW$957, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$957, DW_AT_name("rpm")
	.dwattr $C$DW$957, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$957, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$957, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$957, DW_AT_decl_column(0x0b)

$C$DW$958	.dwtag  DW_TAG_member
	.dwattr $C$DW$958, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$958, DW_AT_name("start")
	.dwattr $C$DW$958, DW_AT_TI_symbol_name("start")
	.dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$958, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$958, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$958, DW_AT_decl_column(0x0b)

$C$DW$959	.dwtag  DW_TAG_member
	.dwattr $C$DW$959, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$959, DW_AT_name("end")
	.dwattr $C$DW$959, DW_AT_TI_symbol_name("end")
	.dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$959, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$959, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$959, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$96, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$96, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$96, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$96

$C$DW$T$99	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$99, DW_AT_name("pwm_piece_t")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$99, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x03)


$C$DW$T$100	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x30)
$C$DW$960	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$960, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$100


$C$DW$T$101	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x42)
$C$DW$961	.dwtag  DW_TAG_member
	.dwattr $C$DW$961, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$961, DW_AT_name("period")
	.dwattr $C$DW$961, DW_AT_TI_symbol_name("period")
	.dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$961, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$961, DW_AT_decl_line(0x32)
	.dwattr $C$DW$961, DW_AT_decl_column(0x13)

$C$DW$962	.dwtag  DW_TAG_member
	.dwattr $C$DW$962, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$962, DW_AT_name("off_value")
	.dwattr $C$DW$962, DW_AT_TI_symbol_name("off_value")
	.dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$962, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$962, DW_AT_decl_line(0x33)
	.dwattr $C$DW$962, DW_AT_decl_column(0x13)

$C$DW$963	.dwtag  DW_TAG_member
	.dwattr $C$DW$963, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$963, DW_AT_name("min_value")
	.dwattr $C$DW$963, DW_AT_TI_symbol_name("min_value")
	.dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$963, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$963, DW_AT_decl_line(0x34)
	.dwattr $C$DW$963, DW_AT_decl_column(0x13)

$C$DW$964	.dwtag  DW_TAG_member
	.dwattr $C$DW$964, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$964, DW_AT_name("max_value")
	.dwattr $C$DW$964, DW_AT_TI_symbol_name("max_value")
	.dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$964, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$964, DW_AT_decl_line(0x35)
	.dwattr $C$DW$964, DW_AT_decl_column(0x13)

$C$DW$965	.dwtag  DW_TAG_member
	.dwattr $C$DW$965, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$965, DW_AT_name("pwm_gradient")
	.dwattr $C$DW$965, DW_AT_TI_symbol_name("pwm_gradient")
	.dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$965, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$965, DW_AT_decl_line(0x36)
	.dwattr $C$DW$965, DW_AT_decl_column(0x0b)

$C$DW$966	.dwtag  DW_TAG_member
	.dwattr $C$DW$966, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$966, DW_AT_name("invert_pwm")
	.dwattr $C$DW$966, DW_AT_TI_symbol_name("invert_pwm")
	.dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$966, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$966, DW_AT_decl_line(0x37)
	.dwattr $C$DW$966, DW_AT_decl_column(0x0a)

$C$DW$967	.dwtag  DW_TAG_member
	.dwattr $C$DW$967, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$967, DW_AT_name("always_on")
	.dwattr $C$DW$967, DW_AT_TI_symbol_name("always_on")
	.dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$967, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$967, DW_AT_decl_line(0x38)
	.dwattr $C$DW$967, DW_AT_decl_column(0x0a)

$C$DW$968	.dwtag  DW_TAG_member
	.dwattr $C$DW$968, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$968, DW_AT_name("offset")
	.dwattr $C$DW$968, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$968, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$968, DW_AT_decl_line(0x39)
	.dwattr $C$DW$968, DW_AT_decl_column(0x12)

$C$DW$969	.dwtag  DW_TAG_member
	.dwattr $C$DW$969, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$969, DW_AT_name("n_pieces")
	.dwattr $C$DW$969, DW_AT_TI_symbol_name("n_pieces")
	.dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$969, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$969, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$969, DW_AT_decl_column(0x13)

$C$DW$970	.dwtag  DW_TAG_member
	.dwattr $C$DW$970, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$970, DW_AT_name("piece")
	.dwattr $C$DW$970, DW_AT_TI_symbol_name("piece")
	.dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$970, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$970, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$970, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$101, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$101, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$101, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$101

$C$DW$T$784	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$784, DW_AT_name("spindle_pwm_t")
	.dwattr $C$DW$T$784, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$784, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$784, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$784, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$784, DW_AT_decl_column(0x03)


$C$DW$T$103	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$103, DW_AT_byte_size(0x22)
$C$DW$971	.dwtag  DW_TAG_member
	.dwattr $C$DW$971, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$971, DW_AT_name("rpm")
	.dwattr $C$DW$971, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$971, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$971, DW_AT_decl_line(0x40)
	.dwattr $C$DW$971, DW_AT_decl_column(0x0b)

$C$DW$972	.dwtag  DW_TAG_member
	.dwattr $C$DW$972, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$972, DW_AT_name("rpm_low_limit")
	.dwattr $C$DW$972, DW_AT_TI_symbol_name("rpm_low_limit")
	.dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$972, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$972, DW_AT_decl_line(0x41)
	.dwattr $C$DW$972, DW_AT_decl_column(0x0b)

$C$DW$973	.dwtag  DW_TAG_member
	.dwattr $C$DW$973, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$973, DW_AT_name("rpm_high_limit")
	.dwattr $C$DW$973, DW_AT_TI_symbol_name("rpm_high_limit")
	.dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$973, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$973, DW_AT_decl_line(0x42)
	.dwattr $C$DW$973, DW_AT_decl_column(0x0b)

$C$DW$974	.dwtag  DW_TAG_member
	.dwattr $C$DW$974, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$974, DW_AT_name("angular_position")
	.dwattr $C$DW$974, DW_AT_TI_symbol_name("angular_position")
	.dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$974, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$974, DW_AT_decl_line(0x43)
	.dwattr $C$DW$974, DW_AT_decl_column(0x0b)

$C$DW$975	.dwtag  DW_TAG_member
	.dwattr $C$DW$975, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$975, DW_AT_name("rpm_programmed")
	.dwattr $C$DW$975, DW_AT_TI_symbol_name("rpm_programmed")
	.dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$975, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$975, DW_AT_decl_line(0x44)
	.dwattr $C$DW$975, DW_AT_decl_column(0x0b)

$C$DW$976	.dwtag  DW_TAG_member
	.dwattr $C$DW$976, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$976, DW_AT_name("index_count")
	.dwattr $C$DW$976, DW_AT_TI_symbol_name("index_count")
	.dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$976, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$976, DW_AT_decl_line(0x45)
	.dwattr $C$DW$976, DW_AT_decl_column(0x0e)

$C$DW$977	.dwtag  DW_TAG_member
	.dwattr $C$DW$977, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$977, DW_AT_name("pulse_count")
	.dwattr $C$DW$977, DW_AT_TI_symbol_name("pulse_count")
	.dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$977, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$977, DW_AT_decl_line(0x46)
	.dwattr $C$DW$977, DW_AT_decl_column(0x0e)

$C$DW$978	.dwtag  DW_TAG_member
	.dwattr $C$DW$978, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$978, DW_AT_name("error_count")
	.dwattr $C$DW$978, DW_AT_TI_symbol_name("error_count")
	.dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$978, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$978, DW_AT_decl_line(0x47)
	.dwattr $C$DW$978, DW_AT_decl_column(0x0e)

$C$DW$979	.dwtag  DW_TAG_member
	.dwattr $C$DW$979, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$979, DW_AT_name("state_programmed")
	.dwattr $C$DW$979, DW_AT_TI_symbol_name("state_programmed")
	.dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$979, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$979, DW_AT_decl_line(0x48)
	.dwattr $C$DW$979, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$103, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$103, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$103, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$103

$C$DW$T$470	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$470, DW_AT_name("spindle_data_t")
	.dwattr $C$DW$T$470, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$470, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$470, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$470, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$470, DW_AT_decl_column(0x03)

$C$DW$T$471	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$471, DW_AT_type(*$C$DW$T$470)
	.dwattr $C$DW$T$471, DW_AT_address_class(0x14)


$C$DW$T$474	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$474, DW_AT_type(*$C$DW$T$471)
	.dwattr $C$DW$T$474, DW_AT_language(DW_LANG_C)
$C$DW$980	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$980, DW_AT_type(*$C$DW$T$473)

	.dwendtag $C$DW$T$474

$C$DW$T$475	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$475, DW_AT_type(*$C$DW$T$474)
	.dwattr $C$DW$T$475, DW_AT_address_class(0x14)

$C$DW$T$476	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$476, DW_AT_name("spindle_get_data_ptr")
	.dwattr $C$DW$T$476, DW_AT_type(*$C$DW$T$475)
	.dwattr $C$DW$T$476, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$476, DW_AT_decl_file("..\grbl/hal.h")
	.dwattr $C$DW$T$476, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$T$476, DW_AT_decl_column(0x1b)


$C$DW$T$106	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$106, DW_AT_byte_size(0x06)
$C$DW$981	.dwtag  DW_TAG_member
	.dwattr $C$DW$981, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$981, DW_AT_name("id")
	.dwattr $C$DW$981, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$981, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$981, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$981, DW_AT_decl_column(0x13)

$C$DW$982	.dwtag  DW_TAG_member
	.dwattr $C$DW$982, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$982, DW_AT_name("description")
	.dwattr $C$DW$982, DW_AT_TI_symbol_name("description")
	.dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$982, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$982, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$982, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$106, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$T$106, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$106

$C$DW$T$677	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$677, DW_AT_name("status_detail_t")
	.dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$677, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$677, DW_AT_decl_file("..\grbl\errors.h")
	.dwattr $C$DW$T$677, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$677, DW_AT_decl_column(0x03)

$C$DW$983	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$983, DW_AT_type(*$C$DW$T$677)

$C$DW$T$678	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$678, DW_AT_type(*$C$DW$983)

$C$DW$T$679	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$678)
	.dwattr $C$DW$T$679, DW_AT_address_class(0x14)


$C$DW$T$107	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x02)
$C$DW$984	.dwtag  DW_TAG_member
	.dwattr $C$DW$984, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$984, DW_AT_name("jog_motion")
	.dwattr $C$DW$984, DW_AT_TI_symbol_name("jog_motion")
	.dwattr $C$DW$984, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$984, DW_AT_bit_size(0x01)
	.dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$984, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$984, DW_AT_decl_line(0x113)
	.dwattr $C$DW$984, DW_AT_decl_column(0x12)

$C$DW$985	.dwtag  DW_TAG_member
	.dwattr $C$DW$985, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$985, DW_AT_name("canned_cycle_change")
	.dwattr $C$DW$985, DW_AT_TI_symbol_name("canned_cycle_change")
	.dwattr $C$DW$985, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$985, DW_AT_bit_size(0x01)
	.dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$985, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$985, DW_AT_decl_line(0x114)
	.dwattr $C$DW$985, DW_AT_decl_column(0x12)

$C$DW$986	.dwtag  DW_TAG_member
	.dwattr $C$DW$986, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$986, DW_AT_name("arc_is_clockwise")
	.dwattr $C$DW$986, DW_AT_TI_symbol_name("arc_is_clockwise")
	.dwattr $C$DW$986, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$986, DW_AT_bit_size(0x01)
	.dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$986, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$986, DW_AT_decl_line(0x115)
	.dwattr $C$DW$986, DW_AT_decl_column(0x12)

$C$DW$987	.dwtag  DW_TAG_member
	.dwattr $C$DW$987, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$987, DW_AT_name("probe_is_away")
	.dwattr $C$DW$987, DW_AT_TI_symbol_name("probe_is_away")
	.dwattr $C$DW$987, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$987, DW_AT_bit_size(0x01)
	.dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$987, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$987, DW_AT_decl_line(0x116)
	.dwattr $C$DW$987, DW_AT_decl_column(0x12)

$C$DW$988	.dwtag  DW_TAG_member
	.dwattr $C$DW$988, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$988, DW_AT_name("probe_is_no_error")
	.dwattr $C$DW$988, DW_AT_TI_symbol_name("probe_is_no_error")
	.dwattr $C$DW$988, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$988, DW_AT_bit_size(0x01)
	.dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$988, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$988, DW_AT_decl_line(0x117)
	.dwattr $C$DW$988, DW_AT_decl_column(0x12)

$C$DW$989	.dwtag  DW_TAG_member
	.dwattr $C$DW$989, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$989, DW_AT_name("spindle_force_sync")
	.dwattr $C$DW$989, DW_AT_TI_symbol_name("spindle_force_sync")
	.dwattr $C$DW$989, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$989, DW_AT_bit_size(0x01)
	.dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$989, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$989, DW_AT_decl_line(0x118)
	.dwattr $C$DW$989, DW_AT_decl_column(0x12)

$C$DW$990	.dwtag  DW_TAG_member
	.dwattr $C$DW$990, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$990, DW_AT_name("laser_disable")
	.dwattr $C$DW$990, DW_AT_TI_symbol_name("laser_disable")
	.dwattr $C$DW$990, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$990, DW_AT_bit_size(0x01)
	.dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$990, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$990, DW_AT_decl_line(0x119)
	.dwattr $C$DW$990, DW_AT_decl_column(0x12)

$C$DW$991	.dwtag  DW_TAG_member
	.dwattr $C$DW$991, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$991, DW_AT_name("laser_is_motion")
	.dwattr $C$DW$991, DW_AT_TI_symbol_name("laser_is_motion")
	.dwattr $C$DW$991, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$991, DW_AT_bit_size(0x01)
	.dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$991, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$991, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$991, DW_AT_decl_column(0x12)

$C$DW$992	.dwtag  DW_TAG_member
	.dwattr $C$DW$992, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$992, DW_AT_name("set_coolant")
	.dwattr $C$DW$992, DW_AT_TI_symbol_name("set_coolant")
	.dwattr $C$DW$992, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$992, DW_AT_bit_size(0x01)
	.dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$992, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$992, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$992, DW_AT_decl_column(0x12)

$C$DW$993	.dwtag  DW_TAG_member
	.dwattr $C$DW$993, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$993, DW_AT_name("motion_mode_changed")
	.dwattr $C$DW$993, DW_AT_TI_symbol_name("motion_mode_changed")
	.dwattr $C$DW$993, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$993, DW_AT_bit_size(0x01)
	.dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$993, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$993, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$993, DW_AT_decl_column(0x12)

$C$DW$994	.dwtag  DW_TAG_member
	.dwattr $C$DW$994, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$994, DW_AT_name("reserved")
	.dwattr $C$DW$994, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$994, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$994, DW_AT_bit_size(0x06)
	.dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$994, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$994, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$994, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$107, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$107, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$107, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$107


$C$DW$T$108	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$108, DW_AT_byte_size(0x01)
$C$DW$995	.dwtag  DW_TAG_member
	.dwattr $C$DW$995, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$995, DW_AT_name("feed_rate_disable")
	.dwattr $C$DW$995, DW_AT_TI_symbol_name("feed_rate_disable")
	.dwattr $C$DW$995, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$995, DW_AT_bit_size(0x01)
	.dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$995, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$995, DW_AT_decl_line(0x125)
	.dwattr $C$DW$995, DW_AT_decl_column(0x11)

$C$DW$996	.dwtag  DW_TAG_member
	.dwattr $C$DW$996, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$996, DW_AT_name("feed_hold_disable")
	.dwattr $C$DW$996, DW_AT_TI_symbol_name("feed_hold_disable")
	.dwattr $C$DW$996, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$996, DW_AT_bit_size(0x01)
	.dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$996, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$996, DW_AT_decl_line(0x126)
	.dwattr $C$DW$996, DW_AT_decl_column(0x11)

$C$DW$997	.dwtag  DW_TAG_member
	.dwattr $C$DW$997, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$997, DW_AT_name("spindle_rpm_disable")
	.dwattr $C$DW$997, DW_AT_TI_symbol_name("spindle_rpm_disable")
	.dwattr $C$DW$997, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$997, DW_AT_bit_size(0x01)
	.dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$997, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$997, DW_AT_decl_line(0x127)
	.dwattr $C$DW$997, DW_AT_decl_column(0x11)

$C$DW$998	.dwtag  DW_TAG_member
	.dwattr $C$DW$998, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$998, DW_AT_name("parking_disable")
	.dwattr $C$DW$998, DW_AT_TI_symbol_name("parking_disable")
	.dwattr $C$DW$998, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$998, DW_AT_bit_size(0x01)
	.dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$998, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$998, DW_AT_decl_line(0x128)
	.dwattr $C$DW$998, DW_AT_decl_column(0x11)

$C$DW$999	.dwtag  DW_TAG_member
	.dwattr $C$DW$999, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$999, DW_AT_name("reserved")
	.dwattr $C$DW$999, DW_AT_TI_symbol_name("reserved")
	.dwattr $C$DW$999, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$999, DW_AT_bit_size(0x03)
	.dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$999, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$999, DW_AT_decl_line(0x129)
	.dwattr $C$DW$999, DW_AT_decl_column(0x11)

$C$DW$1000	.dwtag  DW_TAG_member
	.dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1000, DW_AT_name("sync")
	.dwattr $C$DW$1000, DW_AT_TI_symbol_name("sync")
	.dwattr $C$DW$1000, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1000, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1000, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1000, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1000, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$108, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$108, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$108, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$108


$C$DW$T$109	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$109, DW_AT_byte_size(0x0c)
$C$DW$1001	.dwtag  DW_TAG_member
	.dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1001, DW_AT_name("x")
	.dwattr $C$DW$1001, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1001, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1001, DW_AT_decl_line(0x132)
	.dwattr $C$DW$1001, DW_AT_decl_column(0x0f)

$C$DW$1002	.dwtag  DW_TAG_member
	.dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1002, DW_AT_name("y")
	.dwattr $C$DW$1002, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1002, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1002, DW_AT_decl_line(0x133)
	.dwattr $C$DW$1002, DW_AT_decl_column(0x0f)

$C$DW$1003	.dwtag  DW_TAG_member
	.dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1003, DW_AT_name("z")
	.dwattr $C$DW$1003, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1003, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1003, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1003, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$109, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0x131)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$109


$C$DW$T$113	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$113, DW_AT_byte_size(0x0e)
$C$DW$1004	.dwtag  DW_TAG_member
	.dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$1004, DW_AT_name("xyz")
	.dwattr $C$DW$1004, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1004, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1004, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1004, DW_AT_decl_column(0x0b)

$C$DW$1005	.dwtag  DW_TAG_member
	.dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$1005, DW_AT_name("id")
	.dwattr $C$DW$1005, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1005, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1005, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1005, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$113, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$113

$C$DW$T$115	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$115, DW_AT_name("coord_system_t")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$115, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$115, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$115, DW_AT_decl_column(0x03)


$C$DW$T$114	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x03)
$C$DW$1006	.dwtag  DW_TAG_member
	.dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1006, DW_AT_name("axis_0")
	.dwattr $C$DW$1006, DW_AT_TI_symbol_name("axis_0")
	.dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1006, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1006, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$1006, DW_AT_decl_column(0x0d)

$C$DW$1007	.dwtag  DW_TAG_member
	.dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1007, DW_AT_name("axis_1")
	.dwattr $C$DW$1007, DW_AT_TI_symbol_name("axis_1")
	.dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1007, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1007, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1007, DW_AT_decl_column(0x0d)

$C$DW$1008	.dwtag  DW_TAG_member
	.dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1008, DW_AT_name("axis_linear")
	.dwattr $C$DW$1008, DW_AT_TI_symbol_name("axis_linear")
	.dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1008, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1008, DW_AT_decl_line(0x151)
	.dwattr $C$DW$1008, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$114, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$114, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$114, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$114

$C$DW$T$785	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$785, DW_AT_name("plane_t")
	.dwattr $C$DW$T$785, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$785, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$785, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$785, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$785, DW_AT_decl_column(0x03)


$C$DW$T$118	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$118, DW_AT_byte_size(0x54)
$C$DW$1009	.dwtag  DW_TAG_member
	.dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1009, DW_AT_name("d")
	.dwattr $C$DW$1009, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1009, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1009, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1009, DW_AT_decl_column(0x0b)

$C$DW$1010	.dwtag  DW_TAG_member
	.dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1010, DW_AT_name("e")
	.dwattr $C$DW$1010, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1010, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1010, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1010, DW_AT_decl_column(0x0b)

$C$DW$1011	.dwtag  DW_TAG_member
	.dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1011, DW_AT_name("f")
	.dwattr $C$DW$1011, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1011, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1011, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$1011, DW_AT_decl_column(0x0b)

$C$DW$1012	.dwtag  DW_TAG_member
	.dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$1012, DW_AT_name("ijk")
	.dwattr $C$DW$1012, DW_AT_TI_symbol_name("ijk")
	.dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1012, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1012, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$1012, DW_AT_decl_column(0x0b)

$C$DW$1013	.dwtag  DW_TAG_member
	.dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1013, DW_AT_name("k")
	.dwattr $C$DW$1013, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1013, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1013, DW_AT_decl_line(0x160)
	.dwattr $C$DW$1013, DW_AT_decl_column(0x0b)

$C$DW$1014	.dwtag  DW_TAG_member
	.dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1014, DW_AT_name("p")
	.dwattr $C$DW$1014, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1014, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1014, DW_AT_decl_line(0x161)
	.dwattr $C$DW$1014, DW_AT_decl_column(0x0b)

$C$DW$1015	.dwtag  DW_TAG_member
	.dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1015, DW_AT_name("q")
	.dwattr $C$DW$1015, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1015, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1015, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1015, DW_AT_decl_column(0x0b)

$C$DW$1016	.dwtag  DW_TAG_member
	.dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1016, DW_AT_name("r")
	.dwattr $C$DW$1016, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1016, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1016, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1016, DW_AT_decl_column(0x0b)

$C$DW$1017	.dwtag  DW_TAG_member
	.dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1017, DW_AT_name("s")
	.dwattr $C$DW$1017, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1017, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1017, DW_AT_decl_line(0x164)
	.dwattr $C$DW$1017, DW_AT_decl_column(0x0b)

$C$DW$1018	.dwtag  DW_TAG_member
	.dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$1018, DW_AT_name("xyz")
	.dwattr $C$DW$1018, DW_AT_TI_symbol_name("xyz")
	.dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1018, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1018, DW_AT_decl_line(0x165)
	.dwattr $C$DW$1018, DW_AT_decl_column(0x0b)

$C$DW$1019	.dwtag  DW_TAG_member
	.dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$1019, DW_AT_name("coord_data")
	.dwattr $C$DW$1019, DW_AT_TI_symbol_name("coord_data")
	.dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1019, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1019, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1019, DW_AT_decl_column(0x14)

$C$DW$1020	.dwtag  DW_TAG_member
	.dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$1020, DW_AT_name("n")
	.dwattr $C$DW$1020, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1020, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1020, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1020, DW_AT_decl_column(0x0d)

$C$DW$1021	.dwtag  DW_TAG_member
	.dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1021, DW_AT_name("h")
	.dwattr $C$DW$1021, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1021, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1021, DW_AT_decl_line(0x168)
	.dwattr $C$DW$1021, DW_AT_decl_column(0x0e)

$C$DW$1022	.dwtag  DW_TAG_member
	.dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1022, DW_AT_name("t")
	.dwattr $C$DW$1022, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1022, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1022, DW_AT_decl_line(0x169)
	.dwattr $C$DW$1022, DW_AT_decl_column(0x0e)

$C$DW$1023	.dwtag  DW_TAG_member
	.dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$1023, DW_AT_name("l")
	.dwattr $C$DW$1023, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1023, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1023, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$1023, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$118, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$118, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$T$118, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$118

$C$DW$T$161	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$161, DW_AT_name("gc_values_t")
	.dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$161, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x03)


$C$DW$T$119	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$119, DW_AT_byte_size(0x04)
$C$DW$1024	.dwtag  DW_TAG_member
	.dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1024, DW_AT_name("e")
	.dwattr $C$DW$1024, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$1024, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$1024, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1024, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1024, DW_AT_decl_line(0x172)
	.dwattr $C$DW$1024, DW_AT_decl_column(0x12)

$C$DW$1025	.dwtag  DW_TAG_member
	.dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1025, DW_AT_name("f")
	.dwattr $C$DW$1025, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1025, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$1025, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1025, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1025, DW_AT_decl_line(0x173)
	.dwattr $C$DW$1025, DW_AT_decl_column(0x12)

$C$DW$1026	.dwtag  DW_TAG_member
	.dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1026, DW_AT_name("h")
	.dwattr $C$DW$1026, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$1026, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$1026, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1026, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1026, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1026, DW_AT_decl_column(0x12)

$C$DW$1027	.dwtag  DW_TAG_member
	.dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1027, DW_AT_name("i")
	.dwattr $C$DW$1027, DW_AT_TI_symbol_name("i")
	.dwattr $C$DW$1027, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$1027, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1027, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1027, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1027, DW_AT_decl_column(0x12)

$C$DW$1028	.dwtag  DW_TAG_member
	.dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1028, DW_AT_name("j")
	.dwattr $C$DW$1028, DW_AT_TI_symbol_name("j")
	.dwattr $C$DW$1028, DW_AT_bit_offset(0x1b)
	.dwattr $C$DW$1028, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1028, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1028, DW_AT_decl_line(0x176)
	.dwattr $C$DW$1028, DW_AT_decl_column(0x12)

$C$DW$1029	.dwtag  DW_TAG_member
	.dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1029, DW_AT_name("k")
	.dwattr $C$DW$1029, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$1029, DW_AT_bit_offset(0x1a)
	.dwattr $C$DW$1029, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1029, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1029, DW_AT_decl_line(0x177)
	.dwattr $C$DW$1029, DW_AT_decl_column(0x12)

$C$DW$1030	.dwtag  DW_TAG_member
	.dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1030, DW_AT_name("l")
	.dwattr $C$DW$1030, DW_AT_TI_symbol_name("l")
	.dwattr $C$DW$1030, DW_AT_bit_offset(0x19)
	.dwattr $C$DW$1030, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1030, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1030, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1030, DW_AT_decl_column(0x12)

$C$DW$1031	.dwtag  DW_TAG_member
	.dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1031, DW_AT_name("n")
	.dwattr $C$DW$1031, DW_AT_TI_symbol_name("n")
	.dwattr $C$DW$1031, DW_AT_bit_offset(0x18)
	.dwattr $C$DW$1031, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1031, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1031, DW_AT_decl_line(0x179)
	.dwattr $C$DW$1031, DW_AT_decl_column(0x12)

$C$DW$1032	.dwtag  DW_TAG_member
	.dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1032, DW_AT_name("p")
	.dwattr $C$DW$1032, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1032, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$1032, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1032, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1032, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$1032, DW_AT_decl_column(0x12)

$C$DW$1033	.dwtag  DW_TAG_member
	.dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1033, DW_AT_name("r")
	.dwattr $C$DW$1033, DW_AT_TI_symbol_name("r")
	.dwattr $C$DW$1033, DW_AT_bit_offset(0x16)
	.dwattr $C$DW$1033, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1033, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1033, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$1033, DW_AT_decl_column(0x12)

$C$DW$1034	.dwtag  DW_TAG_member
	.dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1034, DW_AT_name("s")
	.dwattr $C$DW$1034, DW_AT_TI_symbol_name("s")
	.dwattr $C$DW$1034, DW_AT_bit_offset(0x15)
	.dwattr $C$DW$1034, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1034, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1034, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$1034, DW_AT_decl_column(0x12)

$C$DW$1035	.dwtag  DW_TAG_member
	.dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1035, DW_AT_name("t")
	.dwattr $C$DW$1035, DW_AT_TI_symbol_name("t")
	.dwattr $C$DW$1035, DW_AT_bit_offset(0x14)
	.dwattr $C$DW$1035, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1035, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1035, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$1035, DW_AT_decl_column(0x12)

$C$DW$1036	.dwtag  DW_TAG_member
	.dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1036, DW_AT_name("x")
	.dwattr $C$DW$1036, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1036, DW_AT_bit_offset(0x13)
	.dwattr $C$DW$1036, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1036, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1036, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$1036, DW_AT_decl_column(0x12)

$C$DW$1037	.dwtag  DW_TAG_member
	.dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1037, DW_AT_name("y")
	.dwattr $C$DW$1037, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1037, DW_AT_bit_offset(0x12)
	.dwattr $C$DW$1037, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1037, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1037, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$1037, DW_AT_decl_column(0x12)

$C$DW$1038	.dwtag  DW_TAG_member
	.dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1038, DW_AT_name("z")
	.dwattr $C$DW$1038, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1038, DW_AT_bit_offset(0x11)
	.dwattr $C$DW$1038, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1038, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1038, DW_AT_decl_line(0x180)
	.dwattr $C$DW$1038, DW_AT_decl_column(0x12)

$C$DW$1039	.dwtag  DW_TAG_member
	.dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1039, DW_AT_name("q")
	.dwattr $C$DW$1039, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$1039, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$1039, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1039, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1039, DW_AT_decl_line(0x181)
	.dwattr $C$DW$1039, DW_AT_decl_column(0x12)

$C$DW$1040	.dwtag  DW_TAG_member
	.dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1040, DW_AT_name("d")
	.dwattr $C$DW$1040, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$1040, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1040, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1040, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1040, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$1040, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$119, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$T$119, DW_AT_decl_line(0x171)
	.dwattr $C$DW$T$119, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$119


$C$DW$T$137	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$137, DW_AT_byte_size(0x2e)
$C$DW$1041	.dwtag  DW_TAG_member
	.dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$1041, DW_AT_name("motion")
	.dwattr $C$DW$1041, DW_AT_TI_symbol_name("motion")
	.dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1041, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1041, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1041, DW_AT_decl_column(0x13)

$C$DW$1042	.dwtag  DW_TAG_member
	.dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$1042, DW_AT_name("feed_mode")
	.dwattr $C$DW$1042, DW_AT_TI_symbol_name("feed_mode")
	.dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1042, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1042, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1042, DW_AT_decl_column(0x11)

