;******************************************************************************
;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
;* Date/Time created: Wed May 31 19:52:39 2023                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../grbl/settings.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Administrator\Descargas\MSP430F5529\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("gc_state")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("gc_state")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$385)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\grbl\gcode.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x202)
	.dwattr $C$DW$1, DW_AT_decl_column(0x17)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("tool_table")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("tool_table")

	.dwattr $C$DW$1461, DW_AT_decl_column(0x05)

$C$DW$1462	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1462, DW_AT_name("NGCParam_Last")
	.dwattr $C$DW$1462, DW_AT_const_value(0x2d)
	.dwattr $C$DW$1462, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$1462, DW_AT_decl_line(0x54)
	.dwattr $C$DW$1462, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$797, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$797, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$797, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$797

$C$DW$T$798	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$798, DW_AT_name("ncg_name_param_id_t")
	.dwattr $C$DW$T$798, DW_AT_type(*$C$DW$T$797)
	.dwattr $C$DW$T$798, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$798, DW_AT_decl_file("..\grbl\ngc_params.h")
	.dwattr $C$DW$T$798, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$798, DW_AT_decl_column(0x03)


$C$DW$T$799	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$799, DW_AT_byte_size(0x02)
$C$DW$1463	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1463, DW_AT_name("Message_Plain")
	.dwattr $C$DW$1463, DW_AT_const_value(0x00)
	.dwattr $C$DW$1463, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1463, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1463, DW_AT_decl_column(0x05)

$C$DW$1464	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1464, DW_AT_name("Message_Info")
	.dwattr $C$DW$1464, DW_AT_const_value(0x01)
	.dwattr $C$DW$1464, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1464, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1464, DW_AT_decl_column(0x05)

$C$DW$1465	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1465, DW_AT_name("Message_Warning")
	.dwattr $C$DW$1465, DW_AT_const_value(0x02)
	.dwattr $C$DW$1465, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1465, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1465, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$799, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$799, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$799, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$799

$C$DW$T$800	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$800, DW_AT_name("message_type_t")
	.dwattr $C$DW$T$800, DW_AT_type(*$C$DW$T$799)
	.dwattr $C$DW$T$800, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$800, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$800, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$800, DW_AT_decl_column(0x03)


$C$DW$T$801	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$801, DW_AT_byte_size(0x02)
$C$DW$1466	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1466, DW_AT_name("SettingsFormat_MachineReadable")
	.dwattr $C$DW$1466, DW_AT_const_value(0x00)
	.dwattr $C$DW$1466, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1466, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1466, DW_AT_decl_column(0x05)

$C$DW$1467	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1467, DW_AT_name("SettingsFormat_HumanReadable")
	.dwattr $C$DW$1467, DW_AT_const_value(0x01)
	.dwattr $C$DW$1467, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1467, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1467, DW_AT_decl_column(0x05)

$C$DW$1468	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1468, DW_AT_name("SettingsFormat_Grbl")
	.dwattr $C$DW$1468, DW_AT_const_value(0x02)
	.dwattr $C$DW$1468, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1468, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1468, DW_AT_decl_column(0x05)

$C$DW$1469	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1469, DW_AT_name("SettingsFormat_grblHAL")
	.dwattr $C$DW$1469, DW_AT_const_value(0x03)
	.dwattr $C$DW$1469, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$1469, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1469, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$801, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$801, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$801, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$801

$C$DW$T$802	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$802, DW_AT_name("settings_format_t")
	.dwattr $C$DW$T$802, DW_AT_type(*$C$DW$T$801)
	.dwattr $C$DW$T$802, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$802, DW_AT_decl_file("..\grbl\report.h")
	.dwattr $C$DW$T$802, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$802, DW_AT_decl_column(0x03)


$C$DW$T$803	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$803, DW_AT_byte_size(0x02)
$C$DW$1470	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1470, DW_AT_name("PullMode_None")
	.dwattr $C$DW$1470, DW_AT_const_value(0x00)
	.dwattr $C$DW$1470, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1470, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1470, DW_AT_decl_column(0x05)

$C$DW$1471	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1471, DW_AT_name("PullMode_Up")
	.dwattr $C$DW$1471, DW_AT_const_value(0x01)
	.dwattr $C$DW$1471, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1471, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1471, DW_AT_decl_column(0x05)

$C$DW$1472	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1472, DW_AT_name("PullMode_Down")
	.dwattr $C$DW$1472, DW_AT_const_value(0x02)
	.dwattr $C$DW$1472, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1472, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1472, DW_AT_decl_column(0x05)

$C$DW$1473	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1473, DW_AT_name("PullMode_UpDown")
	.dwattr $C$DW$1473, DW_AT_const_value(0x03)
	.dwattr $C$DW$1473, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$1473, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1473, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$803, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$803, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$803, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$803

$C$DW$T$804	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$804, DW_AT_name("pull_mode_t")
	.dwattr $C$DW$T$804, DW_AT_type(*$C$DW$T$803)
	.dwattr $C$DW$T$804, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$804, DW_AT_decl_file("..\grbl\crossbar.h")
	.dwattr $C$DW$T$804, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$804, DW_AT_decl_column(0x03)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
$C$DW$1474	.dwtag  DW_TAG_member
	.dwattr $C$DW$1474, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1474, DW_AT_name("parent")
	.dwattr $C$DW$1474, DW_AT_TI_symbol_name("parent")
	.dwattr $C$DW$1474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1474, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1474, DW_AT_decl_line(0x296)
	.dwattr $C$DW$1474, DW_AT_decl_column(0x15)

$C$DW$1475	.dwtag  DW_TAG_member
	.dwattr $C$DW$1475, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$1475, DW_AT_name("id")
	.dwattr $C$DW$1475, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$1475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1475, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1475, DW_AT_decl_line(0x297)
	.dwattr $C$DW$1475, DW_AT_decl_column(0x15)

$C$DW$1476	.dwtag  DW_TAG_member
	.dwattr $C$DW$1476, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$1476, DW_AT_name("name")
	.dwattr $C$DW$1476, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1476, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1476, DW_AT_decl_line(0x298)
	.dwattr $C$DW$1476, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$27, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x295)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$27

$C$DW$T$706	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$706, DW_AT_name("setting_group_detail_t")
	.dwattr $C$DW$T$706, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$706, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$706, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$706, DW_AT_decl_line(0x299)
	.dwattr $C$DW$T$706, DW_AT_decl_column(0x03)

$C$DW$1477	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1477, DW_AT_type(*$C$DW$T$706)

$C$DW$T$707	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$707, DW_AT_type(*$C$DW$1477)

$C$DW$T$708	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$708, DW_AT_type(*$C$DW$T$707)
	.dwattr $C$DW$T$708, DW_AT_address_class(0x14)


$C$DW$T$805	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$707)
	.dwattr $C$DW$T$805, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$805, DW_AT_byte_size(0x98)
$C$DW$1478	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1478, DW_AT_upper_bound(0x12)

	.dwendtag $C$DW$T$805


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x12)
$C$DW$1479	.dwtag  DW_TAG_member
	.dwattr $C$DW$1479, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1479, DW_AT_name("feed_rate")
	.dwattr $C$DW$1479, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1479, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1479, DW_AT_decl_line(0x22e)
	.dwattr $C$DW$1479, DW_AT_decl_column(0x0b)

$C$DW$1480	.dwtag  DW_TAG_member
	.dwattr $C$DW$1480, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1480, DW_AT_name("seek_rate")
	.dwattr $C$DW$1480, DW_AT_TI_symbol_name("seek_rate")
	.dwattr $C$DW$1480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1480, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1480, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$1480, DW_AT_decl_column(0x0b)

$C$DW$1481	.dwtag  DW_TAG_member
	.dwattr $C$DW$1481, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1481, DW_AT_name("pulloff_rate")
	.dwattr $C$DW$1481, DW_AT_TI_symbol_name("pulloff_rate")
	.dwattr $C$DW$1481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1481, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1481, DW_AT_decl_line(0x230)
	.dwattr $C$DW$1481, DW_AT_decl_column(0x0b)

$C$DW$1482	.dwtag  DW_TAG_member
	.dwattr $C$DW$1482, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1482, DW_AT_name("probing_distance")
	.dwattr $C$DW$1482, DW_AT_TI_symbol_name("probing_distance")
	.dwattr $C$DW$1482, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1482, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1482, DW_AT_decl_line(0x231)
	.dwattr $C$DW$1482, DW_AT_decl_column(0x0b)

$C$DW$1483	.dwtag  DW_TAG_member
	.dwattr $C$DW$1483, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$1483, DW_AT_name("mode")
	.dwattr $C$DW$1483, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$1483, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1483, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1483, DW_AT_decl_line(0x232)
	.dwattr $C$DW$1483, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x22d)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$30

$C$DW$T$77	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$77, DW_AT_name("tool_change_settings_t")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$77, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x03)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x14)
$C$DW$1484	.dwtag  DW_TAG_member
	.dwattr $C$DW$1484, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1484, DW_AT_name("steps_per_mm")
	.dwattr $C$DW$1484, DW_AT_TI_symbol_name("steps_per_mm")
	.dwattr $C$DW$1484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1484, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1484, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$1484, DW_AT_decl_column(0x0b)

$C$DW$1485	.dwtag  DW_TAG_member
	.dwattr $C$DW$1485, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1485, DW_AT_name("max_rate")
	.dwattr $C$DW$1485, DW_AT_TI_symbol_name("max_rate")
	.dwattr $C$DW$1485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1485, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1485, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$1485, DW_AT_decl_column(0x0b)

$C$DW$1486	.dwtag  DW_TAG_member
	.dwattr $C$DW$1486, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1486, DW_AT_name("acceleration")
	.dwattr $C$DW$1486, DW_AT_TI_symbol_name("acceleration")
	.dwattr $C$DW$1486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1486, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1486, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$1486, DW_AT_decl_column(0x0b)

$C$DW$1487	.dwtag  DW_TAG_member
	.dwattr $C$DW$1487, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1487, DW_AT_name("max_travel")
	.dwattr $C$DW$1487, DW_AT_TI_symbol_name("max_travel")
	.dwattr $C$DW$1487, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1487, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1487, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$1487, DW_AT_decl_column(0x0b)

$C$DW$1488	.dwtag  DW_TAG_member
	.dwattr $C$DW$1488, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1488, DW_AT_name("dual_axis_offset")
	.dwattr $C$DW$1488, DW_AT_TI_symbol_name("dual_axis_offset")
	.dwattr $C$DW$1488, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1488, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1488, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$1488, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

$C$DW$T$78	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$78, DW_AT_name("axis_settings_t")
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$78, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x03)


$C$DW$T$79	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x3c)
$C$DW$1489	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1489, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$79


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
$C$DW$1490	.dwtag  DW_TAG_member
	.dwattr $C$DW$1490, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1490, DW_AT_name("reset")
	.dwattr $C$DW$1490, DW_AT_TI_symbol_name("reset")
	.dwattr $C$DW$1490, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1490, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1490, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1490, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1490, DW_AT_decl_column(0x12)

$C$DW$1491	.dwtag  DW_TAG_member
	.dwattr $C$DW$1491, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1491, DW_AT_name("feed_hold")
	.dwattr $C$DW$1491, DW_AT_TI_symbol_name("feed_hold")
	.dwattr $C$DW$1491, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1491, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1491, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1491, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1491, DW_AT_decl_column(0x12)

$C$DW$1492	.dwtag  DW_TAG_member
	.dwattr $C$DW$1492, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1492, DW_AT_name("cycle_start")
	.dwattr $C$DW$1492, DW_AT_TI_symbol_name("cycle_start")
	.dwattr $C$DW$1492, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1492, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1492, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1492, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1492, DW_AT_decl_column(0x12)

$C$DW$1493	.dwtag  DW_TAG_member
	.dwattr $C$DW$1493, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1493, DW_AT_name("safety_door_ajar")
	.dwattr $C$DW$1493, DW_AT_TI_symbol_name("safety_door_ajar")
	.dwattr $C$DW$1493, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1493, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1493, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1493, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1493, DW_AT_decl_column(0x12)

$C$DW$1494	.dwtag  DW_TAG_member
	.dwattr $C$DW$1494, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1494, DW_AT_name("block_delete")
	.dwattr $C$DW$1494, DW_AT_TI_symbol_name("block_delete")
	.dwattr $C$DW$1494, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1494, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1494, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1494, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1494, DW_AT_decl_column(0x12)

$C$DW$1495	.dwtag  DW_TAG_member
	.dwattr $C$DW$1495, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1495, DW_AT_name("stop_disable")
	.dwattr $C$DW$1495, DW_AT_TI_symbol_name("stop_disable")
	.dwattr $C$DW$1495, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1495, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1495, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1495, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1495, DW_AT_decl_column(0x12)

$C$DW$1496	.dwtag  DW_TAG_member
	.dwattr $C$DW$1496, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1496, DW_AT_name("e_stop")
	.dwattr $C$DW$1496, DW_AT_TI_symbol_name("e_stop")
	.dwattr $C$DW$1496, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1496, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1496, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1496, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1496, DW_AT_decl_column(0x12)

$C$DW$1497	.dwtag  DW_TAG_member
	.dwattr $C$DW$1497, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1497, DW_AT_name("probe_disconnected")
	.dwattr $C$DW$1497, DW_AT_TI_symbol_name("probe_disconnected")
	.dwattr $C$DW$1497, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1497, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1497, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1497, DW_AT_decl_line(0x83)
	.dwattr $C$DW$1497, DW_AT_decl_column(0x12)

$C$DW$1498	.dwtag  DW_TAG_member
	.dwattr $C$DW$1498, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1498, DW_AT_name("motor_fault")
	.dwattr $C$DW$1498, DW_AT_TI_symbol_name("motor_fault")
	.dwattr $C$DW$1498, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1498, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1498, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1498, DW_AT_decl_line(0x84)
	.dwattr $C$DW$1498, DW_AT_decl_column(0x12)

$C$DW$1499	.dwtag  DW_TAG_member
	.dwattr $C$DW$1499, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1499, DW_AT_name("motor_warning")
	.dwattr $C$DW$1499, DW_AT_TI_symbol_name("motor_warning")
	.dwattr $C$DW$1499, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1499, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1499, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1499, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1499, DW_AT_decl_column(0x12)

$C$DW$1500	.dwtag  DW_TAG_member
	.dwattr $C$DW$1500, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1500, DW_AT_name("limits_override")
	.dwattr $C$DW$1500, DW_AT_TI_symbol_name("limits_override")
	.dwattr $C$DW$1500, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1500, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1500, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1500, DW_AT_decl_line(0x86)
	.dwattr $C$DW$1500, DW_AT_decl_column(0x12)

$C$DW$1501	.dwtag  DW_TAG_member
	.dwattr $C$DW$1501, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1501, DW_AT_name("single_block")
	.dwattr $C$DW$1501, DW_AT_TI_symbol_name("single_block")
	.dwattr $C$DW$1501, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1501, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1501, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1501, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1501, DW_AT_decl_column(0x12)

$C$DW$1502	.dwtag  DW_TAG_member
	.dwattr $C$DW$1502, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1502, DW_AT_name("unassigned")
	.dwattr $C$DW$1502, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1502, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1502, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1502, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1502, DW_AT_decl_line(0x88)
	.dwattr $C$DW$1502, DW_AT_decl_column(0x12)

$C$DW$1503	.dwtag  DW_TAG_member
	.dwattr $C$DW$1503, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1503, DW_AT_name("probe_triggered")
	.dwattr $C$DW$1503, DW_AT_TI_symbol_name("probe_triggered")
	.dwattr $C$DW$1503, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1503, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1503, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1503, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1503, DW_AT_decl_column(0x12)

$C$DW$1504	.dwtag  DW_TAG_member
	.dwattr $C$DW$1504, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1504, DW_AT_name("deasserted")
	.dwattr $C$DW$1504, DW_AT_TI_symbol_name("deasserted")
	.dwattr $C$DW$1504, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1504, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1504, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$1504, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1504, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$34, DW_AT_decl_file("..\grbl\system.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$34


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$1505	.dwtag  DW_TAG_member
	.dwattr $C$DW$1505, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1505, DW_AT_name("flood")
	.dwattr $C$DW$1505, DW_AT_TI_symbol_name("flood")
	.dwattr $C$DW$1505, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1505, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1505, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1505, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$1505, DW_AT_decl_column(0x11)

$C$DW$1506	.dwtag  DW_TAG_member
	.dwattr $C$DW$1506, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1506, DW_AT_name("mist")
	.dwattr $C$DW$1506, DW_AT_TI_symbol_name("mist")
	.dwattr $C$DW$1506, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1506, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1506, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1506, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$1506, DW_AT_decl_column(0x11)

$C$DW$1507	.dwtag  DW_TAG_member
	.dwattr $C$DW$1507, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1507, DW_AT_name("shower")
	.dwattr $C$DW$1507, DW_AT_TI_symbol_name("shower")
	.dwattr $C$DW$1507, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1507, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1507, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1507, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1507, DW_AT_decl_column(0x11)

$C$DW$1508	.dwtag  DW_TAG_member
	.dwattr $C$DW$1508, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1508, DW_AT_name("trough_spindle")
	.dwattr $C$DW$1508, DW_AT_TI_symbol_name("trough_spindle")
	.dwattr $C$DW$1508, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1508, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1508, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1508, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1508, DW_AT_decl_column(0x11)

$C$DW$1509	.dwtag  DW_TAG_member
	.dwattr $C$DW$1509, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1509, DW_AT_name("unused")
	.dwattr $C$DW$1509, DW_AT_TI_symbol_name("unused")
	.dwattr $C$DW$1509, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1509, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1509, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$1509, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1509, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$37, DW_AT_decl_file("..\grbl\coolant_control.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$37


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
$C$DW$1510	.dwtag  DW_TAG_member
	.dwattr $C$DW$1510, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1510, DW_AT_name("rpm")
	.dwattr $C$DW$1510, DW_AT_TI_symbol_name("rpm")
	.dwattr $C$DW$1510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1510, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1510, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$1510, DW_AT_decl_column(0x0b)

$C$DW$1511	.dwtag  DW_TAG_member
	.dwattr $C$DW$1511, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1511, DW_AT_name("start")
	.dwattr $C$DW$1511, DW_AT_TI_symbol_name("start")
	.dwattr $C$DW$1511, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1511, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1511, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1511, DW_AT_decl_column(0x0b)

$C$DW$1512	.dwtag  DW_TAG_member
	.dwattr $C$DW$1512, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1512, DW_AT_name("end")
	.dwattr $C$DW$1512, DW_AT_TI_symbol_name("end")
	.dwattr $C$DW$1512, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1512, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1512, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1512, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$38, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$38

$C$DW$T$42	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$42, DW_AT_name("pwm_piece_t")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$42, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x03)


$C$DW$T$43	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x30)
$C$DW$1513	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1513, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$43


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x20)
$C$DW$1514	.dwtag  DW_TAG_member
	.dwattr $C$DW$1514, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1514, DW_AT_name("p_gain")
	.dwattr $C$DW$1514, DW_AT_TI_symbol_name("p_gain")
	.dwattr $C$DW$1514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1514, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1514, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1514, DW_AT_decl_column(0x0b)

$C$DW$1515	.dwtag  DW_TAG_member
	.dwattr $C$DW$1515, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1515, DW_AT_name("i_gain")
	.dwattr $C$DW$1515, DW_AT_TI_symbol_name("i_gain")
	.dwattr $C$DW$1515, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1515, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1515, DW_AT_decl_line(0x198)
	.dwattr $C$DW$1515, DW_AT_decl_column(0x0b)

$C$DW$1516	.dwtag  DW_TAG_member
	.dwattr $C$DW$1516, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1516, DW_AT_name("d_gain")
	.dwattr $C$DW$1516, DW_AT_TI_symbol_name("d_gain")
	.dwattr $C$DW$1516, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1516, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1516, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1516, DW_AT_decl_column(0x0b)

$C$DW$1517	.dwtag  DW_TAG_member
	.dwattr $C$DW$1517, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1517, DW_AT_name("p_max_error")
	.dwattr $C$DW$1517, DW_AT_TI_symbol_name("p_max_error")
	.dwattr $C$DW$1517, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1517, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1517, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$1517, DW_AT_decl_column(0x0b)

$C$DW$1518	.dwtag  DW_TAG_member
	.dwattr $C$DW$1518, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1518, DW_AT_name("i_max_error")
	.dwattr $C$DW$1518, DW_AT_TI_symbol_name("i_max_error")
	.dwattr $C$DW$1518, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1518, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1518, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$1518, DW_AT_decl_column(0x0b)

$C$DW$1519	.dwtag  DW_TAG_member
	.dwattr $C$DW$1519, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1519, DW_AT_name("d_max_error")
	.dwattr $C$DW$1519, DW_AT_TI_symbol_name("d_max_error")
	.dwattr $C$DW$1519, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1519, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1519, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1519, DW_AT_decl_column(0x0b)

$C$DW$1520	.dwtag  DW_TAG_member
	.dwattr $C$DW$1520, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1520, DW_AT_name("deadband")
	.dwattr $C$DW$1520, DW_AT_TI_symbol_name("deadband")
	.dwattr $C$DW$1520, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1520, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1520, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1520, DW_AT_decl_column(0x0b)

$C$DW$1521	.dwtag  DW_TAG_member
	.dwattr $C$DW$1521, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1521, DW_AT_name("max_error")
	.dwattr $C$DW$1521, DW_AT_TI_symbol_name("max_error")
	.dwattr $C$DW$1521, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1521, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1521, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1521, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$39

$C$DW$T$44	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$44, DW_AT_name("pid_values_t")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x03)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$1522	.dwtag  DW_TAG_member
	.dwattr $C$DW$1522, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1522, DW_AT_name("on")
	.dwattr $C$DW$1522, DW_AT_TI_symbol_name("on")
	.dwattr $C$DW$1522, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1522, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1522, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1522, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1522, DW_AT_decl_column(0x11)

$C$DW$1523	.dwtag  DW_TAG_member
	.dwattr $C$DW$1523, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1523, DW_AT_name("ccw")
	.dwattr $C$DW$1523, DW_AT_TI_symbol_name("ccw")
	.dwattr $C$DW$1523, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1523, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1523, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1523, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1523, DW_AT_decl_column(0x11)

$C$DW$1524	.dwtag  DW_TAG_member
	.dwattr $C$DW$1524, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1524, DW_AT_name("pwm")
	.dwattr $C$DW$1524, DW_AT_TI_symbol_name("pwm")
	.dwattr $C$DW$1524, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1524, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1524, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1524, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1524, DW_AT_decl_column(0x11)

$C$DW$1525	.dwtag  DW_TAG_member
	.dwattr $C$DW$1525, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1525, DW_AT_name("reserved3")
	.dwattr $C$DW$1525, DW_AT_TI_symbol_name("reserved3")
	.dwattr $C$DW$1525, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1525, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1525, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1525, DW_AT_decl_line(0x22)
	.dwattr $C$DW$1525, DW_AT_decl_column(0x11)

$C$DW$1526	.dwtag  DW_TAG_member
	.dwattr $C$DW$1526, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1526, DW_AT_name("reserved4")
	.dwattr $C$DW$1526, DW_AT_TI_symbol_name("reserved4")
	.dwattr $C$DW$1526, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1526, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1526, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1526, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1526, DW_AT_decl_column(0x11)

$C$DW$1527	.dwtag  DW_TAG_member
	.dwattr $C$DW$1527, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1527, DW_AT_name("encoder_error")
	.dwattr $C$DW$1527, DW_AT_TI_symbol_name("encoder_error")
	.dwattr $C$DW$1527, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1527, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1527, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1527, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1527, DW_AT_decl_column(0x11)

$C$DW$1528	.dwtag  DW_TAG_member
	.dwattr $C$DW$1528, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1528, DW_AT_name("at_speed")
	.dwattr $C$DW$1528, DW_AT_TI_symbol_name("at_speed")
	.dwattr $C$DW$1528, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1528, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1528, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1528, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1528, DW_AT_decl_column(0x11)

$C$DW$1529	.dwtag  DW_TAG_member
	.dwattr $C$DW$1529, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1529, DW_AT_name("synchronized")
	.dwattr $C$DW$1529, DW_AT_TI_symbol_name("synchronized")
	.dwattr $C$DW$1529, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1529, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1529, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$1529, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1529, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\grbl\spindle_control.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$40


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$1530	.dwtag  DW_TAG_member
	.dwattr $C$DW$1530, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1530, DW_AT_name("pwm_action")
	.dwattr $C$DW$1530, DW_AT_TI_symbol_name("pwm_action")
	.dwattr $C$DW$1530, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1530, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1530, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1530, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$1530, DW_AT_decl_column(0x11)

$C$DW$1531	.dwtag  DW_TAG_member
	.dwattr $C$DW$1531, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1531, DW_AT_name("unassigned")
	.dwattr $C$DW$1531, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1531, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1531, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1531, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1531, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$1531, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$41


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x74)
$C$DW$1532	.dwtag  DW_TAG_member
	.dwattr $C$DW$1532, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1532, DW_AT_name("rpm_max")
	.dwattr $C$DW$1532, DW_AT_TI_symbol_name("rpm_max")
	.dwattr $C$DW$1532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1532, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1532, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1532, DW_AT_decl_column(0x0b)

$C$DW$1533	.dwtag  DW_TAG_member
	.dwattr $C$DW$1533, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1533, DW_AT_name("rpm_min")
	.dwattr $C$DW$1533, DW_AT_TI_symbol_name("rpm_min")
	.dwattr $C$DW$1533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1533, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1533, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1533, DW_AT_decl_column(0x0b)

$C$DW$1534	.dwtag  DW_TAG_member
	.dwattr $C$DW$1534, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1534, DW_AT_name("pwm_freq")
	.dwattr $C$DW$1534, DW_AT_TI_symbol_name("pwm_freq")
	.dwattr $C$DW$1534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1534, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1534, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1534, DW_AT_decl_column(0x0b)

$C$DW$1535	.dwtag  DW_TAG_member
	.dwattr $C$DW$1535, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1535, DW_AT_name("pwm_period")
	.dwattr $C$DW$1535, DW_AT_TI_symbol_name("pwm_period")
	.dwattr $C$DW$1535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1535, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1535, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1535, DW_AT_decl_column(0x0b)

$C$DW$1536	.dwtag  DW_TAG_member
	.dwattr $C$DW$1536, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1536, DW_AT_name("pwm_off_value")
	.dwattr $C$DW$1536, DW_AT_TI_symbol_name("pwm_off_value")
	.dwattr $C$DW$1536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1536, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1536, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$1536, DW_AT_decl_column(0x0b)

$C$DW$1537	.dwtag  DW_TAG_member
	.dwattr $C$DW$1537, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1537, DW_AT_name("pwm_min_value")
	.dwattr $C$DW$1537, DW_AT_TI_symbol_name("pwm_min_value")
	.dwattr $C$DW$1537, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1537, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1537, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$1537, DW_AT_decl_column(0x0b)

$C$DW$1538	.dwtag  DW_TAG_member
	.dwattr $C$DW$1538, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1538, DW_AT_name("pwm_max_value")
	.dwattr $C$DW$1538, DW_AT_TI_symbol_name("pwm_max_value")
	.dwattr $C$DW$1538, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1538, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1538, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$1538, DW_AT_decl_column(0x0b)

$C$DW$1539	.dwtag  DW_TAG_member
	.dwattr $C$DW$1539, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1539, DW_AT_name("at_speed_tolerance")
	.dwattr $C$DW$1539, DW_AT_TI_symbol_name("at_speed_tolerance")
	.dwattr $C$DW$1539, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1539, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1539, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$1539, DW_AT_decl_column(0x0b)

$C$DW$1540	.dwtag  DW_TAG_member
	.dwattr $C$DW$1540, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$1540, DW_AT_name("pwm_piece")
	.dwattr $C$DW$1540, DW_AT_TI_symbol_name("pwm_piece")
	.dwattr $C$DW$1540, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1540, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1540, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$1540, DW_AT_decl_column(0x11)

$C$DW$1541	.dwtag  DW_TAG_member
	.dwattr $C$DW$1541, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1541, DW_AT_name("pid")
	.dwattr $C$DW$1541, DW_AT_TI_symbol_name("pid")
	.dwattr $C$DW$1541, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1541, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1541, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$1541, DW_AT_decl_column(0x12)

$C$DW$1542	.dwtag  DW_TAG_member
	.dwattr $C$DW$1542, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1542, DW_AT_name("ppr")
	.dwattr $C$DW$1542, DW_AT_TI_symbol_name("ppr")
	.dwattr $C$DW$1542, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1542, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1542, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$1542, DW_AT_decl_column(0x0e)

$C$DW$1543	.dwtag  DW_TAG_member
	.dwattr $C$DW$1543, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1543, DW_AT_name("invert")
	.dwattr $C$DW$1543, DW_AT_TI_symbol_name("invert")
	.dwattr $C$DW$1543, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$1543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1543, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1543, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$1543, DW_AT_decl_column(0x15)

$C$DW$1544	.dwtag  DW_TAG_member
	.dwattr $C$DW$1544, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1544, DW_AT_name("flags")
	.dwattr $C$DW$1544, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1544, DW_AT_data_member_location[DW_OP_plus_uconst 0x73]
	.dwattr $C$DW$1544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1544, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1544, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$1544, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$47

$C$DW$T$82	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$82, DW_AT_name("spindle_settings_t")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$82, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x03)


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$1545	.dwtag  DW_TAG_member
	.dwattr $C$DW$1545, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1545, DW_AT_name("x")
	.dwattr $C$DW$1545, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1545, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1545, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1545, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1545, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1545, DW_AT_decl_column(0x11)

$C$DW$1546	.dwtag  DW_TAG_member
	.dwattr $C$DW$1546, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1546, DW_AT_name("y")
	.dwattr $C$DW$1546, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1546, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1546, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1546, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1546, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1546, DW_AT_decl_column(0x11)

$C$DW$1547	.dwtag  DW_TAG_member
	.dwattr $C$DW$1547, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1547, DW_AT_name("z")
	.dwattr $C$DW$1547, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1547, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1547, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1547, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1547, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1547, DW_AT_decl_column(0x11)

$C$DW$1548	.dwtag  DW_TAG_member
	.dwattr $C$DW$1548, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1548, DW_AT_name("a")
	.dwattr $C$DW$1548, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1548, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1548, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1548, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1548, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1548, DW_AT_decl_column(0x11)

$C$DW$1549	.dwtag  DW_TAG_member
	.dwattr $C$DW$1549, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1549, DW_AT_name("b")
	.dwattr $C$DW$1549, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$1549, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1549, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1549, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1549, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1549, DW_AT_decl_column(0x11)

$C$DW$1550	.dwtag  DW_TAG_member
	.dwattr $C$DW$1550, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1550, DW_AT_name("c")
	.dwattr $C$DW$1550, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$1550, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1550, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1550, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1550, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1550, DW_AT_decl_column(0x11)

$C$DW$1551	.dwtag  DW_TAG_member
	.dwattr $C$DW$1551, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1551, DW_AT_name("u")
	.dwattr $C$DW$1551, DW_AT_TI_symbol_name("u")
	.dwattr $C$DW$1551, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1551, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1551, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1551, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1551, DW_AT_decl_column(0x11)

$C$DW$1552	.dwtag  DW_TAG_member
	.dwattr $C$DW$1552, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1552, DW_AT_name("v")
	.dwattr $C$DW$1552, DW_AT_TI_symbol_name("v")
	.dwattr $C$DW$1552, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1552, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1552, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$1552, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1552, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\grbl\nuts_bolts.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$48


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
$C$DW$1553	.dwtag  DW_TAG_member
	.dwattr $C$DW$1553, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1553, DW_AT_name("step_invert")
	.dwattr $C$DW$1553, DW_AT_TI_symbol_name("step_invert")
	.dwattr $C$DW$1553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1553, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1553, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$1553, DW_AT_decl_column(0x14)

$C$DW$1554	.dwtag  DW_TAG_member
	.dwattr $C$DW$1554, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1554, DW_AT_name("dir_invert")
	.dwattr $C$DW$1554, DW_AT_TI_symbol_name("dir_invert")
	.dwattr $C$DW$1554, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1554, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1554, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1554, DW_AT_decl_column(0x14)

$C$DW$1555	.dwtag  DW_TAG_member
	.dwattr $C$DW$1555, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1555, DW_AT_name("ganged_dir_invert")
	.dwattr $C$DW$1555, DW_AT_TI_symbol_name("ganged_dir_invert")
	.dwattr $C$DW$1555, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1555, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1555, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1555, DW_AT_decl_column(0x14)

$C$DW$1556	.dwtag  DW_TAG_member
	.dwattr $C$DW$1556, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1556, DW_AT_name("enable_invert")
	.dwattr $C$DW$1556, DW_AT_TI_symbol_name("enable_invert")
	.dwattr $C$DW$1556, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1556, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1556, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1556, DW_AT_decl_column(0x14)

$C$DW$1557	.dwtag  DW_TAG_member
	.dwattr $C$DW$1557, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1557, DW_AT_name("deenergize")
	.dwattr $C$DW$1557, DW_AT_TI_symbol_name("deenergize")
	.dwattr $C$DW$1557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1557, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1557, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1557, DW_AT_decl_column(0x14)

$C$DW$1558	.dwtag  DW_TAG_member
	.dwattr $C$DW$1558, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1558, DW_AT_name("pulse_microseconds")
	.dwattr $C$DW$1558, DW_AT_TI_symbol_name("pulse_microseconds")
	.dwattr $C$DW$1558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1558, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1558, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$1558, DW_AT_decl_column(0x0b)

$C$DW$1559	.dwtag  DW_TAG_member
	.dwattr $C$DW$1559, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1559, DW_AT_name("pulse_delay_microseconds")
	.dwattr $C$DW$1559, DW_AT_TI_symbol_name("pulse_delay_microseconds")
	.dwattr $C$DW$1559, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1559, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1559, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$1559, DW_AT_decl_column(0x0b)

$C$DW$1560	.dwtag  DW_TAG_member
	.dwattr $C$DW$1560, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1560, DW_AT_name("idle_lock_time")
	.dwattr $C$DW$1560, DW_AT_TI_symbol_name("idle_lock_time")
	.dwattr $C$DW$1560, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1560, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1560, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$1560, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$50, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$50

$C$DW$T$83	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$83, DW_AT_name("stepper_settings_t")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$83, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x03)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
$C$DW$1561	.dwtag  DW_TAG_member
	.dwattr $C$DW$1561, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1561, DW_AT_name("machine_position")
	.dwattr $C$DW$1561, DW_AT_TI_symbol_name("machine_position")
	.dwattr $C$DW$1561, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1561, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1561, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1561, DW_AT_decl_line(0x164)
	.dwattr $C$DW$1561, DW_AT_decl_column(0x12)

$C$DW$1562	.dwtag  DW_TAG_member
	.dwattr $C$DW$1562, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1562, DW_AT_name("buffer_state")
	.dwattr $C$DW$1562, DW_AT_TI_symbol_name("buffer_state")
	.dwattr $C$DW$1562, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1562, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1562, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1562, DW_AT_decl_line(0x165)
	.dwattr $C$DW$1562, DW_AT_decl_column(0x12)

$C$DW$1563	.dwtag  DW_TAG_member
	.dwattr $C$DW$1563, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1563, DW_AT_name("line_numbers")
	.dwattr $C$DW$1563, DW_AT_TI_symbol_name("line_numbers")
	.dwattr $C$DW$1563, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1563, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1563, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1563, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1563, DW_AT_decl_column(0x12)

$C$DW$1564	.dwtag  DW_TAG_member
	.dwattr $C$DW$1564, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1564, DW_AT_name("feed_speed")
	.dwattr $C$DW$1564, DW_AT_TI_symbol_name("feed_speed")
	.dwattr $C$DW$1564, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1564, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1564, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1564, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1564, DW_AT_decl_column(0x12)

$C$DW$1565	.dwtag  DW_TAG_member
	.dwattr $C$DW$1565, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1565, DW_AT_name("pin_state")
	.dwattr $C$DW$1565, DW_AT_TI_symbol_name("pin_state")
	.dwattr $C$DW$1565, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1565, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1565, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1565, DW_AT_decl_line(0x168)
	.dwattr $C$DW$1565, DW_AT_decl_column(0x12)

$C$DW$1566	.dwtag  DW_TAG_member
	.dwattr $C$DW$1566, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1566, DW_AT_name("work_coord_offset")
	.dwattr $C$DW$1566, DW_AT_TI_symbol_name("work_coord_offset")
	.dwattr $C$DW$1566, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1566, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1566, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1566, DW_AT_decl_line(0x169)
	.dwattr $C$DW$1566, DW_AT_decl_column(0x12)

$C$DW$1567	.dwtag  DW_TAG_member
	.dwattr $C$DW$1567, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1567, DW_AT_name("overrides")
	.dwattr $C$DW$1567, DW_AT_TI_symbol_name("overrides")
	.dwattr $C$DW$1567, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1567, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1567, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1567, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$1567, DW_AT_decl_column(0x12)

$C$DW$1568	.dwtag  DW_TAG_member
	.dwattr $C$DW$1568, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1568, DW_AT_name("probe_coordinates")
	.dwattr $C$DW$1568, DW_AT_TI_symbol_name("probe_coordinates")
	.dwattr $C$DW$1568, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1568, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1568, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1568, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$1568, DW_AT_decl_column(0x12)

$C$DW$1569	.dwtag  DW_TAG_member
	.dwattr $C$DW$1569, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1569, DW_AT_name("sync_on_wco_change")
	.dwattr $C$DW$1569, DW_AT_TI_symbol_name("sync_on_wco_change")
	.dwattr $C$DW$1569, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1569, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1569, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1569, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$1569, DW_AT_decl_column(0x12)

$C$DW$1570	.dwtag  DW_TAG_member
	.dwattr $C$DW$1570, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1570, DW_AT_name("parser_state")
	.dwattr $C$DW$1570, DW_AT_TI_symbol_name("parser_state")
	.dwattr $C$DW$1570, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1570, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1570, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1570, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$1570, DW_AT_decl_column(0x12)

$C$DW$1571	.dwtag  DW_TAG_member
	.dwattr $C$DW$1571, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1571, DW_AT_name("alarm_substate")
	.dwattr $C$DW$1571, DW_AT_TI_symbol_name("alarm_substate")
	.dwattr $C$DW$1571, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1571, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1571, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1571, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$1571, DW_AT_decl_column(0x12)

$C$DW$1572	.dwtag  DW_TAG_member
	.dwattr $C$DW$1572, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1572, DW_AT_name("run_substate")
	.dwattr $C$DW$1572, DW_AT_TI_symbol_name("run_substate")
	.dwattr $C$DW$1572, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1572, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1572, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1572, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$1572, DW_AT_decl_column(0x12)

$C$DW$1573	.dwtag  DW_TAG_member
	.dwattr $C$DW$1573, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1573, DW_AT_name("unassigned")
	.dwattr $C$DW$1573, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1573, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1573, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1573, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1573, DW_AT_decl_line(0x170)
	.dwattr $C$DW$1573, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x163)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$51


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
$C$DW$1574	.dwtag  DW_TAG_member
	.dwattr $C$DW$1574, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1574, DW_AT_name("report_inches")
	.dwattr $C$DW$1574, DW_AT_TI_symbol_name("report_inches")
	.dwattr $C$DW$1574, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1574, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1574, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1574, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1574, DW_AT_decl_column(0x12)

$C$DW$1575	.dwtag  DW_TAG_member
	.dwattr $C$DW$1575, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1575, DW_AT_name("restore_overrides")
	.dwattr $C$DW$1575, DW_AT_TI_symbol_name("restore_overrides")
	.dwattr $C$DW$1575, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1575, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1575, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1575, DW_AT_decl_line(0x147)
	.dwattr $C$DW$1575, DW_AT_decl_column(0x12)

$C$DW$1576	.dwtag  DW_TAG_member
	.dwattr $C$DW$1576, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1576, DW_AT_name("unused0")
	.dwattr $C$DW$1576, DW_AT_TI_symbol_name("unused0")
	.dwattr $C$DW$1576, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1576, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1576, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1576, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1576, DW_AT_decl_column(0x12)

$C$DW$1577	.dwtag  DW_TAG_member
	.dwattr $C$DW$1577, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1577, DW_AT_name("sleep_enable")
	.dwattr $C$DW$1577, DW_AT_TI_symbol_name("sleep_enable")
	.dwattr $C$DW$1577, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1577, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1577, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1577, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1577, DW_AT_decl_column(0x12)

$C$DW$1578	.dwtag  DW_TAG_member
	.dwattr $C$DW$1578, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1578, DW_AT_name("disable_laser_during_hold")
	.dwattr $C$DW$1578, DW_AT_TI_symbol_name("disable_laser_during_hold")
	.dwattr $C$DW$1578, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1578, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1578, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1578, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1578, DW_AT_decl_column(0x12)

$C$DW$1579	.dwtag  DW_TAG_member
	.dwattr $C$DW$1579, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1579, DW_AT_name("force_initialization_alarm")
	.dwattr $C$DW$1579, DW_AT_TI_symbol_name("force_initialization_alarm")
	.dwattr $C$DW$1579, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1579, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1579, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1579, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$1579, DW_AT_decl_column(0x12)

$C$DW$1580	.dwtag  DW_TAG_member
	.dwattr $C$DW$1580, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1580, DW_AT_name("legacy_rt_commands")
	.dwattr $C$DW$1580, DW_AT_TI_symbol_name("legacy_rt_commands")
	.dwattr $C$DW$1580, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1580, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1580, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1580, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$1580, DW_AT_decl_column(0x12)

$C$DW$1581	.dwtag  DW_TAG_member
	.dwattr $C$DW$1581, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1581, DW_AT_name("restore_after_feed_hold")
	.dwattr $C$DW$1581, DW_AT_TI_symbol_name("restore_after_feed_hold")
	.dwattr $C$DW$1581, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1581, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1581, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1581, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1581, DW_AT_decl_column(0x12)

$C$DW$1582	.dwtag  DW_TAG_member
	.dwattr $C$DW$1582, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1582, DW_AT_name("unused1")
	.dwattr $C$DW$1582, DW_AT_TI_symbol_name("unused1")
	.dwattr $C$DW$1582, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1582, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1582, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1582, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$1582, DW_AT_decl_column(0x12)

$C$DW$1583	.dwtag  DW_TAG_member
	.dwattr $C$DW$1583, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1583, DW_AT_name("g92_is_volatile")
	.dwattr $C$DW$1583, DW_AT_TI_symbol_name("g92_is_volatile")
	.dwattr $C$DW$1583, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1583, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1583, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1583, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$1583, DW_AT_decl_column(0x12)

$C$DW$1584	.dwtag  DW_TAG_member
	.dwattr $C$DW$1584, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1584, DW_AT_name("unassigned")
	.dwattr $C$DW$1584, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1584, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1584, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1584, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1584, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1584, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x145)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$52


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$1585	.dwtag  DW_TAG_member
	.dwattr $C$DW$1585, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1585, DW_AT_name("invert_probe_pin")
	.dwattr $C$DW$1585, DW_AT_TI_symbol_name("invert_probe_pin")
	.dwattr $C$DW$1585, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1585, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1585, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1585, DW_AT_decl_line(0x157)
	.dwattr $C$DW$1585, DW_AT_decl_column(0x11)

$C$DW$1586	.dwtag  DW_TAG_member
	.dwattr $C$DW$1586, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1586, DW_AT_name("disable_probe_pullup")
	.dwattr $C$DW$1586, DW_AT_TI_symbol_name("disable_probe_pullup")
	.dwattr $C$DW$1586, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1586, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1586, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1586, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1586, DW_AT_decl_column(0x11)

$C$DW$1587	.dwtag  DW_TAG_member
	.dwattr $C$DW$1587, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1587, DW_AT_name("invert_connected_pin")
	.dwattr $C$DW$1587, DW_AT_TI_symbol_name("invert_connected_pin")
	.dwattr $C$DW$1587, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1587, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1587, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1587, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1587, DW_AT_decl_column(0x11)

$C$DW$1588	.dwtag  DW_TAG_member
	.dwattr $C$DW$1588, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1588, DW_AT_name("disable_connected_pullup")
	.dwattr $C$DW$1588, DW_AT_TI_symbol_name("disable_connected_pullup")
	.dwattr $C$DW$1588, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1588, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1588, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1588, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$1588, DW_AT_decl_column(0x11)

$C$DW$1589	.dwtag  DW_TAG_member
	.dwattr $C$DW$1589, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1589, DW_AT_name("allow_feed_override")
	.dwattr $C$DW$1589, DW_AT_TI_symbol_name("allow_feed_override")
	.dwattr $C$DW$1589, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1589, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1589, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1589, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1589, DW_AT_decl_column(0x11)

$C$DW$1590	.dwtag  DW_TAG_member
	.dwattr $C$DW$1590, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1590, DW_AT_name("enable_protection")
	.dwattr $C$DW$1590, DW_AT_TI_symbol_name("enable_protection")
	.dwattr $C$DW$1590, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1590, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1590, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1590, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1590, DW_AT_decl_column(0x11)

$C$DW$1591	.dwtag  DW_TAG_member
	.dwattr $C$DW$1591, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1591, DW_AT_name("unassigned")
	.dwattr $C$DW$1591, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1591, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1591, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1591, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1591, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1591, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$53


$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$1592	.dwtag  DW_TAG_member
	.dwattr $C$DW$1592, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1592, DW_AT_name("enabled")
	.dwattr $C$DW$1592, DW_AT_TI_symbol_name("enabled")
	.dwattr $C$DW$1592, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1592, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1592, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1592, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1592, DW_AT_decl_column(0x11)

$C$DW$1593	.dwtag  DW_TAG_member
	.dwattr $C$DW$1593, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1593, DW_AT_name("single_axis_commands")
	.dwattr $C$DW$1593, DW_AT_TI_symbol_name("single_axis_commands")
	.dwattr $C$DW$1593, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1593, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1593, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1593, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$1593, DW_AT_decl_column(0x11)

$C$DW$1594	.dwtag  DW_TAG_member
	.dwattr $C$DW$1594, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1594, DW_AT_name("init_lock")
	.dwattr $C$DW$1594, DW_AT_TI_symbol_name("init_lock")
	.dwattr $C$DW$1594, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1594, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1594, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1594, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$1594, DW_AT_decl_column(0x11)

$C$DW$1595	.dwtag  DW_TAG_member
	.dwattr $C$DW$1595, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1595, DW_AT_name("force_set_origin")
	.dwattr $C$DW$1595, DW_AT_TI_symbol_name("force_set_origin")
	.dwattr $C$DW$1595, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1595, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1595, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1595, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$1595, DW_AT_decl_column(0x11)

$C$DW$1596	.dwtag  DW_TAG_member
	.dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1596, DW_AT_name("manual")
	.dwattr $C$DW$1596, DW_AT_TI_symbol_name("manual")
	.dwattr $C$DW$1596, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1596, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1596, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1596, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$1596, DW_AT_decl_column(0x11)

$C$DW$1597	.dwtag  DW_TAG_member
	.dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1597, DW_AT_name("override_locks")
	.dwattr $C$DW$1597, DW_AT_TI_symbol_name("override_locks")
	.dwattr $C$DW$1597, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1597, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1597, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1597, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$1597, DW_AT_decl_column(0x11)

$C$DW$1598	.dwtag  DW_TAG_member
	.dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1598, DW_AT_name("keep_on_reset")
	.dwattr $C$DW$1598, DW_AT_TI_symbol_name("keep_on_reset")
	.dwattr $C$DW$1598, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1598, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1598, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1598, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$1598, DW_AT_decl_column(0x11)

$C$DW$1599	.dwtag  DW_TAG_member
	.dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1599, DW_AT_name("unassigned")
	.dwattr $C$DW$1599, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1599, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1599, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1599, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1599, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$1599, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$54, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$54


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x0c)
$C$DW$1600	.dwtag  DW_TAG_member
	.dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1600, DW_AT_name("fail_length_percent")
	.dwattr $C$DW$1600, DW_AT_TI_symbol_name("fail_length_percent")
	.dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1600, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1600, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$1600, DW_AT_decl_column(0x0b)

$C$DW$1601	.dwtag  DW_TAG_member
	.dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1601, DW_AT_name("fail_distance_max")
	.dwattr $C$DW$1601, DW_AT_TI_symbol_name("fail_distance_max")
	.dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1601, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1601, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$1601, DW_AT_decl_column(0x0b)

$C$DW$1602	.dwtag  DW_TAG_member
	.dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1602, DW_AT_name("fail_distance_min")
	.dwattr $C$DW$1602, DW_AT_TI_symbol_name("fail_distance_min")
	.dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1602, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1602, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$1602, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$55

$C$DW$T$58	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$58, DW_AT_name("homing_dual_axis_t")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$58, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x03)


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x20)
$C$DW$1603	.dwtag  DW_TAG_member
	.dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1603, DW_AT_name("feed_rate")
	.dwattr $C$DW$1603, DW_AT_TI_symbol_name("feed_rate")
	.dwattr $C$DW$1603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1603, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1603, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$1603, DW_AT_decl_column(0x0b)

$C$DW$1604	.dwtag  DW_TAG_member
	.dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1604, DW_AT_name("seek_rate")
	.dwattr $C$DW$1604, DW_AT_TI_symbol_name("seek_rate")
	.dwattr $C$DW$1604, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1604, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1604, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$1604, DW_AT_decl_column(0x0b)

$C$DW$1605	.dwtag  DW_TAG_member
	.dwattr $C$DW$1605, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1605, DW_AT_name("pulloff")
	.dwattr $C$DW$1605, DW_AT_TI_symbol_name("pulloff")
	.dwattr $C$DW$1605, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1605, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1605, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$1605, DW_AT_decl_column(0x0b)

$C$DW$1606	.dwtag  DW_TAG_member
	.dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1606, DW_AT_name("dir_mask")
	.dwattr $C$DW$1606, DW_AT_TI_symbol_name("dir_mask")
	.dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1606, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1606, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$1606, DW_AT_decl_column(0x14)

$C$DW$1607	.dwtag  DW_TAG_member
	.dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1607, DW_AT_name("locate_cycles")
	.dwattr $C$DW$1607, DW_AT_TI_symbol_name("locate_cycles")
	.dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1607, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1607, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$1607, DW_AT_decl_column(0x0d)

$C$DW$1608	.dwtag  DW_TAG_member
	.dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1608, DW_AT_name("debounce_delay")
	.dwattr $C$DW$1608, DW_AT_TI_symbol_name("debounce_delay")
	.dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1608, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1608, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$1608, DW_AT_decl_column(0x0e)

$C$DW$1609	.dwtag  DW_TAG_member
	.dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$1609, DW_AT_name("flags")
	.dwattr $C$DW$1609, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1609, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1609, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$1609, DW_AT_decl_column(0x1d)

$C$DW$1610	.dwtag  DW_TAG_member
	.dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1610, DW_AT_name("cycle")
	.dwattr $C$DW$1610, DW_AT_TI_symbol_name("cycle")
	.dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1610, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1610, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$1610, DW_AT_decl_column(0x14)

$C$DW$1611	.dwtag  DW_TAG_member
	.dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$1611, DW_AT_name("dual_axis")
	.dwattr $C$DW$1611, DW_AT_TI_symbol_name("dual_axis")
	.dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1611, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1611, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$1611, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$59, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$59

$C$DW$T$87	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$87, DW_AT_name("homing_settings_t")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$87, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x03)


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
$C$DW$1612	.dwtag  DW_TAG_member
	.dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1612, DW_AT_name("hard_enabled")
	.dwattr $C$DW$1612, DW_AT_TI_symbol_name("hard_enabled")
	.dwattr $C$DW$1612, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1612, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1612, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1612, DW_AT_decl_line(0x200)
	.dwattr $C$DW$1612, DW_AT_decl_column(0x11)

$C$DW$1613	.dwtag  DW_TAG_member
	.dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1613, DW_AT_name("soft_enabled")
	.dwattr $C$DW$1613, DW_AT_TI_symbol_name("soft_enabled")
	.dwattr $C$DW$1613, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1613, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1613, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1613, DW_AT_decl_line(0x201)
	.dwattr $C$DW$1613, DW_AT_decl_column(0x11)

$C$DW$1614	.dwtag  DW_TAG_member
	.dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1614, DW_AT_name("check_at_init")
	.dwattr $C$DW$1614, DW_AT_TI_symbol_name("check_at_init")
	.dwattr $C$DW$1614, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1614, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1614, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1614, DW_AT_decl_line(0x202)
	.dwattr $C$DW$1614, DW_AT_decl_column(0x11)

$C$DW$1615	.dwtag  DW_TAG_member
	.dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1615, DW_AT_name("jog_soft_limited")
	.dwattr $C$DW$1615, DW_AT_TI_symbol_name("jog_soft_limited")
	.dwattr $C$DW$1615, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1615, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1615, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1615, DW_AT_decl_line(0x203)
	.dwattr $C$DW$1615, DW_AT_decl_column(0x11)

$C$DW$1616	.dwtag  DW_TAG_member
	.dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1616, DW_AT_name("two_switches")
	.dwattr $C$DW$1616, DW_AT_TI_symbol_name("two_switches")
	.dwattr $C$DW$1616, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1616, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1616, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1616, DW_AT_decl_line(0x204)
	.dwattr $C$DW$1616, DW_AT_decl_column(0x11)

$C$DW$1617	.dwtag  DW_TAG_member
	.dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1617, DW_AT_name("unassigned")
	.dwattr $C$DW$1617, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1617, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1617, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1617, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1617, DW_AT_decl_line(0x205)
	.dwattr $C$DW$1617, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$60


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x03)
$C$DW$1618	.dwtag  DW_TAG_member
	.dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$1618, DW_AT_name("flags")
	.dwattr $C$DW$1618, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1618, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1618, DW_AT_decl_line(0x20a)
	.dwattr $C$DW$1618, DW_AT_decl_column(0x1c)

$C$DW$1619	.dwtag  DW_TAG_member
	.dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1619, DW_AT_name("invert")
	.dwattr $C$DW$1619, DW_AT_TI_symbol_name("invert")
	.dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1619, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1619, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$1619, DW_AT_decl_column(0x14)

$C$DW$1620	.dwtag  DW_TAG_member
	.dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1620, DW_AT_name("disable_pullup")
	.dwattr $C$DW$1620, DW_AT_TI_symbol_name("disable_pullup")
	.dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1620, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1620, DW_AT_decl_line(0x20c)
	.dwattr $C$DW$1620, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x209)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$62

$C$DW$T$88	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$88, DW_AT_name("limit_settings_t")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$88, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0x20d)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
$C$DW$1621	.dwtag  DW_TAG_member
	.dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1621, DW_AT_name("enabled")
	.dwattr $C$DW$1621, DW_AT_TI_symbol_name("enabled")
	.dwattr $C$DW$1621, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1621, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1621, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1621, DW_AT_decl_line(0x186)
	.dwattr $C$DW$1621, DW_AT_decl_column(0x11)

$C$DW$1622	.dwtag  DW_TAG_member
	.dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1622, DW_AT_name("deactivate_upon_init")
	.dwattr $C$DW$1622, DW_AT_TI_symbol_name("deactivate_upon_init")
	.dwattr $C$DW$1622, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1622, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1622, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1622, DW_AT_decl_line(0x187)
	.dwattr $C$DW$1622, DW_AT_decl_column(0x11)

$C$DW$1623	.dwtag  DW_TAG_member
	.dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1623, DW_AT_name("enable_override_control")
	.dwattr $C$DW$1623, DW_AT_TI_symbol_name("enable_override_control")
	.dwattr $C$DW$1623, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1623, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1623, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1623, DW_AT_decl_line(0x188)
	.dwattr $C$DW$1623, DW_AT_decl_column(0x11)

$C$DW$1624	.dwtag  DW_TAG_member
	.dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1624, DW_AT_name("unassigned")
	.dwattr $C$DW$1624, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1624, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1624, DW_AT_bit_size(0x05)
	.dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1624, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1624, DW_AT_decl_line(0x189)
	.dwattr $C$DW$1624, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$63


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x12)
$C$DW$1625	.dwtag  DW_TAG_member
	.dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1625, DW_AT_name("flags")
	.dwattr $C$DW$1625, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1625, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1625, DW_AT_decl_line(0x18e)
	.dwattr $C$DW$1625, DW_AT_decl_column(0x1d)

$C$DW$1626	.dwtag  DW_TAG_member
	.dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1626, DW_AT_name("axis")
	.dwattr $C$DW$1626, DW_AT_TI_symbol_name("axis")
	.dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1626, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1626, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$1626, DW_AT_decl_column(0x0d)

$C$DW$1627	.dwtag  DW_TAG_member
	.dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1627, DW_AT_name("target")
	.dwattr $C$DW$1627, DW_AT_TI_symbol_name("target")
	.dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1627, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1627, DW_AT_decl_line(0x190)
	.dwattr $C$DW$1627, DW_AT_decl_column(0x0b)

$C$DW$1628	.dwtag  DW_TAG_member
	.dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1628, DW_AT_name("rate")
	.dwattr $C$DW$1628, DW_AT_TI_symbol_name("rate")
	.dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1628, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1628, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1628, DW_AT_decl_column(0x0b)

$C$DW$1629	.dwtag  DW_TAG_member
	.dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1629, DW_AT_name("pullout_rate")
	.dwattr $C$DW$1629, DW_AT_TI_symbol_name("pullout_rate")
	.dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1629, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1629, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1629, DW_AT_decl_column(0x0b)

$C$DW$1630	.dwtag  DW_TAG_member
	.dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1630, DW_AT_name("pullout_increment")
	.dwattr $C$DW$1630, DW_AT_TI_symbol_name("pullout_increment")
	.dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1630, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1630, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1630, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$65

$C$DW$T$89	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$89, DW_AT_name("parking_settings_t")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$89, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x03)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$1631	.dwtag  DW_TAG_member
	.dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1631, DW_AT_name("ignore_when_idle")
	.dwattr $C$DW$1631, DW_AT_TI_symbol_name("ignore_when_idle")
	.dwattr $C$DW$1631, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1631, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1631, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1631, DW_AT_decl_line(0x177)
	.dwattr $C$DW$1631, DW_AT_decl_column(0x11)

$C$DW$1632	.dwtag  DW_TAG_member
	.dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1632, DW_AT_name("keep_coolant_on")
	.dwattr $C$DW$1632, DW_AT_TI_symbol_name("keep_coolant_on")
	.dwattr $C$DW$1632, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1632, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1632, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1632, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1632, DW_AT_decl_column(0x11)

$C$DW$1633	.dwtag  DW_TAG_member
	.dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$1633, DW_AT_name("unassigned")
	.dwattr $C$DW$1633, DW_AT_TI_symbol_name("unassigned")
	.dwattr $C$DW$1633, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1633, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1633, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1633, DW_AT_decl_line(0x179)
	.dwattr $C$DW$1633, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$66, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x176)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$66


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x0a)
$C$DW$1634	.dwtag  DW_TAG_member
	.dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1634, DW_AT_name("flags")
	.dwattr $C$DW$1634, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1634, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1634, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$1634, DW_AT_decl_column(0x21)

$C$DW$1635	.dwtag  DW_TAG_member
	.dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1635, DW_AT_name("spindle_on_delay")
	.dwattr $C$DW$1635, DW_AT_TI_symbol_name("spindle_on_delay")
	.dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1635, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1635, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$1635, DW_AT_decl_column(0x0b)

$C$DW$1636	.dwtag  DW_TAG_member
	.dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1636, DW_AT_name("coolant_on_delay")
	.dwattr $C$DW$1636, DW_AT_TI_symbol_name("coolant_on_delay")
	.dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1636, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1636, DW_AT_decl_line(0x180)
	.dwattr $C$DW$1636, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$68, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$68

$C$DW$T$90	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$90, DW_AT_name("safety_door_settings_t")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$90, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x181)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x03)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x20)
$C$DW$1637	.dwtag  DW_TAG_member
	.dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1637, DW_AT_name("pid")
	.dwattr $C$DW$1637, DW_AT_TI_symbol_name("pid")
	.dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1637, DW_AT_decl_file("..\grbl\settings.h")
	.dwattr $C$DW$1637, DW_AT_decl_line(0x1c1)
